/**
 * Created by yinfxs on 16-9-28.
 */
exports = module.exports =
    [
        {
            "name": "北京市",
            "pId": "1",
            "id": "11",
            "fullname": "北京市",
            "items": [
                {
                    "name": "市辖区",
                    "pId": "11",
                    "id": "1101",
                    "fullname": "北京市市辖区",
                    "items": [
                        {
                            "name": "东城区",
                            "pId": "1101",
                            "id": "110101",
                            "fullname": "北京市市辖区东城区"
                        },
                        {
                            "name": "西城区",
                            "pId": "1101",
                            "id": "110102",
                            "fullname": "北京市市辖区西城区"
                        },
                        {
                            "name": "朝阳区",
                            "pId": "1101",
                            "id": "110105",
                            "fullname": "北京市市辖区朝阳区"
                        },
                        {
                            "name": "丰台区",
                            "pId": "1101",
                            "id": "110106",
                            "fullname": "北京市市辖区丰台区"
                        },
                        {
                            "name": "石景山区",
                            "pId": "1101",
                            "id": "110107",
                            "fullname": "北京市市辖区石景山区"
                        },
                        {
                            "name": "海淀区",
                            "pId": "1101",
                            "id": "110108",
                            "fullname": "北京市市辖区海淀区"
                        },
                        {
                            "name": "门头沟区",
                            "pId": "1101",
                            "id": "110109",
                            "fullname": "北京市市辖区门头沟区"
                        },
                        {
                            "name": "房山区",
                            "pId": "1101",
                            "id": "110111",
                            "fullname": "北京市市辖区房山区"
                        },
                        {
                            "name": "通州区",
                            "pId": "1101",
                            "id": "110112",
                            "fullname": "北京市市辖区通州区"
                        },
                        {
                            "name": "顺义区",
                            "pId": "1101",
                            "id": "110113",
                            "fullname": "北京市市辖区顺义区"
                        },
                        {
                            "name": "昌平区",
                            "pId": "1101",
                            "id": "110114",
                            "fullname": "北京市市辖区昌平区"
                        },
                        {
                            "name": "大兴区",
                            "pId": "1101",
                            "id": "110115",
                            "fullname": "北京市市辖区大兴区"
                        },
                        {
                            "name": "怀柔区",
                            "pId": "1101",
                            "id": "110116",
                            "fullname": "北京市市辖区怀柔区"
                        },
                        {
                            "name": "平谷区",
                            "pId": "1101",
                            "id": "110117",
                            "fullname": "北京市市辖区平谷区"
                        }
                    ]
                },
                {
                    "name": "县",
                    "pId": "11",
                    "id": "1102",
                    "fullname": "北京市县",
                    "items": [
                        {
                            "name": "密云县",
                            "pId": "1102",
                            "id": "110228",
                            "fullname": "北京市县密云县"
                        },
                        {
                            "name": "延庆县",
                            "pId": "1102",
                            "id": "110229",
                            "fullname": "北京市县延庆县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "天津市",
            "pId": "1",
            "id": "12",
            "fullname": "天津市",
            "items": [
                {
                    "name": "市辖区",
                    "pId": "12",
                    "id": "1201",
                    "fullname": "天津市市辖区",
                    "items": [
                        {
                            "name": "和平区",
                            "pId": "1201",
                            "id": "120101",
                            "fullname": "天津市市辖区和平区"
                        },
                        {
                            "name": "河东区",
                            "pId": "1201",
                            "id": "120102",
                            "fullname": "天津市市辖区河东区"
                        },
                        {
                            "name": "河西区",
                            "pId": "1201",
                            "id": "120103",
                            "fullname": "天津市市辖区河西区"
                        },
                        {
                            "name": "南开区",
                            "pId": "1201",
                            "id": "120104",
                            "fullname": "天津市市辖区南开区"
                        },
                        {
                            "name": "河北区",
                            "pId": "1201",
                            "id": "120105",
                            "fullname": "天津市市辖区河北区"
                        },
                        {
                            "name": "红桥区",
                            "pId": "1201",
                            "id": "120106",
                            "fullname": "天津市市辖区红桥区"
                        },
                        {
                            "name": "东丽区",
                            "pId": "1201",
                            "id": "120110",
                            "fullname": "天津市市辖区东丽区"
                        },
                        {
                            "name": "西青区",
                            "pId": "1201",
                            "id": "120111",
                            "fullname": "天津市市辖区西青区"
                        },
                        {
                            "name": "津南区",
                            "pId": "1201",
                            "id": "120112",
                            "fullname": "天津市市辖区津南区"
                        },
                        {
                            "name": "北辰区",
                            "pId": "1201",
                            "id": "120113",
                            "fullname": "天津市市辖区北辰区"
                        },
                        {
                            "name": "武清区",
                            "pId": "1201",
                            "id": "120114",
                            "fullname": "天津市市辖区武清区"
                        },
                        {
                            "name": "宝坻区",
                            "pId": "1201",
                            "id": "120115",
                            "fullname": "天津市市辖区宝坻区"
                        },
                        {
                            "name": "滨海新区",
                            "pId": "1201",
                            "id": "120116",
                            "fullname": "天津市市辖区滨海新区"
                        }
                    ]
                },
                {
                    "name": "县",
                    "pId": "12",
                    "id": "1202",
                    "fullname": "天津市县",
                    "items": [
                        {
                            "name": "宁河县",
                            "pId": "1202",
                            "id": "120221",
                            "fullname": "天津市县宁河县"
                        },
                        {
                            "name": "静海县",
                            "pId": "1202",
                            "id": "120223",
                            "fullname": "天津市县静海县"
                        },
                        {
                            "name": "蓟县",
                            "pId": "1202",
                            "id": "120225",
                            "fullname": "天津市县蓟县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "河北省",
            "pId": "1",
            "id": "13",
            "fullname": "河北省",
            "items": [
                {
                    "name": "石家庄市",
                    "pId": "13",
                    "id": "1301",
                    "fullname": "河北省石家庄市",
                    "items": [
                        {
                            "name": "长安区",
                            "pId": "1301",
                            "id": "130102",
                            "fullname": "河北省石家庄市长安区"
                        },
                        {
                            "name": "桥东区",
                            "pId": "1301",
                            "id": "130103",
                            "fullname": "河北省石家庄市桥东区"
                        },
                        {
                            "name": "桥西区",
                            "pId": "1301",
                            "id": "130104",
                            "fullname": "河北省石家庄市桥西区"
                        },
                        {
                            "name": "新华区",
                            "pId": "1301",
                            "id": "130105",
                            "fullname": "河北省石家庄市新华区"
                        },
                        {
                            "name": "井陉矿区",
                            "pId": "1301",
                            "id": "130107",
                            "fullname": "河北省石家庄市井陉矿区"
                        },
                        {
                            "name": "裕华区",
                            "pId": "1301",
                            "id": "130108",
                            "fullname": "河北省石家庄市裕华区"
                        },
                        {
                            "name": "井陉县",
                            "pId": "1301",
                            "id": "130121",
                            "fullname": "河北省石家庄市井陉县"
                        },
                        {
                            "name": "正定县",
                            "pId": "1301",
                            "id": "130123",
                            "fullname": "河北省石家庄市正定县"
                        },
                        {
                            "name": "栾城县",
                            "pId": "1301",
                            "id": "130124",
                            "fullname": "河北省石家庄市栾城县"
                        },
                        {
                            "name": "行唐县",
                            "pId": "1301",
                            "id": "130125",
                            "fullname": "河北省石家庄市行唐县"
                        },
                        {
                            "name": "灵寿县",
                            "pId": "1301",
                            "id": "130126",
                            "fullname": "河北省石家庄市灵寿县"
                        },
                        {
                            "name": "高邑县",
                            "pId": "1301",
                            "id": "130127",
                            "fullname": "河北省石家庄市高邑县"
                        },
                        {
                            "name": "深泽县",
                            "pId": "1301",
                            "id": "130128",
                            "fullname": "河北省石家庄市深泽县"
                        },
                        {
                            "name": "赞皇县",
                            "pId": "1301",
                            "id": "130129",
                            "fullname": "河北省石家庄市赞皇县"
                        },
                        {
                            "name": "无极县",
                            "pId": "1301",
                            "id": "130130",
                            "fullname": "河北省石家庄市无极县"
                        },
                        {
                            "name": "平山县",
                            "pId": "1301",
                            "id": "130131",
                            "fullname": "河北省石家庄市平山县"
                        },
                        {
                            "name": "元氏县",
                            "pId": "1301",
                            "id": "130132",
                            "fullname": "河北省石家庄市元氏县"
                        },
                        {
                            "name": "赵县",
                            "pId": "1301",
                            "id": "130133",
                            "fullname": "河北省石家庄市赵县"
                        },
                        {
                            "name": "辛集市",
                            "pId": "1301",
                            "id": "130181",
                            "fullname": "河北省石家庄市辛集市"
                        },
                        {
                            "name": "藁城市",
                            "pId": "1301",
                            "id": "130182",
                            "fullname": "河北省石家庄市藁城市"
                        },
                        {
                            "name": "晋州市",
                            "pId": "1301",
                            "id": "130183",
                            "fullname": "河北省石家庄市晋州市"
                        },
                        {
                            "name": "新乐市",
                            "pId": "1301",
                            "id": "130184",
                            "fullname": "河北省石家庄市新乐市"
                        },
                        {
                            "name": "鹿泉市",
                            "pId": "1301",
                            "id": "130185",
                            "fullname": "河北省石家庄市鹿泉市"
                        }
                    ]
                },
                {
                    "name": "唐山市",
                    "pId": "13",
                    "id": "1302",
                    "fullname": "河北省唐山市",
                    "items": [
                        {
                            "name": "路南区",
                            "pId": "1302",
                            "id": "130202",
                            "fullname": "河北省唐山市路南区"
                        },
                        {
                            "name": "路北区",
                            "pId": "1302",
                            "id": "130203",
                            "fullname": "河北省唐山市路北区"
                        },
                        {
                            "name": "古冶区",
                            "pId": "1302",
                            "id": "130204",
                            "fullname": "河北省唐山市古冶区"
                        },
                        {
                            "name": "开平区",
                            "pId": "1302",
                            "id": "130205",
                            "fullname": "河北省唐山市开平区"
                        },
                        {
                            "name": "丰南区",
                            "pId": "1302",
                            "id": "130207",
                            "fullname": "河北省唐山市丰南区"
                        },
                        {
                            "name": "丰润区",
                            "pId": "1302",
                            "id": "130208",
                            "fullname": "河北省唐山市丰润区"
                        },
                        {
                            "name": "曹妃甸区",
                            "pId": "1302",
                            "id": "130209",
                            "fullname": "河北省唐山市曹妃甸区"
                        },
                        {
                            "name": "滦县",
                            "pId": "1302",
                            "id": "130223",
                            "fullname": "河北省唐山市滦县"
                        },
                        {
                            "name": "滦南县",
                            "pId": "1302",
                            "id": "130224",
                            "fullname": "河北省唐山市滦南县"
                        },
                        {
                            "name": "乐亭县",
                            "pId": "1302",
                            "id": "130225",
                            "fullname": "河北省唐山市乐亭县"
                        },
                        {
                            "name": "迁西县",
                            "pId": "1302",
                            "id": "130227",
                            "fullname": "河北省唐山市迁西县"
                        },
                        {
                            "name": "玉田县",
                            "pId": "1302",
                            "id": "130229",
                            "fullname": "河北省唐山市玉田县"
                        },
                        {
                            "name": "遵化市",
                            "pId": "1302",
                            "id": "130281",
                            "fullname": "河北省唐山市遵化市"
                        },
                        {
                            "name": "迁安市",
                            "pId": "1302",
                            "id": "130283",
                            "fullname": "河北省唐山市迁安市"
                        }
                    ]
                },
                {
                    "name": "秦皇岛市",
                    "pId": "13",
                    "id": "1303",
                    "fullname": "河北省秦皇岛市",
                    "items": [
                        {
                            "name": "海港区",
                            "pId": "1303",
                            "id": "130302",
                            "fullname": "河北省秦皇岛市海港区"
                        },
                        {
                            "name": "山海关区",
                            "pId": "1303",
                            "id": "130303",
                            "fullname": "河北省秦皇岛市山海关区"
                        },
                        {
                            "name": "北戴河区",
                            "pId": "1303",
                            "id": "130304",
                            "fullname": "河北省秦皇岛市北戴河区"
                        },
                        {
                            "name": "青龙满族自治县",
                            "pId": "1303",
                            "id": "130321",
                            "fullname": "河北省秦皇岛市青龙满族自治县"
                        },
                        {
                            "name": "昌黎县",
                            "pId": "1303",
                            "id": "130322",
                            "fullname": "河北省秦皇岛市昌黎县"
                        },
                        {
                            "name": "抚宁县",
                            "pId": "1303",
                            "id": "130323",
                            "fullname": "河北省秦皇岛市抚宁县"
                        },
                        {
                            "name": "卢龙县",
                            "pId": "1303",
                            "id": "130324",
                            "fullname": "河北省秦皇岛市卢龙县"
                        }
                    ]
                },
                {
                    "name": "邯郸市",
                    "pId": "13",
                    "id": "1304",
                    "fullname": "河北省邯郸市",
                    "items": [
                        {
                            "name": "邯山区",
                            "pId": "1304",
                            "id": "130402",
                            "fullname": "河北省邯郸市邯山区"
                        },
                        {
                            "name": "丛台区",
                            "pId": "1304",
                            "id": "130403",
                            "fullname": "河北省邯郸市丛台区"
                        },
                        {
                            "name": "复兴区",
                            "pId": "1304",
                            "id": "130404",
                            "fullname": "河北省邯郸市复兴区"
                        },
                        {
                            "name": "峰峰矿区",
                            "pId": "1304",
                            "id": "130406",
                            "fullname": "河北省邯郸市峰峰矿区"
                        },
                        {
                            "name": "邯郸县",
                            "pId": "1304",
                            "id": "130421",
                            "fullname": "河北省邯郸市邯郸县"
                        },
                        {
                            "name": "临漳县",
                            "pId": "1304",
                            "id": "130423",
                            "fullname": "河北省邯郸市临漳县"
                        },
                        {
                            "name": "成安县",
                            "pId": "1304",
                            "id": "130424",
                            "fullname": "河北省邯郸市成安县"
                        },
                        {
                            "name": "大名县",
                            "pId": "1304",
                            "id": "130425",
                            "fullname": "河北省邯郸市大名县"
                        },
                        {
                            "name": "涉县",
                            "pId": "1304",
                            "id": "130426",
                            "fullname": "河北省邯郸市涉县"
                        },
                        {
                            "name": "磁县",
                            "pId": "1304",
                            "id": "130427",
                            "fullname": "河北省邯郸市磁县"
                        },
                        {
                            "name": "肥乡县",
                            "pId": "1304",
                            "id": "130428",
                            "fullname": "河北省邯郸市肥乡县"
                        },
                        {
                            "name": "永年县",
                            "pId": "1304",
                            "id": "130429",
                            "fullname": "河北省邯郸市永年县"
                        },
                        {
                            "name": "邱县",
                            "pId": "1304",
                            "id": "130430",
                            "fullname": "河北省邯郸市邱县"
                        },
                        {
                            "name": "鸡泽县",
                            "pId": "1304",
                            "id": "130431",
                            "fullname": "河北省邯郸市鸡泽县"
                        },
                        {
                            "name": "广平县",
                            "pId": "1304",
                            "id": "130432",
                            "fullname": "河北省邯郸市广平县"
                        },
                        {
                            "name": "馆陶县",
                            "pId": "1304",
                            "id": "130433",
                            "fullname": "河北省邯郸市馆陶县"
                        },
                        {
                            "name": "魏县",
                            "pId": "1304",
                            "id": "130434",
                            "fullname": "河北省邯郸市魏县"
                        },
                        {
                            "name": "曲周县",
                            "pId": "1304",
                            "id": "130435",
                            "fullname": "河北省邯郸市曲周县"
                        },
                        {
                            "name": "武安市",
                            "pId": "1304",
                            "id": "130481",
                            "fullname": "河北省邯郸市武安市"
                        }
                    ]
                },
                {
                    "name": "邢台市",
                    "pId": "13",
                    "id": "1305",
                    "fullname": "河北省邢台市",
                    "items": [
                        {
                            "name": "桥东区",
                            "pId": "1305",
                            "id": "130502",
                            "fullname": "河北省邢台市桥东区"
                        },
                        {
                            "name": "桥西区",
                            "pId": "1305",
                            "id": "130503",
                            "fullname": "河北省邢台市桥西区"
                        },
                        {
                            "name": "邢台县",
                            "pId": "1305",
                            "id": "130521",
                            "fullname": "河北省邢台市邢台县"
                        },
                        {
                            "name": "临城县",
                            "pId": "1305",
                            "id": "130522",
                            "fullname": "河北省邢台市临城县"
                        },
                        {
                            "name": "内丘县",
                            "pId": "1305",
                            "id": "130523",
                            "fullname": "河北省邢台市内丘县"
                        },
                        {
                            "name": "柏乡县",
                            "pId": "1305",
                            "id": "130524",
                            "fullname": "河北省邢台市柏乡县"
                        },
                        {
                            "name": "隆尧县",
                            "pId": "1305",
                            "id": "130525",
                            "fullname": "河北省邢台市隆尧县"
                        },
                        {
                            "name": "任县",
                            "pId": "1305",
                            "id": "130526",
                            "fullname": "河北省邢台市任县"
                        },
                        {
                            "name": "南和县",
                            "pId": "1305",
                            "id": "130527",
                            "fullname": "河北省邢台市南和县"
                        },
                        {
                            "name": "宁晋县",
                            "pId": "1305",
                            "id": "130528",
                            "fullname": "河北省邢台市宁晋县"
                        },
                        {
                            "name": "巨鹿县",
                            "pId": "1305",
                            "id": "130529",
                            "fullname": "河北省邢台市巨鹿县"
                        },
                        {
                            "name": "新河县",
                            "pId": "1305",
                            "id": "130530",
                            "fullname": "河北省邢台市新河县"
                        },
                        {
                            "name": "广宗县",
                            "pId": "1305",
                            "id": "130531",
                            "fullname": "河北省邢台市广宗县"
                        },
                        {
                            "name": "平乡县",
                            "pId": "1305",
                            "id": "130532",
                            "fullname": "河北省邢台市平乡县"
                        },
                        {
                            "name": "威县",
                            "pId": "1305",
                            "id": "130533",
                            "fullname": "河北省邢台市威县"
                        },
                        {
                            "name": "清河县",
                            "pId": "1305",
                            "id": "130534",
                            "fullname": "河北省邢台市清河县"
                        },
                        {
                            "name": "临西县",
                            "pId": "1305",
                            "id": "130535",
                            "fullname": "河北省邢台市临西县"
                        },
                        {
                            "name": "南宫市",
                            "pId": "1305",
                            "id": "130581",
                            "fullname": "河北省邢台市南宫市"
                        },
                        {
                            "name": "沙河市",
                            "pId": "1305",
                            "id": "130582",
                            "fullname": "河北省邢台市沙河市"
                        }
                    ]
                },
                {
                    "name": "保定市",
                    "pId": "13",
                    "id": "1306",
                    "fullname": "河北省保定市",
                    "items": [
                        {
                            "name": "新市区",
                            "pId": "1306",
                            "id": "130602",
                            "fullname": "河北省保定市新市区"
                        },
                        {
                            "name": "北市区",
                            "pId": "1306",
                            "id": "130603",
                            "fullname": "河北省保定市北市区"
                        },
                        {
                            "name": "南市区",
                            "pId": "1306",
                            "id": "130604",
                            "fullname": "河北省保定市南市区"
                        },
                        {
                            "name": "满城县",
                            "pId": "1306",
                            "id": "130621",
                            "fullname": "河北省保定市满城县"
                        },
                        {
                            "name": "清苑县",
                            "pId": "1306",
                            "id": "130622",
                            "fullname": "河北省保定市清苑县"
                        },
                        {
                            "name": "涞水县",
                            "pId": "1306",
                            "id": "130623",
                            "fullname": "河北省保定市涞水县"
                        },
                        {
                            "name": "阜平县",
                            "pId": "1306",
                            "id": "130624",
                            "fullname": "河北省保定市阜平县"
                        },
                        {
                            "name": "徐水县",
                            "pId": "1306",
                            "id": "130625",
                            "fullname": "河北省保定市徐水县"
                        },
                        {
                            "name": "定兴县",
                            "pId": "1306",
                            "id": "130626",
                            "fullname": "河北省保定市定兴县"
                        },
                        {
                            "name": "唐县",
                            "pId": "1306",
                            "id": "130627",
                            "fullname": "河北省保定市唐县"
                        },
                        {
                            "name": "高阳县",
                            "pId": "1306",
                            "id": "130628",
                            "fullname": "河北省保定市高阳县"
                        },
                        {
                            "name": "容城县",
                            "pId": "1306",
                            "id": "130629",
                            "fullname": "河北省保定市容城县"
                        },
                        {
                            "name": "涞源县",
                            "pId": "1306",
                            "id": "130630",
                            "fullname": "河北省保定市涞源县"
                        },
                        {
                            "name": "望都县",
                            "pId": "1306",
                            "id": "130631",
                            "fullname": "河北省保定市望都县"
                        },
                        {
                            "name": "安新县",
                            "pId": "1306",
                            "id": "130632",
                            "fullname": "河北省保定市安新县"
                        },
                        {
                            "name": "易县",
                            "pId": "1306",
                            "id": "130633",
                            "fullname": "河北省保定市易县"
                        },
                        {
                            "name": "曲阳县",
                            "pId": "1306",
                            "id": "130634",
                            "fullname": "河北省保定市曲阳县"
                        },
                        {
                            "name": "蠡县",
                            "pId": "1306",
                            "id": "130635",
                            "fullname": "河北省保定市蠡县"
                        },
                        {
                            "name": "顺平县",
                            "pId": "1306",
                            "id": "130636",
                            "fullname": "河北省保定市顺平县"
                        },
                        {
                            "name": "博野县",
                            "pId": "1306",
                            "id": "130637",
                            "fullname": "河北省保定市博野县"
                        },
                        {
                            "name": "雄县",
                            "pId": "1306",
                            "id": "130638",
                            "fullname": "河北省保定市雄县"
                        },
                        {
                            "name": "涿州市",
                            "pId": "1306",
                            "id": "130681",
                            "fullname": "河北省保定市涿州市"
                        },
                        {
                            "name": "定州市",
                            "pId": "1306",
                            "id": "130682",
                            "fullname": "河北省保定市定州市"
                        },
                        {
                            "name": "安国市",
                            "pId": "1306",
                            "id": "130683",
                            "fullname": "河北省保定市安国市"
                        },
                        {
                            "name": "高碑店市",
                            "pId": "1306",
                            "id": "130684",
                            "fullname": "河北省保定市高碑店市"
                        }
                    ]
                },
                {
                    "name": "张家口市",
                    "pId": "13",
                    "id": "1307",
                    "fullname": "河北省张家口市",
                    "items": [
                        {
                            "name": "桥东区",
                            "pId": "1307",
                            "id": "130702",
                            "fullname": "河北省张家口市桥东区"
                        },
                        {
                            "name": "桥西区",
                            "pId": "1307",
                            "id": "130703",
                            "fullname": "河北省张家口市桥西区"
                        },
                        {
                            "name": "宣化区",
                            "pId": "1307",
                            "id": "130705",
                            "fullname": "河北省张家口市宣化区"
                        },
                        {
                            "name": "下花园区",
                            "pId": "1307",
                            "id": "130706",
                            "fullname": "河北省张家口市下花园区"
                        },
                        {
                            "name": "宣化县",
                            "pId": "1307",
                            "id": "130721",
                            "fullname": "河北省张家口市宣化县"
                        },
                        {
                            "name": "张北县",
                            "pId": "1307",
                            "id": "130722",
                            "fullname": "河北省张家口市张北县"
                        },
                        {
                            "name": "康保县",
                            "pId": "1307",
                            "id": "130723",
                            "fullname": "河北省张家口市康保县"
                        },
                        {
                            "name": "沽源县",
                            "pId": "1307",
                            "id": "130724",
                            "fullname": "河北省张家口市沽源县"
                        },
                        {
                            "name": "尚义县",
                            "pId": "1307",
                            "id": "130725",
                            "fullname": "河北省张家口市尚义县"
                        },
                        {
                            "name": "蔚县",
                            "pId": "1307",
                            "id": "130726",
                            "fullname": "河北省张家口市蔚县"
                        },
                        {
                            "name": "阳原县",
                            "pId": "1307",
                            "id": "130727",
                            "fullname": "河北省张家口市阳原县"
                        },
                        {
                            "name": "怀安县",
                            "pId": "1307",
                            "id": "130728",
                            "fullname": "河北省张家口市怀安县"
                        },
                        {
                            "name": "万全县",
                            "pId": "1307",
                            "id": "130729",
                            "fullname": "河北省张家口市万全县"
                        },
                        {
                            "name": "怀来县",
                            "pId": "1307",
                            "id": "130730",
                            "fullname": "河北省张家口市怀来县"
                        },
                        {
                            "name": "涿鹿县",
                            "pId": "1307",
                            "id": "130731",
                            "fullname": "河北省张家口市涿鹿县"
                        },
                        {
                            "name": "赤城县",
                            "pId": "1307",
                            "id": "130732",
                            "fullname": "河北省张家口市赤城县"
                        },
                        {
                            "name": "崇礼县",
                            "pId": "1307",
                            "id": "130733",
                            "fullname": "河北省张家口市崇礼县"
                        }
                    ]
                },
                {
                    "name": "承德市",
                    "pId": "13",
                    "id": "1308",
                    "fullname": "河北省承德市",
                    "items": [
                        {
                            "name": "双桥区",
                            "pId": "1308",
                            "id": "130802",
                            "fullname": "河北省承德市双桥区"
                        },
                        {
                            "name": "双滦区",
                            "pId": "1308",
                            "id": "130803",
                            "fullname": "河北省承德市双滦区"
                        },
                        {
                            "name": "鹰手营子矿区",
                            "pId": "1308",
                            "id": "130804",
                            "fullname": "河北省承德市鹰手营子矿区"
                        },
                        {
                            "name": "承德县",
                            "pId": "1308",
                            "id": "130821",
                            "fullname": "河北省承德市承德县"
                        },
                        {
                            "name": "兴隆县",
                            "pId": "1308",
                            "id": "130822",
                            "fullname": "河北省承德市兴隆县"
                        },
                        {
                            "name": "平泉县",
                            "pId": "1308",
                            "id": "130823",
                            "fullname": "河北省承德市平泉县"
                        },
                        {
                            "name": "滦平县",
                            "pId": "1308",
                            "id": "130824",
                            "fullname": "河北省承德市滦平县"
                        },
                        {
                            "name": "隆化县",
                            "pId": "1308",
                            "id": "130825",
                            "fullname": "河北省承德市隆化县"
                        },
                        {
                            "name": "丰宁满族自治县",
                            "pId": "1308",
                            "id": "130826",
                            "fullname": "河北省承德市丰宁满族自治县"
                        },
                        {
                            "name": "宽城满族自治县",
                            "pId": "1308",
                            "id": "130827",
                            "fullname": "河北省承德市宽城满族自治县"
                        },
                        {
                            "name": "围场满族蒙古族自治县",
                            "pId": "1308",
                            "id": "130828",
                            "fullname": "河北省承德市围场满族蒙古族自治县"
                        }
                    ]
                },
                {
                    "name": "沧州市",
                    "pId": "13",
                    "id": "1309",
                    "fullname": "河北省沧州市",
                    "items": [
                        {
                            "name": "新华区",
                            "pId": "1309",
                            "id": "130902",
                            "fullname": "河北省沧州市新华区"
                        },
                        {
                            "name": "运河区",
                            "pId": "1309",
                            "id": "130903",
                            "fullname": "河北省沧州市运河区"
                        },
                        {
                            "name": "沧县",
                            "pId": "1309",
                            "id": "130921",
                            "fullname": "河北省沧州市沧县"
                        },
                        {
                            "name": "青县",
                            "pId": "1309",
                            "id": "130922",
                            "fullname": "河北省沧州市青县"
                        },
                        {
                            "name": "东光县",
                            "pId": "1309",
                            "id": "130923",
                            "fullname": "河北省沧州市东光县"
                        },
                        {
                            "name": "海兴县",
                            "pId": "1309",
                            "id": "130924",
                            "fullname": "河北省沧州市海兴县"
                        },
                        {
                            "name": "盐山县",
                            "pId": "1309",
                            "id": "130925",
                            "fullname": "河北省沧州市盐山县"
                        },
                        {
                            "name": "肃宁县",
                            "pId": "1309",
                            "id": "130926",
                            "fullname": "河北省沧州市肃宁县"
                        },
                        {
                            "name": "南皮县",
                            "pId": "1309",
                            "id": "130927",
                            "fullname": "河北省沧州市南皮县"
                        },
                        {
                            "name": "吴桥县",
                            "pId": "1309",
                            "id": "130928",
                            "fullname": "河北省沧州市吴桥县"
                        },
                        {
                            "name": "献县",
                            "pId": "1309",
                            "id": "130929",
                            "fullname": "河北省沧州市献县"
                        },
                        {
                            "name": "孟村回族自治县",
                            "pId": "1309",
                            "id": "130930",
                            "fullname": "河北省沧州市孟村回族自治县"
                        },
                        {
                            "name": "泊头市",
                            "pId": "1309",
                            "id": "130981",
                            "fullname": "河北省沧州市泊头市"
                        },
                        {
                            "name": "任丘市",
                            "pId": "1309",
                            "id": "130982",
                            "fullname": "河北省沧州市任丘市"
                        },
                        {
                            "name": "黄骅市",
                            "pId": "1309",
                            "id": "130983",
                            "fullname": "河北省沧州市黄骅市"
                        },
                        {
                            "name": "河间市",
                            "pId": "1309",
                            "id": "130984",
                            "fullname": "河北省沧州市河间市"
                        }
                    ]
                },
                {
                    "name": "廊坊市",
                    "pId": "13",
                    "id": "1310",
                    "fullname": "河北省廊坊市",
                    "items": [
                        {
                            "name": "安次区",
                            "pId": "1310",
                            "id": "131002",
                            "fullname": "河北省廊坊市安次区"
                        },
                        {
                            "name": "广阳区",
                            "pId": "1310",
                            "id": "131003",
                            "fullname": "河北省廊坊市广阳区"
                        },
                        {
                            "name": "固安县",
                            "pId": "1310",
                            "id": "131022",
                            "fullname": "河北省廊坊市固安县"
                        },
                        {
                            "name": "永清县",
                            "pId": "1310",
                            "id": "131023",
                            "fullname": "河北省廊坊市永清县"
                        },
                        {
                            "name": "香河县",
                            "pId": "1310",
                            "id": "131024",
                            "fullname": "河北省廊坊市香河县"
                        },
                        {
                            "name": "大城县",
                            "pId": "1310",
                            "id": "131025",
                            "fullname": "河北省廊坊市大城县"
                        },
                        {
                            "name": "文安县",
                            "pId": "1310",
                            "id": "131026",
                            "fullname": "河北省廊坊市文安县"
                        },
                        {
                            "name": "大厂回族自治县",
                            "pId": "1310",
                            "id": "131028",
                            "fullname": "河北省廊坊市大厂回族自治县"
                        },
                        {
                            "name": "霸州市",
                            "pId": "1310",
                            "id": "131081",
                            "fullname": "河北省廊坊市霸州市"
                        },
                        {
                            "name": "三河市",
                            "pId": "1310",
                            "id": "131082",
                            "fullname": "河北省廊坊市三河市"
                        }
                    ]
                },
                {
                    "name": "衡水市",
                    "pId": "13",
                    "id": "1311",
                    "fullname": "河北省衡水市",
                    "items": [
                        {
                            "name": "桃城区",
                            "pId": "1311",
                            "id": "131102",
                            "fullname": "河北省衡水市桃城区"
                        },
                        {
                            "name": "枣强县",
                            "pId": "1311",
                            "id": "131121",
                            "fullname": "河北省衡水市枣强县"
                        },
                        {
                            "name": "武邑县",
                            "pId": "1311",
                            "id": "131122",
                            "fullname": "河北省衡水市武邑县"
                        },
                        {
                            "name": "武强县",
                            "pId": "1311",
                            "id": "131123",
                            "fullname": "河北省衡水市武强县"
                        },
                        {
                            "name": "饶阳县",
                            "pId": "1311",
                            "id": "131124",
                            "fullname": "河北省衡水市饶阳县"
                        },
                        {
                            "name": "安平县",
                            "pId": "1311",
                            "id": "131125",
                            "fullname": "河北省衡水市安平县"
                        },
                        {
                            "name": "故城县",
                            "pId": "1311",
                            "id": "131126",
                            "fullname": "河北省衡水市故城县"
                        },
                        {
                            "name": "景县",
                            "pId": "1311",
                            "id": "131127",
                            "fullname": "河北省衡水市景县"
                        },
                        {
                            "name": "阜城县",
                            "pId": "1311",
                            "id": "131128",
                            "fullname": "河北省衡水市阜城县"
                        },
                        {
                            "name": "冀州市",
                            "pId": "1311",
                            "id": "131181",
                            "fullname": "河北省衡水市冀州市"
                        },
                        {
                            "name": "深州市",
                            "pId": "1311",
                            "id": "131182",
                            "fullname": "河北省衡水市深州市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "山西省",
            "pId": "1",
            "id": "14",
            "fullname": "山西省",
            "items": [
                {
                    "name": "太原市",
                    "pId": "14",
                    "id": "1401",
                    "fullname": "山西省太原市",
                    "items": [
                        {
                            "name": "小店区",
                            "pId": "1401",
                            "id": "140105",
                            "fullname": "山西省太原市小店区"
                        },
                        {
                            "name": "迎泽区",
                            "pId": "1401",
                            "id": "140106",
                            "fullname": "山西省太原市迎泽区"
                        },
                        {
                            "name": "杏花岭区",
                            "pId": "1401",
                            "id": "140107",
                            "fullname": "山西省太原市杏花岭区"
                        },
                        {
                            "name": "尖草坪区",
                            "pId": "1401",
                            "id": "140108",
                            "fullname": "山西省太原市尖草坪区"
                        },
                        {
                            "name": "万柏林区",
                            "pId": "1401",
                            "id": "140109",
                            "fullname": "山西省太原市万柏林区"
                        },
                        {
                            "name": "晋源区",
                            "pId": "1401",
                            "id": "140110",
                            "fullname": "山西省太原市晋源区"
                        },
                        {
                            "name": "清徐县",
                            "pId": "1401",
                            "id": "140121",
                            "fullname": "山西省太原市清徐县"
                        },
                        {
                            "name": "阳曲县",
                            "pId": "1401",
                            "id": "140122",
                            "fullname": "山西省太原市阳曲县"
                        },
                        {
                            "name": "娄烦县",
                            "pId": "1401",
                            "id": "140123",
                            "fullname": "山西省太原市娄烦县"
                        },
                        {
                            "name": "古交市",
                            "pId": "1401",
                            "id": "140181",
                            "fullname": "山西省太原市古交市"
                        }
                    ]
                },
                {
                    "name": "大同市",
                    "pId": "14",
                    "id": "1402",
                    "fullname": "山西省大同市",
                    "items": [
                        {
                            "name": "城区",
                            "pId": "1402",
                            "id": "140202",
                            "fullname": "山西省大同市城区"
                        },
                        {
                            "name": "矿区",
                            "pId": "1402",
                            "id": "140203",
                            "fullname": "山西省大同市矿区"
                        },
                        {
                            "name": "南郊区",
                            "pId": "1402",
                            "id": "140211",
                            "fullname": "山西省大同市南郊区"
                        },
                        {
                            "name": "新荣区",
                            "pId": "1402",
                            "id": "140212",
                            "fullname": "山西省大同市新荣区"
                        },
                        {
                            "name": "阳高县",
                            "pId": "1402",
                            "id": "140221",
                            "fullname": "山西省大同市阳高县"
                        },
                        {
                            "name": "天镇县",
                            "pId": "1402",
                            "id": "140222",
                            "fullname": "山西省大同市天镇县"
                        },
                        {
                            "name": "广灵县",
                            "pId": "1402",
                            "id": "140223",
                            "fullname": "山西省大同市广灵县"
                        },
                        {
                            "name": "灵丘县",
                            "pId": "1402",
                            "id": "140224",
                            "fullname": "山西省大同市灵丘县"
                        },
                        {
                            "name": "浑源县",
                            "pId": "1402",
                            "id": "140225",
                            "fullname": "山西省大同市浑源县"
                        },
                        {
                            "name": "左云县",
                            "pId": "1402",
                            "id": "140226",
                            "fullname": "山西省大同市左云县"
                        },
                        {
                            "name": "大同县",
                            "pId": "1402",
                            "id": "140227",
                            "fullname": "山西省大同市大同县"
                        }
                    ]
                },
                {
                    "name": "阳泉市",
                    "pId": "14",
                    "id": "1403",
                    "fullname": "山西省阳泉市",
                    "items": [
                        {
                            "name": "城区",
                            "pId": "1403",
                            "id": "140302",
                            "fullname": "山西省阳泉市城区"
                        },
                        {
                            "name": "矿区",
                            "pId": "1403",
                            "id": "140303",
                            "fullname": "山西省阳泉市矿区"
                        },
                        {
                            "name": "郊区",
                            "pId": "1403",
                            "id": "140311",
                            "fullname": "山西省阳泉市郊区"
                        },
                        {
                            "name": "平定县",
                            "pId": "1403",
                            "id": "140321",
                            "fullname": "山西省阳泉市平定县"
                        },
                        {
                            "name": "盂县",
                            "pId": "1403",
                            "id": "140322",
                            "fullname": "山西省阳泉市盂县"
                        }
                    ]
                },
                {
                    "name": "长治市",
                    "pId": "14",
                    "id": "1404",
                    "fullname": "山西省长治市",
                    "items": [
                        {
                            "name": "城区",
                            "pId": "1404",
                            "id": "140402",
                            "fullname": "山西省长治市城区"
                        },
                        {
                            "name": "郊区",
                            "pId": "1404",
                            "id": "140411",
                            "fullname": "山西省长治市郊区"
                        },
                        {
                            "name": "长治县",
                            "pId": "1404",
                            "id": "140421",
                            "fullname": "山西省长治市长治县"
                        },
                        {
                            "name": "襄垣县",
                            "pId": "1404",
                            "id": "140423",
                            "fullname": "山西省长治市襄垣县"
                        },
                        {
                            "name": "屯留县",
                            "pId": "1404",
                            "id": "140424",
                            "fullname": "山西省长治市屯留县"
                        },
                        {
                            "name": "平顺县",
                            "pId": "1404",
                            "id": "140425",
                            "fullname": "山西省长治市平顺县"
                        },
                        {
                            "name": "黎城县",
                            "pId": "1404",
                            "id": "140426",
                            "fullname": "山西省长治市黎城县"
                        },
                        {
                            "name": "壶关县",
                            "pId": "1404",
                            "id": "140427",
                            "fullname": "山西省长治市壶关县"
                        },
                        {
                            "name": "长子县",
                            "pId": "1404",
                            "id": "140428",
                            "fullname": "山西省长治市长子县"
                        },
                        {
                            "name": "武乡县",
                            "pId": "1404",
                            "id": "140429",
                            "fullname": "山西省长治市武乡县"
                        },
                        {
                            "name": "沁县",
                            "pId": "1404",
                            "id": "140430",
                            "fullname": "山西省长治市沁县"
                        },
                        {
                            "name": "沁源县",
                            "pId": "1404",
                            "id": "140431",
                            "fullname": "山西省长治市沁源县"
                        },
                        {
                            "name": "潞城市",
                            "pId": "1404",
                            "id": "140481",
                            "fullname": "山西省长治市潞城市"
                        }
                    ]
                },
                {
                    "name": "晋城市",
                    "pId": "14",
                    "id": "1405",
                    "fullname": "山西省晋城市",
                    "items": [
                        {
                            "name": "城区",
                            "pId": "1405",
                            "id": "140502",
                            "fullname": "山西省晋城市城区"
                        },
                        {
                            "name": "沁水县",
                            "pId": "1405",
                            "id": "140521",
                            "fullname": "山西省晋城市沁水县"
                        },
                        {
                            "name": "阳城县",
                            "pId": "1405",
                            "id": "140522",
                            "fullname": "山西省晋城市阳城县"
                        },
                        {
                            "name": "陵川县",
                            "pId": "1405",
                            "id": "140524",
                            "fullname": "山西省晋城市陵川县"
                        },
                        {
                            "name": "泽州县",
                            "pId": "1405",
                            "id": "140525",
                            "fullname": "山西省晋城市泽州县"
                        },
                        {
                            "name": "高平市",
                            "pId": "1405",
                            "id": "140581",
                            "fullname": "山西省晋城市高平市"
                        }
                    ]
                },
                {
                    "name": "朔州市",
                    "pId": "14",
                    "id": "1406",
                    "fullname": "山西省朔州市",
                    "items": [
                        {
                            "name": "朔城区",
                            "pId": "1406",
                            "id": "140602",
                            "fullname": "山西省朔州市朔城区"
                        },
                        {
                            "name": "平鲁区",
                            "pId": "1406",
                            "id": "140603",
                            "fullname": "山西省朔州市平鲁区"
                        },
                        {
                            "name": "山阴县",
                            "pId": "1406",
                            "id": "140621",
                            "fullname": "山西省朔州市山阴县"
                        },
                        {
                            "name": "应县",
                            "pId": "1406",
                            "id": "140622",
                            "fullname": "山西省朔州市应县"
                        },
                        {
                            "name": "右玉县",
                            "pId": "1406",
                            "id": "140623",
                            "fullname": "山西省朔州市右玉县"
                        },
                        {
                            "name": "怀仁县",
                            "pId": "1406",
                            "id": "140624",
                            "fullname": "山西省朔州市怀仁县"
                        }
                    ]
                },
                {
                    "name": "晋中市",
                    "pId": "14",
                    "id": "1407",
                    "fullname": "山西省晋中市",
                    "items": [
                        {
                            "name": "榆次区",
                            "pId": "1407",
                            "id": "140702",
                            "fullname": "山西省晋中市榆次区"
                        },
                        {
                            "name": "榆社县",
                            "pId": "1407",
                            "id": "140721",
                            "fullname": "山西省晋中市榆社县"
                        },
                        {
                            "name": "左权县",
                            "pId": "1407",
                            "id": "140722",
                            "fullname": "山西省晋中市左权县"
                        },
                        {
                            "name": "和顺县",
                            "pId": "1407",
                            "id": "140723",
                            "fullname": "山西省晋中市和顺县"
                        },
                        {
                            "name": "昔阳县",
                            "pId": "1407",
                            "id": "140724",
                            "fullname": "山西省晋中市昔阳县"
                        },
                        {
                            "name": "寿阳县",
                            "pId": "1407",
                            "id": "140725",
                            "fullname": "山西省晋中市寿阳县"
                        },
                        {
                            "name": "太谷县",
                            "pId": "1407",
                            "id": "140726",
                            "fullname": "山西省晋中市太谷县"
                        },
                        {
                            "name": "祁县",
                            "pId": "1407",
                            "id": "140727",
                            "fullname": "山西省晋中市祁县"
                        },
                        {
                            "name": "平遥县",
                            "pId": "1407",
                            "id": "140728",
                            "fullname": "山西省晋中市平遥县"
                        },
                        {
                            "name": "灵石县",
                            "pId": "1407",
                            "id": "140729",
                            "fullname": "山西省晋中市灵石县"
                        },
                        {
                            "name": "介休市",
                            "pId": "1407",
                            "id": "140781",
                            "fullname": "山西省晋中市介休市"
                        }
                    ]
                },
                {
                    "name": "运城市",
                    "pId": "14",
                    "id": "1408",
                    "fullname": "山西省运城市",
                    "items": [
                        {
                            "name": "盐湖区",
                            "pId": "1408",
                            "id": "140802",
                            "fullname": "山西省运城市盐湖区"
                        },
                        {
                            "name": "临猗县",
                            "pId": "1408",
                            "id": "140821",
                            "fullname": "山西省运城市临猗县"
                        },
                        {
                            "name": "万荣县",
                            "pId": "1408",
                            "id": "140822",
                            "fullname": "山西省运城市万荣县"
                        },
                        {
                            "name": "闻喜县",
                            "pId": "1408",
                            "id": "140823",
                            "fullname": "山西省运城市闻喜县"
                        },
                        {
                            "name": "稷山县",
                            "pId": "1408",
                            "id": "140824",
                            "fullname": "山西省运城市稷山县"
                        },
                        {
                            "name": "新绛县",
                            "pId": "1408",
                            "id": "140825",
                            "fullname": "山西省运城市新绛县"
                        },
                        {
                            "name": "绛县",
                            "pId": "1408",
                            "id": "140826",
                            "fullname": "山西省运城市绛县"
                        },
                        {
                            "name": "垣曲县",
                            "pId": "1408",
                            "id": "140827",
                            "fullname": "山西省运城市垣曲县"
                        },
                        {
                            "name": "夏县",
                            "pId": "1408",
                            "id": "140828",
                            "fullname": "山西省运城市夏县"
                        },
                        {
                            "name": "平陆县",
                            "pId": "1408",
                            "id": "140829",
                            "fullname": "山西省运城市平陆县"
                        },
                        {
                            "name": "芮城县",
                            "pId": "1408",
                            "id": "140830",
                            "fullname": "山西省运城市芮城县"
                        },
                        {
                            "name": "永济市",
                            "pId": "1408",
                            "id": "140881",
                            "fullname": "山西省运城市永济市"
                        },
                        {
                            "name": "河津市",
                            "pId": "1408",
                            "id": "140882",
                            "fullname": "山西省运城市河津市"
                        }
                    ]
                },
                {
                    "name": "忻州市",
                    "pId": "14",
                    "id": "1409",
                    "fullname": "山西省忻州市",
                    "items": [
                        {
                            "name": "忻府区",
                            "pId": "1409",
                            "id": "140902",
                            "fullname": "山西省忻州市忻府区"
                        },
                        {
                            "name": "定襄县",
                            "pId": "1409",
                            "id": "140921",
                            "fullname": "山西省忻州市定襄县"
                        },
                        {
                            "name": "五台县",
                            "pId": "1409",
                            "id": "140922",
                            "fullname": "山西省忻州市五台县"
                        },
                        {
                            "name": "代县",
                            "pId": "1409",
                            "id": "140923",
                            "fullname": "山西省忻州市代县"
                        },
                        {
                            "name": "繁峙县",
                            "pId": "1409",
                            "id": "140924",
                            "fullname": "山西省忻州市繁峙县"
                        },
                        {
                            "name": "宁武县",
                            "pId": "1409",
                            "id": "140925",
                            "fullname": "山西省忻州市宁武县"
                        },
                        {
                            "name": "静乐县",
                            "pId": "1409",
                            "id": "140926",
                            "fullname": "山西省忻州市静乐县"
                        },
                        {
                            "name": "神池县",
                            "pId": "1409",
                            "id": "140927",
                            "fullname": "山西省忻州市神池县"
                        },
                        {
                            "name": "五寨县",
                            "pId": "1409",
                            "id": "140928",
                            "fullname": "山西省忻州市五寨县"
                        },
                        {
                            "name": "岢岚县",
                            "pId": "1409",
                            "id": "140929",
                            "fullname": "山西省忻州市岢岚县"
                        },
                        {
                            "name": "河曲县",
                            "pId": "1409",
                            "id": "140930",
                            "fullname": "山西省忻州市河曲县"
                        },
                        {
                            "name": "保德县",
                            "pId": "1409",
                            "id": "140931",
                            "fullname": "山西省忻州市保德县"
                        },
                        {
                            "name": "偏关县",
                            "pId": "1409",
                            "id": "140932",
                            "fullname": "山西省忻州市偏关县"
                        },
                        {
                            "name": "原平市",
                            "pId": "1409",
                            "id": "140981",
                            "fullname": "山西省忻州市原平市"
                        }
                    ]
                },
                {
                    "name": "临汾市",
                    "pId": "14",
                    "id": "1410",
                    "fullname": "山西省临汾市",
                    "items": [
                        {
                            "name": "尧都区",
                            "pId": "1410",
                            "id": "141002",
                            "fullname": "山西省临汾市尧都区"
                        },
                        {
                            "name": "曲沃县",
                            "pId": "1410",
                            "id": "141021",
                            "fullname": "山西省临汾市曲沃县"
                        },
                        {
                            "name": "翼城县",
                            "pId": "1410",
                            "id": "141022",
                            "fullname": "山西省临汾市翼城县"
                        },
                        {
                            "name": "襄汾县",
                            "pId": "1410",
                            "id": "141023",
                            "fullname": "山西省临汾市襄汾县"
                        },
                        {
                            "name": "洪洞县",
                            "pId": "1410",
                            "id": "141024",
                            "fullname": "山西省临汾市洪洞县"
                        },
                        {
                            "name": "古县",
                            "pId": "1410",
                            "id": "141025",
                            "fullname": "山西省临汾市古县"
                        },
                        {
                            "name": "安泽县",
                            "pId": "1410",
                            "id": "141026",
                            "fullname": "山西省临汾市安泽县"
                        },
                        {
                            "name": "浮山县",
                            "pId": "1410",
                            "id": "141027",
                            "fullname": "山西省临汾市浮山县"
                        },
                        {
                            "name": "吉县",
                            "pId": "1410",
                            "id": "141028",
                            "fullname": "山西省临汾市吉县"
                        },
                        {
                            "name": "乡宁县",
                            "pId": "1410",
                            "id": "141029",
                            "fullname": "山西省临汾市乡宁县"
                        },
                        {
                            "name": "大宁县",
                            "pId": "1410",
                            "id": "141030",
                            "fullname": "山西省临汾市大宁县"
                        },
                        {
                            "name": "隰县",
                            "pId": "1410",
                            "id": "141031",
                            "fullname": "山西省临汾市隰县"
                        },
                        {
                            "name": "永和县",
                            "pId": "1410",
                            "id": "141032",
                            "fullname": "山西省临汾市永和县"
                        },
                        {
                            "name": "蒲县",
                            "pId": "1410",
                            "id": "141033",
                            "fullname": "山西省临汾市蒲县"
                        },
                        {
                            "name": "汾西县",
                            "pId": "1410",
                            "id": "141034",
                            "fullname": "山西省临汾市汾西县"
                        },
                        {
                            "name": "侯马市",
                            "pId": "1410",
                            "id": "141081",
                            "fullname": "山西省临汾市侯马市"
                        },
                        {
                            "name": "霍州市",
                            "pId": "1410",
                            "id": "141082",
                            "fullname": "山西省临汾市霍州市"
                        }
                    ]
                },
                {
                    "name": "吕梁市",
                    "pId": "14",
                    "id": "1411",
                    "fullname": "山西省吕梁市",
                    "items": [
                        {
                            "name": "离石区",
                            "pId": "1411",
                            "id": "141102",
                            "fullname": "山西省吕梁市离石区"
                        },
                        {
                            "name": "文水县",
                            "pId": "1411",
                            "id": "141121",
                            "fullname": "山西省吕梁市文水县"
                        },
                        {
                            "name": "交城县",
                            "pId": "1411",
                            "id": "141122",
                            "fullname": "山西省吕梁市交城县"
                        },
                        {
                            "name": "兴县",
                            "pId": "1411",
                            "id": "141123",
                            "fullname": "山西省吕梁市兴县"
                        },
                        {
                            "name": "临县",
                            "pId": "1411",
                            "id": "141124",
                            "fullname": "山西省吕梁市临县"
                        },
                        {
                            "name": "柳林县",
                            "pId": "1411",
                            "id": "141125",
                            "fullname": "山西省吕梁市柳林县"
                        },
                        {
                            "name": "石楼县",
                            "pId": "1411",
                            "id": "141126",
                            "fullname": "山西省吕梁市石楼县"
                        },
                        {
                            "name": "岚县",
                            "pId": "1411",
                            "id": "141127",
                            "fullname": "山西省吕梁市岚县"
                        },
                        {
                            "name": "方山县",
                            "pId": "1411",
                            "id": "141128",
                            "fullname": "山西省吕梁市方山县"
                        },
                        {
                            "name": "中阳县",
                            "pId": "1411",
                            "id": "141129",
                            "fullname": "山西省吕梁市中阳县"
                        },
                        {
                            "name": "交口县",
                            "pId": "1411",
                            "id": "141130",
                            "fullname": "山西省吕梁市交口县"
                        },
                        {
                            "name": "孝义市",
                            "pId": "1411",
                            "id": "141181",
                            "fullname": "山西省吕梁市孝义市"
                        },
                        {
                            "name": "汾阳市",
                            "pId": "1411",
                            "id": "141182",
                            "fullname": "山西省吕梁市汾阳市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "内蒙古自治区",
            "pId": "1",
            "id": "15",
            "fullname": "内蒙古自治区",
            "items": [
                {
                    "name": "呼和浩特市",
                    "pId": "15",
                    "id": "1501",
                    "fullname": "内蒙古自治区呼和浩特市",
                    "items": [
                        {
                            "name": "新城区",
                            "pId": "1501",
                            "id": "150102",
                            "fullname": "内蒙古自治区呼和浩特市新城区"
                        },
                        {
                            "name": "回民区",
                            "pId": "1501",
                            "id": "150103",
                            "fullname": "内蒙古自治区呼和浩特市回民区"
                        },
                        {
                            "name": "玉泉区",
                            "pId": "1501",
                            "id": "150104",
                            "fullname": "内蒙古自治区呼和浩特市玉泉区"
                        },
                        {
                            "name": "赛罕区",
                            "pId": "1501",
                            "id": "150105",
                            "fullname": "内蒙古自治区呼和浩特市赛罕区"
                        },
                        {
                            "name": "土默特左旗",
                            "pId": "1501",
                            "id": "150121",
                            "fullname": "内蒙古自治区呼和浩特市土默特左旗"
                        },
                        {
                            "name": "托克托县",
                            "pId": "1501",
                            "id": "150122",
                            "fullname": "内蒙古自治区呼和浩特市托克托县"
                        },
                        {
                            "name": "和林格尔县",
                            "pId": "1501",
                            "id": "150123",
                            "fullname": "内蒙古自治区呼和浩特市和林格尔县"
                        },
                        {
                            "name": "清水河县",
                            "pId": "1501",
                            "id": "150124",
                            "fullname": "内蒙古自治区呼和浩特市清水河县"
                        },
                        {
                            "name": "武川县",
                            "pId": "1501",
                            "id": "150125",
                            "fullname": "内蒙古自治区呼和浩特市武川县"
                        }
                    ]
                },
                {
                    "name": "包头市",
                    "pId": "15",
                    "id": "1502",
                    "fullname": "内蒙古自治区包头市",
                    "items": [
                        {
                            "name": "东河区",
                            "pId": "1502",
                            "id": "150202",
                            "fullname": "内蒙古自治区包头市东河区"
                        },
                        {
                            "name": "昆都仑区",
                            "pId": "1502",
                            "id": "150203",
                            "fullname": "内蒙古自治区包头市昆都仑区"
                        },
                        {
                            "name": "青山区",
                            "pId": "1502",
                            "id": "150204",
                            "fullname": "内蒙古自治区包头市青山区"
                        },
                        {
                            "name": "石拐区",
                            "pId": "1502",
                            "id": "150205",
                            "fullname": "内蒙古自治区包头市石拐区"
                        },
                        {
                            "name": "白云鄂博矿区",
                            "pId": "1502",
                            "id": "150206",
                            "fullname": "内蒙古自治区包头市白云鄂博矿区"
                        },
                        {
                            "name": "九原区",
                            "pId": "1502",
                            "id": "150207",
                            "fullname": "内蒙古自治区包头市九原区"
                        },
                        {
                            "name": "土默特右旗",
                            "pId": "1502",
                            "id": "150221",
                            "fullname": "内蒙古自治区包头市土默特右旗"
                        },
                        {
                            "name": "固阳县",
                            "pId": "1502",
                            "id": "150222",
                            "fullname": "内蒙古自治区包头市固阳县"
                        },
                        {
                            "name": "达尔罕茂明安联合旗",
                            "pId": "1502",
                            "id": "150223",
                            "fullname": "内蒙古自治区包头市达尔罕茂明安联合旗"
                        }
                    ]
                },
                {
                    "name": "乌海市",
                    "pId": "15",
                    "id": "1503",
                    "fullname": "内蒙古自治区乌海市",
                    "items": [
                        {
                            "name": "海勃湾区",
                            "pId": "1503",
                            "id": "150302",
                            "fullname": "内蒙古自治区乌海市海勃湾区"
                        },
                        {
                            "name": "海南区",
                            "pId": "1503",
                            "id": "150303",
                            "fullname": "内蒙古自治区乌海市海南区"
                        },
                        {
                            "name": "乌达区",
                            "pId": "1503",
                            "id": "150304",
                            "fullname": "内蒙古自治区乌海市乌达区"
                        }
                    ]
                },
                {
                    "name": "赤峰市",
                    "pId": "15",
                    "id": "1504",
                    "fullname": "内蒙古自治区赤峰市",
                    "items": [
                        {
                            "name": "红山区",
                            "pId": "1504",
                            "id": "150402",
                            "fullname": "内蒙古自治区赤峰市红山区"
                        },
                        {
                            "name": "元宝山区",
                            "pId": "1504",
                            "id": "150403",
                            "fullname": "内蒙古自治区赤峰市元宝山区"
                        },
                        {
                            "name": "松山区",
                            "pId": "1504",
                            "id": "150404",
                            "fullname": "内蒙古自治区赤峰市松山区"
                        },
                        {
                            "name": "阿鲁科尔沁旗",
                            "pId": "1504",
                            "id": "150421",
                            "fullname": "内蒙古自治区赤峰市阿鲁科尔沁旗"
                        },
                        {
                            "name": "巴林左旗",
                            "pId": "1504",
                            "id": "150422",
                            "fullname": "内蒙古自治区赤峰市巴林左旗"
                        },
                        {
                            "name": "巴林右旗",
                            "pId": "1504",
                            "id": "150423",
                            "fullname": "内蒙古自治区赤峰市巴林右旗"
                        },
                        {
                            "name": "林西县",
                            "pId": "1504",
                            "id": "150424",
                            "fullname": "内蒙古自治区赤峰市林西县"
                        },
                        {
                            "name": "克什克腾旗",
                            "pId": "1504",
                            "id": "150425",
                            "fullname": "内蒙古自治区赤峰市克什克腾旗"
                        },
                        {
                            "name": "翁牛特旗",
                            "pId": "1504",
                            "id": "150426",
                            "fullname": "内蒙古自治区赤峰市翁牛特旗"
                        },
                        {
                            "name": "喀喇沁旗",
                            "pId": "1504",
                            "id": "150428",
                            "fullname": "内蒙古自治区赤峰市喀喇沁旗"
                        },
                        {
                            "name": "宁城县",
                            "pId": "1504",
                            "id": "150429",
                            "fullname": "内蒙古自治区赤峰市宁城县"
                        },
                        {
                            "name": "敖汉旗",
                            "pId": "1504",
                            "id": "150430",
                            "fullname": "内蒙古自治区赤峰市敖汉旗"
                        }
                    ]
                },
                {
                    "name": "通辽市",
                    "pId": "15",
                    "id": "1505",
                    "fullname": "内蒙古自治区通辽市",
                    "items": [
                        {
                            "name": "科尔沁区",
                            "pId": "1505",
                            "id": "150502",
                            "fullname": "内蒙古自治区通辽市科尔沁区"
                        },
                        {
                            "name": "科尔沁左翼中旗",
                            "pId": "1505",
                            "id": "150521",
                            "fullname": "内蒙古自治区通辽市科尔沁左翼中旗"
                        },
                        {
                            "name": "科尔沁左翼后旗",
                            "pId": "1505",
                            "id": "150522",
                            "fullname": "内蒙古自治区通辽市科尔沁左翼后旗"
                        },
                        {
                            "name": "开鲁县",
                            "pId": "1505",
                            "id": "150523",
                            "fullname": "内蒙古自治区通辽市开鲁县"
                        },
                        {
                            "name": "库伦旗",
                            "pId": "1505",
                            "id": "150524",
                            "fullname": "内蒙古自治区通辽市库伦旗"
                        },
                        {
                            "name": "奈曼旗",
                            "pId": "1505",
                            "id": "150525",
                            "fullname": "内蒙古自治区通辽市奈曼旗"
                        },
                        {
                            "name": "扎鲁特旗",
                            "pId": "1505",
                            "id": "150526",
                            "fullname": "内蒙古自治区通辽市扎鲁特旗"
                        },
                        {
                            "name": "霍林郭勒市",
                            "pId": "1505",
                            "id": "150581",
                            "fullname": "内蒙古自治区通辽市霍林郭勒市"
                        }
                    ]
                },
                {
                    "name": "鄂尔多斯市",
                    "pId": "15",
                    "id": "1506",
                    "fullname": "内蒙古自治区鄂尔多斯市",
                    "items": [
                        {
                            "name": "东胜区",
                            "pId": "1506",
                            "id": "150602",
                            "fullname": "内蒙古自治区鄂尔多斯市东胜区"
                        },
                        {
                            "name": "达拉特旗",
                            "pId": "1506",
                            "id": "150621",
                            "fullname": "内蒙古自治区鄂尔多斯市达拉特旗"
                        },
                        {
                            "name": "准格尔旗",
                            "pId": "1506",
                            "id": "150622",
                            "fullname": "内蒙古自治区鄂尔多斯市准格尔旗"
                        },
                        {
                            "name": "鄂托克前旗",
                            "pId": "1506",
                            "id": "150623",
                            "fullname": "内蒙古自治区鄂尔多斯市鄂托克前旗"
                        },
                        {
                            "name": "鄂托克旗",
                            "pId": "1506",
                            "id": "150624",
                            "fullname": "内蒙古自治区鄂尔多斯市鄂托克旗"
                        },
                        {
                            "name": "杭锦旗",
                            "pId": "1506",
                            "id": "150625",
                            "fullname": "内蒙古自治区鄂尔多斯市杭锦旗"
                        },
                        {
                            "name": "乌审旗",
                            "pId": "1506",
                            "id": "150626",
                            "fullname": "内蒙古自治区鄂尔多斯市乌审旗"
                        },
                        {
                            "name": "伊金霍洛旗",
                            "pId": "1506",
                            "id": "150627",
                            "fullname": "内蒙古自治区鄂尔多斯市伊金霍洛旗"
                        }
                    ]
                },
                {
                    "name": "呼伦贝尔市",
                    "pId": "15",
                    "id": "1507",
                    "fullname": "内蒙古自治区呼伦贝尔市",
                    "items": [
                        {
                            "name": "海拉尔区",
                            "pId": "1507",
                            "id": "150702",
                            "fullname": "内蒙古自治区呼伦贝尔市海拉尔区"
                        },
                        {
                            "name": "扎赉诺尔区",
                            "pId": "1507",
                            "id": "150703",
                            "fullname": "内蒙古自治区呼伦贝尔市扎赉诺尔区"
                        },
                        {
                            "name": "阿荣旗",
                            "pId": "1507",
                            "id": "150721",
                            "fullname": "内蒙古自治区呼伦贝尔市阿荣旗"
                        },
                        {
                            "name": "莫力达瓦达斡尔族自治旗",
                            "pId": "1507",
                            "id": "150722",
                            "fullname": "内蒙古自治区呼伦贝尔市莫力达瓦达斡尔族自治旗"
                        },
                        {
                            "name": "鄂伦春自治旗",
                            "pId": "1507",
                            "id": "150723",
                            "fullname": "内蒙古自治区呼伦贝尔市鄂伦春自治旗"
                        },
                        {
                            "name": "鄂温克族自治旗",
                            "pId": "1507",
                            "id": "150724",
                            "fullname": "内蒙古自治区呼伦贝尔市鄂温克族自治旗"
                        },
                        {
                            "name": "陈巴尔虎旗",
                            "pId": "1507",
                            "id": "150725",
                            "fullname": "内蒙古自治区呼伦贝尔市陈巴尔虎旗"
                        },
                        {
                            "name": "新巴尔虎左旗",
                            "pId": "1507",
                            "id": "150726",
                            "fullname": "内蒙古自治区呼伦贝尔市新巴尔虎左旗"
                        },
                        {
                            "name": "新巴尔虎右旗",
                            "pId": "1507",
                            "id": "150727",
                            "fullname": "内蒙古自治区呼伦贝尔市新巴尔虎右旗"
                        },
                        {
                            "name": "满洲里市",
                            "pId": "1507",
                            "id": "150781",
                            "fullname": "内蒙古自治区呼伦贝尔市满洲里市"
                        },
                        {
                            "name": "牙克石市",
                            "pId": "1507",
                            "id": "150782",
                            "fullname": "内蒙古自治区呼伦贝尔市牙克石市"
                        },
                        {
                            "name": "扎兰屯市",
                            "pId": "1507",
                            "id": "150783",
                            "fullname": "内蒙古自治区呼伦贝尔市扎兰屯市"
                        },
                        {
                            "name": "额尔古纳市",
                            "pId": "1507",
                            "id": "150784",
                            "fullname": "内蒙古自治区呼伦贝尔市额尔古纳市"
                        },
                        {
                            "name": "根河市",
                            "pId": "1507",
                            "id": "150785",
                            "fullname": "内蒙古自治区呼伦贝尔市根河市"
                        }
                    ]
                },
                {
                    "name": "巴彦淖尔市",
                    "pId": "15",
                    "id": "1508",
                    "fullname": "内蒙古自治区巴彦淖尔市",
                    "items": [
                        {
                            "name": "临河区",
                            "pId": "1508",
                            "id": "150802",
                            "fullname": "内蒙古自治区巴彦淖尔市临河区"
                        },
                        {
                            "name": "五原县",
                            "pId": "1508",
                            "id": "150821",
                            "fullname": "内蒙古自治区巴彦淖尔市五原县"
                        },
                        {
                            "name": "磴口县",
                            "pId": "1508",
                            "id": "150822",
                            "fullname": "内蒙古自治区巴彦淖尔市磴口县"
                        },
                        {
                            "name": "乌拉特前旗",
                            "pId": "1508",
                            "id": "150823",
                            "fullname": "内蒙古自治区巴彦淖尔市乌拉特前旗"
                        },
                        {
                            "name": "乌拉特中旗",
                            "pId": "1508",
                            "id": "150824",
                            "fullname": "内蒙古自治区巴彦淖尔市乌拉特中旗"
                        },
                        {
                            "name": "乌拉特后旗",
                            "pId": "1508",
                            "id": "150825",
                            "fullname": "内蒙古自治区巴彦淖尔市乌拉特后旗"
                        },
                        {
                            "name": "杭锦后旗",
                            "pId": "1508",
                            "id": "150826",
                            "fullname": "内蒙古自治区巴彦淖尔市杭锦后旗"
                        }
                    ]
                },
                {
                    "name": "乌兰察布市",
                    "pId": "15",
                    "id": "1509",
                    "fullname": "内蒙古自治区乌兰察布市",
                    "items": [
                        {
                            "name": "集宁区",
                            "pId": "1509",
                            "id": "150902",
                            "fullname": "内蒙古自治区乌兰察布市集宁区"
                        },
                        {
                            "name": "卓资县",
                            "pId": "1509",
                            "id": "150921",
                            "fullname": "内蒙古自治区乌兰察布市卓资县"
                        },
                        {
                            "name": "化德县",
                            "pId": "1509",
                            "id": "150922",
                            "fullname": "内蒙古自治区乌兰察布市化德县"
                        },
                        {
                            "name": "商都县",
                            "pId": "1509",
                            "id": "150923",
                            "fullname": "内蒙古自治区乌兰察布市商都县"
                        },
                        {
                            "name": "兴和县",
                            "pId": "1509",
                            "id": "150924",
                            "fullname": "内蒙古自治区乌兰察布市兴和县"
                        },
                        {
                            "name": "凉城县",
                            "pId": "1509",
                            "id": "150925",
                            "fullname": "内蒙古自治区乌兰察布市凉城县"
                        },
                        {
                            "name": "察哈尔右翼前旗",
                            "pId": "1509",
                            "id": "150926",
                            "fullname": "内蒙古自治区乌兰察布市察哈尔右翼前旗"
                        },
                        {
                            "name": "察哈尔右翼中旗",
                            "pId": "1509",
                            "id": "150927",
                            "fullname": "内蒙古自治区乌兰察布市察哈尔右翼中旗"
                        },
                        {
                            "name": "察哈尔右翼后旗",
                            "pId": "1509",
                            "id": "150928",
                            "fullname": "内蒙古自治区乌兰察布市察哈尔右翼后旗"
                        },
                        {
                            "name": "四子王旗",
                            "pId": "1509",
                            "id": "150929",
                            "fullname": "内蒙古自治区乌兰察布市四子王旗"
                        },
                        {
                            "name": "丰镇市",
                            "pId": "1509",
                            "id": "150981",
                            "fullname": "内蒙古自治区乌兰察布市丰镇市"
                        }
                    ]
                },
                {
                    "name": "兴安盟",
                    "pId": "15",
                    "id": "1522",
                    "fullname": "内蒙古自治区兴安盟",
                    "items": [
                        {
                            "name": "乌兰浩特市",
                            "pId": "1522",
                            "id": "152201",
                            "fullname": "内蒙古自治区兴安盟乌兰浩特市"
                        },
                        {
                            "name": "阿尔山市",
                            "pId": "1522",
                            "id": "152202",
                            "fullname": "内蒙古自治区兴安盟阿尔山市"
                        },
                        {
                            "name": "科尔沁右翼前旗",
                            "pId": "1522",
                            "id": "152221",
                            "fullname": "内蒙古自治区兴安盟科尔沁右翼前旗"
                        },
                        {
                            "name": "科尔沁右翼中旗",
                            "pId": "1522",
                            "id": "152222",
                            "fullname": "内蒙古自治区兴安盟科尔沁右翼中旗"
                        },
                        {
                            "name": "扎赉特旗",
                            "pId": "1522",
                            "id": "152223",
                            "fullname": "内蒙古自治区兴安盟扎赉特旗"
                        },
                        {
                            "name": "突泉县",
                            "pId": "1522",
                            "id": "152224",
                            "fullname": "内蒙古自治区兴安盟突泉县"
                        }
                    ]
                },
                {
                    "name": "锡林郭勒盟",
                    "pId": "15",
                    "id": "1525",
                    "fullname": "内蒙古自治区锡林郭勒盟",
                    "items": [
                        {
                            "name": "二连浩特市",
                            "pId": "1525",
                            "id": "152501",
                            "fullname": "内蒙古自治区锡林郭勒盟二连浩特市"
                        },
                        {
                            "name": "锡林浩特市",
                            "pId": "1525",
                            "id": "152502",
                            "fullname": "内蒙古自治区锡林郭勒盟锡林浩特市"
                        },
                        {
                            "name": "阿巴嘎旗",
                            "pId": "1525",
                            "id": "152522",
                            "fullname": "内蒙古自治区锡林郭勒盟阿巴嘎旗"
                        },
                        {
                            "name": "苏尼特左旗",
                            "pId": "1525",
                            "id": "152523",
                            "fullname": "内蒙古自治区锡林郭勒盟苏尼特左旗"
                        },
                        {
                            "name": "苏尼特右旗",
                            "pId": "1525",
                            "id": "152524",
                            "fullname": "内蒙古自治区锡林郭勒盟苏尼特右旗"
                        },
                        {
                            "name": "东乌珠穆沁旗",
                            "pId": "1525",
                            "id": "152525",
                            "fullname": "内蒙古自治区锡林郭勒盟东乌珠穆沁旗"
                        },
                        {
                            "name": "西乌珠穆沁旗",
                            "pId": "1525",
                            "id": "152526",
                            "fullname": "内蒙古自治区锡林郭勒盟西乌珠穆沁旗"
                        },
                        {
                            "name": "太仆寺旗",
                            "pId": "1525",
                            "id": "152527",
                            "fullname": "内蒙古自治区锡林郭勒盟太仆寺旗"
                        },
                        {
                            "name": "镶黄旗",
                            "pId": "1525",
                            "id": "152528",
                            "fullname": "内蒙古自治区锡林郭勒盟镶黄旗"
                        },
                        {
                            "name": "正镶白旗",
                            "pId": "1525",
                            "id": "152529",
                            "fullname": "内蒙古自治区锡林郭勒盟正镶白旗"
                        },
                        {
                            "name": "正蓝旗",
                            "pId": "1525",
                            "id": "152530",
                            "fullname": "内蒙古自治区锡林郭勒盟正蓝旗"
                        },
                        {
                            "name": "多伦县",
                            "pId": "1525",
                            "id": "152531",
                            "fullname": "内蒙古自治区锡林郭勒盟多伦县"
                        }
                    ]
                },
                {
                    "name": "阿拉善盟",
                    "pId": "15",
                    "id": "1529",
                    "fullname": "内蒙古自治区阿拉善盟",
                    "items": [
                        {
                            "name": "阿拉善左旗",
                            "pId": "1529",
                            "id": "152921",
                            "fullname": "内蒙古自治区阿拉善盟阿拉善左旗"
                        },
                        {
                            "name": "阿拉善右旗",
                            "pId": "1529",
                            "id": "152922",
                            "fullname": "内蒙古自治区阿拉善盟阿拉善右旗"
                        },
                        {
                            "name": "额济纳旗",
                            "pId": "1529",
                            "id": "152923",
                            "fullname": "内蒙古自治区阿拉善盟额济纳旗"
                        }
                    ]
                }
            ]
        },
        {
            "name": "辽宁省",
            "pId": "1",
            "id": "21",
            "fullname": "辽宁省",
            "items": [
                {
                    "name": "沈阳市",
                    "pId": "21",
                    "id": "2101",
                    "fullname": "辽宁省沈阳市",
                    "items": [
                        {
                            "name": "和平区",
                            "pId": "2101",
                            "id": "210102",
                            "fullname": "辽宁省沈阳市和平区"
                        },
                        {
                            "name": "沈河区",
                            "pId": "2101",
                            "id": "210103",
                            "fullname": "辽宁省沈阳市沈河区"
                        },
                        {
                            "name": "大东区",
                            "pId": "2101",
                            "id": "210104",
                            "fullname": "辽宁省沈阳市大东区"
                        },
                        {
                            "name": "皇姑区",
                            "pId": "2101",
                            "id": "210105",
                            "fullname": "辽宁省沈阳市皇姑区"
                        },
                        {
                            "name": "铁西区",
                            "pId": "2101",
                            "id": "210106",
                            "fullname": "辽宁省沈阳市铁西区"
                        },
                        {
                            "name": "苏家屯区",
                            "pId": "2101",
                            "id": "210111",
                            "fullname": "辽宁省沈阳市苏家屯区"
                        },
                        {
                            "name": "东陵区",
                            "pId": "2101",
                            "id": "210112",
                            "fullname": "辽宁省沈阳市东陵区"
                        },
                        {
                            "name": "沈北新区",
                            "pId": "2101",
                            "id": "210113",
                            "fullname": "辽宁省沈阳市沈北新区"
                        },
                        {
                            "name": "于洪区",
                            "pId": "2101",
                            "id": "210114",
                            "fullname": "辽宁省沈阳市于洪区"
                        },
                        {
                            "name": "辽中县",
                            "pId": "2101",
                            "id": "210122",
                            "fullname": "辽宁省沈阳市辽中县"
                        },
                        {
                            "name": "康平县",
                            "pId": "2101",
                            "id": "210123",
                            "fullname": "辽宁省沈阳市康平县"
                        },
                        {
                            "name": "法库县",
                            "pId": "2101",
                            "id": "210124",
                            "fullname": "辽宁省沈阳市法库县"
                        },
                        {
                            "name": "新民市",
                            "pId": "2101",
                            "id": "210181",
                            "fullname": "辽宁省沈阳市新民市"
                        }
                    ]
                },
                {
                    "name": "大连市",
                    "pId": "21",
                    "id": "2102",
                    "fullname": "辽宁省大连市",
                    "items": [
                        {
                            "name": "中山区",
                            "pId": "2102",
                            "id": "210202",
                            "fullname": "辽宁省大连市中山区"
                        },
                        {
                            "name": "西岗区",
                            "pId": "2102",
                            "id": "210203",
                            "fullname": "辽宁省大连市西岗区"
                        },
                        {
                            "name": "沙河口区",
                            "pId": "2102",
                            "id": "210204",
                            "fullname": "辽宁省大连市沙河口区"
                        },
                        {
                            "name": "甘井子区",
                            "pId": "2102",
                            "id": "210211",
                            "fullname": "辽宁省大连市甘井子区"
                        },
                        {
                            "name": "旅顺口区",
                            "pId": "2102",
                            "id": "210212",
                            "fullname": "辽宁省大连市旅顺口区"
                        },
                        {
                            "name": "金州区",
                            "pId": "2102",
                            "id": "210213",
                            "fullname": "辽宁省大连市金州区"
                        },
                        {
                            "name": "长海县",
                            "pId": "2102",
                            "id": "210224",
                            "fullname": "辽宁省大连市长海县"
                        },
                        {
                            "name": "瓦房店市",
                            "pId": "2102",
                            "id": "210281",
                            "fullname": "辽宁省大连市瓦房店市"
                        },
                        {
                            "name": "普兰店市",
                            "pId": "2102",
                            "id": "210282",
                            "fullname": "辽宁省大连市普兰店市"
                        },
                        {
                            "name": "庄河市",
                            "pId": "2102",
                            "id": "210283",
                            "fullname": "辽宁省大连市庄河市"
                        }
                    ]
                },
                {
                    "name": "鞍山市",
                    "pId": "21",
                    "id": "2103",
                    "fullname": "辽宁省鞍山市",
                    "items": [
                        {
                            "name": "铁东区",
                            "pId": "2103",
                            "id": "210302",
                            "fullname": "辽宁省鞍山市铁东区"
                        },
                        {
                            "name": "铁西区",
                            "pId": "2103",
                            "id": "210303",
                            "fullname": "辽宁省鞍山市铁西区"
                        },
                        {
                            "name": "立山区",
                            "pId": "2103",
                            "id": "210304",
                            "fullname": "辽宁省鞍山市立山区"
                        },
                        {
                            "name": "千山区",
                            "pId": "2103",
                            "id": "210311",
                            "fullname": "辽宁省鞍山市千山区"
                        },
                        {
                            "name": "台安县",
                            "pId": "2103",
                            "id": "210321",
                            "fullname": "辽宁省鞍山市台安县"
                        },
                        {
                            "name": "岫岩满族自治县",
                            "pId": "2103",
                            "id": "210323",
                            "fullname": "辽宁省鞍山市岫岩满族自治县"
                        },
                        {
                            "name": "海城市",
                            "pId": "2103",
                            "id": "210381",
                            "fullname": "辽宁省鞍山市海城市"
                        }
                    ]
                },
                {
                    "name": "抚顺市",
                    "pId": "21",
                    "id": "2104",
                    "fullname": "辽宁省抚顺市",
                    "items": [
                        {
                            "name": "新抚区",
                            "pId": "2104",
                            "id": "210402",
                            "fullname": "辽宁省抚顺市新抚区"
                        },
                        {
                            "name": "东洲区",
                            "pId": "2104",
                            "id": "210403",
                            "fullname": "辽宁省抚顺市东洲区"
                        },
                        {
                            "name": "望花区",
                            "pId": "2104",
                            "id": "210404",
                            "fullname": "辽宁省抚顺市望花区"
                        },
                        {
                            "name": "顺城区",
                            "pId": "2104",
                            "id": "210411",
                            "fullname": "辽宁省抚顺市顺城区"
                        },
                        {
                            "name": "抚顺县",
                            "pId": "2104",
                            "id": "210421",
                            "fullname": "辽宁省抚顺市抚顺县"
                        },
                        {
                            "name": "新宾满族自治县",
                            "pId": "2104",
                            "id": "210422",
                            "fullname": "辽宁省抚顺市新宾满族自治县"
                        },
                        {
                            "name": "清原满族自治县",
                            "pId": "2104",
                            "id": "210423",
                            "fullname": "辽宁省抚顺市清原满族自治县"
                        }
                    ]
                },
                {
                    "name": "本溪市",
                    "pId": "21",
                    "id": "2105",
                    "fullname": "辽宁省本溪市",
                    "items": [
                        {
                            "name": "平山区",
                            "pId": "2105",
                            "id": "210502",
                            "fullname": "辽宁省本溪市平山区"
                        },
                        {
                            "name": "溪湖区",
                            "pId": "2105",
                            "id": "210503",
                            "fullname": "辽宁省本溪市溪湖区"
                        },
                        {
                            "name": "明山区",
                            "pId": "2105",
                            "id": "210504",
                            "fullname": "辽宁省本溪市明山区"
                        },
                        {
                            "name": "南芬区",
                            "pId": "2105",
                            "id": "210505",
                            "fullname": "辽宁省本溪市南芬区"
                        },
                        {
                            "name": "本溪满族自治县",
                            "pId": "2105",
                            "id": "210521",
                            "fullname": "辽宁省本溪市本溪满族自治县"
                        },
                        {
                            "name": "桓仁满族自治县",
                            "pId": "2105",
                            "id": "210522",
                            "fullname": "辽宁省本溪市桓仁满族自治县"
                        }
                    ]
                },
                {
                    "name": "丹东市",
                    "pId": "21",
                    "id": "2106",
                    "fullname": "辽宁省丹东市",
                    "items": [
                        {
                            "name": "元宝区",
                            "pId": "2106",
                            "id": "210602",
                            "fullname": "辽宁省丹东市元宝区"
                        },
                        {
                            "name": "振兴区",
                            "pId": "2106",
                            "id": "210603",
                            "fullname": "辽宁省丹东市振兴区"
                        },
                        {
                            "name": "振安区",
                            "pId": "2106",
                            "id": "210604",
                            "fullname": "辽宁省丹东市振安区"
                        },
                        {
                            "name": "宽甸满族自治县",
                            "pId": "2106",
                            "id": "210624",
                            "fullname": "辽宁省丹东市宽甸满族自治县"
                        },
                        {
                            "name": "东港市",
                            "pId": "2106",
                            "id": "210681",
                            "fullname": "辽宁省丹东市东港市"
                        },
                        {
                            "name": "凤城市",
                            "pId": "2106",
                            "id": "210682",
                            "fullname": "辽宁省丹东市凤城市"
                        }
                    ]
                },
                {
                    "name": "锦州市",
                    "pId": "21",
                    "id": "2107",
                    "fullname": "辽宁省锦州市",
                    "items": [
                        {
                            "name": "古塔区",
                            "pId": "2107",
                            "id": "210702",
                            "fullname": "辽宁省锦州市古塔区"
                        },
                        {
                            "name": "凌河区",
                            "pId": "2107",
                            "id": "210703",
                            "fullname": "辽宁省锦州市凌河区"
                        },
                        {
                            "name": "太和区",
                            "pId": "2107",
                            "id": "210711",
                            "fullname": "辽宁省锦州市太和区"
                        },
                        {
                            "name": "黑山县",
                            "pId": "2107",
                            "id": "210726",
                            "fullname": "辽宁省锦州市黑山县"
                        },
                        {
                            "name": "义县",
                            "pId": "2107",
                            "id": "210727",
                            "fullname": "辽宁省锦州市义县"
                        },
                        {
                            "name": "凌海市",
                            "pId": "2107",
                            "id": "210781",
                            "fullname": "辽宁省锦州市凌海市"
                        },
                        {
                            "name": "北镇市",
                            "pId": "2107",
                            "id": "210782",
                            "fullname": "辽宁省锦州市北镇市"
                        }
                    ]
                },
                {
                    "name": "营口市",
                    "pId": "21",
                    "id": "2108",
                    "fullname": "辽宁省营口市",
                    "items": [
                        {
                            "name": "站前区",
                            "pId": "2108",
                            "id": "210802",
                            "fullname": "辽宁省营口市站前区"
                        },
                        {
                            "name": "西市区",
                            "pId": "2108",
                            "id": "210803",
                            "fullname": "辽宁省营口市西市区"
                        },
                        {
                            "name": "鲅鱼圈区",
                            "pId": "2108",
                            "id": "210804",
                            "fullname": "辽宁省营口市鲅鱼圈区"
                        },
                        {
                            "name": "老边区",
                            "pId": "2108",
                            "id": "210811",
                            "fullname": "辽宁省营口市老边区"
                        },
                        {
                            "name": "盖州市",
                            "pId": "2108",
                            "id": "210881",
                            "fullname": "辽宁省营口市盖州市"
                        },
                        {
                            "name": "大石桥市",
                            "pId": "2108",
                            "id": "210882",
                            "fullname": "辽宁省营口市大石桥市"
                        }
                    ]
                },
                {
                    "name": "阜新市",
                    "pId": "21",
                    "id": "2109",
                    "fullname": "辽宁省阜新市",
                    "items": [
                        {
                            "name": "海州区",
                            "pId": "2109",
                            "id": "210902",
                            "fullname": "辽宁省阜新市海州区"
                        },
                        {
                            "name": "新邱区",
                            "pId": "2109",
                            "id": "210903",
                            "fullname": "辽宁省阜新市新邱区"
                        },
                        {
                            "name": "太平区",
                            "pId": "2109",
                            "id": "210904",
                            "fullname": "辽宁省阜新市太平区"
                        },
                        {
                            "name": "清河门区",
                            "pId": "2109",
                            "id": "210905",
                            "fullname": "辽宁省阜新市清河门区"
                        },
                        {
                            "name": "细河区",
                            "pId": "2109",
                            "id": "210911",
                            "fullname": "辽宁省阜新市细河区"
                        },
                        {
                            "name": "阜新蒙古族自治县",
                            "pId": "2109",
                            "id": "210921",
                            "fullname": "辽宁省阜新市阜新蒙古族自治县"
                        },
                        {
                            "name": "彰武县",
                            "pId": "2109",
                            "id": "210922",
                            "fullname": "辽宁省阜新市彰武县"
                        }
                    ]
                },
                {
                    "name": "辽阳市",
                    "pId": "21",
                    "id": "2110",
                    "fullname": "辽宁省辽阳市",
                    "items": [
                        {
                            "name": "白塔区",
                            "pId": "2110",
                            "id": "211002",
                            "fullname": "辽宁省辽阳市白塔区"
                        },
                        {
                            "name": "文圣区",
                            "pId": "2110",
                            "id": "211003",
                            "fullname": "辽宁省辽阳市文圣区"
                        },
                        {
                            "name": "宏伟区",
                            "pId": "2110",
                            "id": "211004",
                            "fullname": "辽宁省辽阳市宏伟区"
                        },
                        {
                            "name": "弓长岭区",
                            "pId": "2110",
                            "id": "211005",
                            "fullname": "辽宁省辽阳市弓长岭区"
                        },
                        {
                            "name": "太子河区",
                            "pId": "2110",
                            "id": "211011",
                            "fullname": "辽宁省辽阳市太子河区"
                        },
                        {
                            "name": "辽阳县",
                            "pId": "2110",
                            "id": "211021",
                            "fullname": "辽宁省辽阳市辽阳县"
                        },
                        {
                            "name": "灯塔市",
                            "pId": "2110",
                            "id": "211081",
                            "fullname": "辽宁省辽阳市灯塔市"
                        }
                    ]
                },
                {
                    "name": "盘锦市",
                    "pId": "21",
                    "id": "2111",
                    "fullname": "辽宁省盘锦市",
                    "items": [
                        {
                            "name": "双台子区",
                            "pId": "2111",
                            "id": "211102",
                            "fullname": "辽宁省盘锦市双台子区"
                        },
                        {
                            "name": "兴隆台区",
                            "pId": "2111",
                            "id": "211103",
                            "fullname": "辽宁省盘锦市兴隆台区"
                        },
                        {
                            "name": "大洼县",
                            "pId": "2111",
                            "id": "211121",
                            "fullname": "辽宁省盘锦市大洼县"
                        },
                        {
                            "name": "盘山县",
                            "pId": "2111",
                            "id": "211122",
                            "fullname": "辽宁省盘锦市盘山县"
                        }
                    ]
                },
                {
                    "name": "铁岭市",
                    "pId": "21",
                    "id": "2112",
                    "fullname": "辽宁省铁岭市",
                    "items": [
                        {
                            "name": "银州区",
                            "pId": "2112",
                            "id": "211202",
                            "fullname": "辽宁省铁岭市银州区"
                        },
                        {
                            "name": "清河区",
                            "pId": "2112",
                            "id": "211204",
                            "fullname": "辽宁省铁岭市清河区"
                        },
                        {
                            "name": "铁岭县",
                            "pId": "2112",
                            "id": "211221",
                            "fullname": "辽宁省铁岭市铁岭县"
                        },
                        {
                            "name": "西丰县",
                            "pId": "2112",
                            "id": "211223",
                            "fullname": "辽宁省铁岭市西丰县"
                        },
                        {
                            "name": "昌图县",
                            "pId": "2112",
                            "id": "211224",
                            "fullname": "辽宁省铁岭市昌图县"
                        },
                        {
                            "name": "调兵山市",
                            "pId": "2112",
                            "id": "211281",
                            "fullname": "辽宁省铁岭市调兵山市"
                        },
                        {
                            "name": "开原市",
                            "pId": "2112",
                            "id": "211282",
                            "fullname": "辽宁省铁岭市开原市"
                        }
                    ]
                },
                {
                    "name": "朝阳市",
                    "pId": "21",
                    "id": "2113",
                    "fullname": "辽宁省朝阳市",
                    "items": [
                        {
                            "name": "双塔区",
                            "pId": "2113",
                            "id": "211302",
                            "fullname": "辽宁省朝阳市双塔区"
                        },
                        {
                            "name": "龙城区",
                            "pId": "2113",
                            "id": "211303",
                            "fullname": "辽宁省朝阳市龙城区"
                        },
                        {
                            "name": "朝阳县",
                            "pId": "2113",
                            "id": "211321",
                            "fullname": "辽宁省朝阳市朝阳县"
                        },
                        {
                            "name": "建平县",
                            "pId": "2113",
                            "id": "211322",
                            "fullname": "辽宁省朝阳市建平县"
                        },
                        {
                            "name": "喀喇沁左翼蒙古族自治县",
                            "pId": "2113",
                            "id": "211324",
                            "fullname": "辽宁省朝阳市喀喇沁左翼蒙古族自治县"
                        },
                        {
                            "name": "北票市",
                            "pId": "2113",
                            "id": "211381",
                            "fullname": "辽宁省朝阳市北票市"
                        },
                        {
                            "name": "凌源市",
                            "pId": "2113",
                            "id": "211382",
                            "fullname": "辽宁省朝阳市凌源市"
                        }
                    ]
                },
                {
                    "name": "葫芦岛市",
                    "pId": "21",
                    "id": "2114",
                    "fullname": "辽宁省葫芦岛市",
                    "items": [
                        {
                            "name": "连山区",
                            "pId": "2114",
                            "id": "211402",
                            "fullname": "辽宁省葫芦岛市连山区"
                        },
                        {
                            "name": "龙港区",
                            "pId": "2114",
                            "id": "211403",
                            "fullname": "辽宁省葫芦岛市龙港区"
                        },
                        {
                            "name": "南票区",
                            "pId": "2114",
                            "id": "211404",
                            "fullname": "辽宁省葫芦岛市南票区"
                        },
                        {
                            "name": "绥中县",
                            "pId": "2114",
                            "id": "211421",
                            "fullname": "辽宁省葫芦岛市绥中县"
                        },
                        {
                            "name": "建昌县",
                            "pId": "2114",
                            "id": "211422",
                            "fullname": "辽宁省葫芦岛市建昌县"
                        },
                        {
                            "name": "兴城市",
                            "pId": "2114",
                            "id": "211481",
                            "fullname": "辽宁省葫芦岛市兴城市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "吉林省",
            "pId": "1",
            "id": "22",
            "fullname": "吉林省",
            "items": [
                {
                    "name": "长春市",
                    "pId": "22",
                    "id": "2201",
                    "fullname": "吉林省长春市",
                    "items": [
                        {
                            "name": "南关区",
                            "pId": "2201",
                            "id": "220102",
                            "fullname": "吉林省长春市南关区"
                        },
                        {
                            "name": "宽城区",
                            "pId": "2201",
                            "id": "220103",
                            "fullname": "吉林省长春市宽城区"
                        },
                        {
                            "name": "朝阳区",
                            "pId": "2201",
                            "id": "220104",
                            "fullname": "吉林省长春市朝阳区"
                        },
                        {
                            "name": "二道区",
                            "pId": "2201",
                            "id": "220105",
                            "fullname": "吉林省长春市二道区"
                        },
                        {
                            "name": "绿园区",
                            "pId": "2201",
                            "id": "220106",
                            "fullname": "吉林省长春市绿园区"
                        },
                        {
                            "name": "双阳区",
                            "pId": "2201",
                            "id": "220112",
                            "fullname": "吉林省长春市双阳区"
                        },
                        {
                            "name": "农安县",
                            "pId": "2201",
                            "id": "220122",
                            "fullname": "吉林省长春市农安县"
                        },
                        {
                            "name": "九台市",
                            "pId": "2201",
                            "id": "220181",
                            "fullname": "吉林省长春市九台市"
                        },
                        {
                            "name": "榆树市",
                            "pId": "2201",
                            "id": "220182",
                            "fullname": "吉林省长春市榆树市"
                        },
                        {
                            "name": "德惠市",
                            "pId": "2201",
                            "id": "220183",
                            "fullname": "吉林省长春市德惠市"
                        }
                    ]
                },
                {
                    "name": "吉林市",
                    "pId": "22",
                    "id": "2202",
                    "fullname": "吉林省吉林市",
                    "items": [
                        {
                            "name": "昌邑区",
                            "pId": "2202",
                            "id": "220202",
                            "fullname": "吉林省吉林市昌邑区"
                        },
                        {
                            "name": "龙潭区",
                            "pId": "2202",
                            "id": "220203",
                            "fullname": "吉林省吉林市龙潭区"
                        },
                        {
                            "name": "船营区",
                            "pId": "2202",
                            "id": "220204",
                            "fullname": "吉林省吉林市船营区"
                        },
                        {
                            "name": "丰满区",
                            "pId": "2202",
                            "id": "220211",
                            "fullname": "吉林省吉林市丰满区"
                        },
                        {
                            "name": "永吉县",
                            "pId": "2202",
                            "id": "220221",
                            "fullname": "吉林省吉林市永吉县"
                        },
                        {
                            "name": "蛟河市",
                            "pId": "2202",
                            "id": "220281",
                            "fullname": "吉林省吉林市蛟河市"
                        },
                        {
                            "name": "桦甸市",
                            "pId": "2202",
                            "id": "220282",
                            "fullname": "吉林省吉林市桦甸市"
                        },
                        {
                            "name": "舒兰市",
                            "pId": "2202",
                            "id": "220283",
                            "fullname": "吉林省吉林市舒兰市"
                        },
                        {
                            "name": "磐石市",
                            "pId": "2202",
                            "id": "220284",
                            "fullname": "吉林省吉林市磐石市"
                        }
                    ]
                },
                {
                    "name": "四平市",
                    "pId": "22",
                    "id": "2203",
                    "fullname": "吉林省四平市",
                    "items": [
                        {
                            "name": "铁西区",
                            "pId": "2203",
                            "id": "220302",
                            "fullname": "吉林省四平市铁西区"
                        },
                        {
                            "name": "铁东区",
                            "pId": "2203",
                            "id": "220303",
                            "fullname": "吉林省四平市铁东区"
                        },
                        {
                            "name": "梨树县",
                            "pId": "2203",
                            "id": "220322",
                            "fullname": "吉林省四平市梨树县"
                        },
                        {
                            "name": "伊通满族自治县",
                            "pId": "2203",
                            "id": "220323",
                            "fullname": "吉林省四平市伊通满族自治县"
                        },
                        {
                            "name": "公主岭市",
                            "pId": "2203",
                            "id": "220381",
                            "fullname": "吉林省四平市公主岭市"
                        },
                        {
                            "name": "双辽市",
                            "pId": "2203",
                            "id": "220382",
                            "fullname": "吉林省四平市双辽市"
                        }
                    ]
                },
                {
                    "name": "辽源市",
                    "pId": "22",
                    "id": "2204",
                    "fullname": "吉林省辽源市",
                    "items": [
                        {
                            "name": "龙山区",
                            "pId": "2204",
                            "id": "220402",
                            "fullname": "吉林省辽源市龙山区"
                        },
                        {
                            "name": "西安区",
                            "pId": "2204",
                            "id": "220403",
                            "fullname": "吉林省辽源市西安区"
                        },
                        {
                            "name": "东丰县",
                            "pId": "2204",
                            "id": "220421",
                            "fullname": "吉林省辽源市东丰县"
                        },
                        {
                            "name": "东辽县",
                            "pId": "2204",
                            "id": "220422",
                            "fullname": "吉林省辽源市东辽县"
                        }
                    ]
                },
                {
                    "name": "通化市",
                    "pId": "22",
                    "id": "2205",
                    "fullname": "吉林省通化市",
                    "items": [
                        {
                            "name": "东昌区",
                            "pId": "2205",
                            "id": "220502",
                            "fullname": "吉林省通化市东昌区"
                        },
                        {
                            "name": "二道江区",
                            "pId": "2205",
                            "id": "220503",
                            "fullname": "吉林省通化市二道江区"
                        },
                        {
                            "name": "通化县",
                            "pId": "2205",
                            "id": "220521",
                            "fullname": "吉林省通化市通化县"
                        },
                        {
                            "name": "辉南县",
                            "pId": "2205",
                            "id": "220523",
                            "fullname": "吉林省通化市辉南县"
                        },
                        {
                            "name": "柳河县",
                            "pId": "2205",
                            "id": "220524",
                            "fullname": "吉林省通化市柳河县"
                        },
                        {
                            "name": "梅河口市",
                            "pId": "2205",
                            "id": "220581",
                            "fullname": "吉林省通化市梅河口市"
                        },
                        {
                            "name": "集安市",
                            "pId": "2205",
                            "id": "220582",
                            "fullname": "吉林省通化市集安市"
                        }
                    ]
                },
                {
                    "name": "白山市",
                    "pId": "22",
                    "id": "2206",
                    "fullname": "吉林省白山市",
                    "items": [
                        {
                            "name": "浑江区",
                            "pId": "2206",
                            "id": "220602",
                            "fullname": "吉林省白山市浑江区"
                        },
                        {
                            "name": "江源区",
                            "pId": "2206",
                            "id": "220605",
                            "fullname": "吉林省白山市江源区"
                        },
                        {
                            "name": "抚松县",
                            "pId": "2206",
                            "id": "220621",
                            "fullname": "吉林省白山市抚松县"
                        },
                        {
                            "name": "靖宇县",
                            "pId": "2206",
                            "id": "220622",
                            "fullname": "吉林省白山市靖宇县"
                        },
                        {
                            "name": "长白朝鲜族自治县",
                            "pId": "2206",
                            "id": "220623",
                            "fullname": "吉林省白山市长白朝鲜族自治县"
                        },
                        {
                            "name": "临江市",
                            "pId": "2206",
                            "id": "220681",
                            "fullname": "吉林省白山市临江市"
                        }
                    ]
                },
                {
                    "name": "松原市",
                    "pId": "22",
                    "id": "2207",
                    "fullname": "吉林省松原市",
                    "items": [
                        {
                            "name": "宁江区",
                            "pId": "2207",
                            "id": "220702",
                            "fullname": "吉林省松原市宁江区"
                        },
                        {
                            "name": "前郭尔罗斯蒙古族自治县",
                            "pId": "2207",
                            "id": "220721",
                            "fullname": "吉林省松原市前郭尔罗斯蒙古族自治县"
                        },
                        {
                            "name": "长岭县",
                            "pId": "2207",
                            "id": "220722",
                            "fullname": "吉林省松原市长岭县"
                        },
                        {
                            "name": "乾安县",
                            "pId": "2207",
                            "id": "220723",
                            "fullname": "吉林省松原市乾安县"
                        },
                        {
                            "name": "扶余市",
                            "pId": "2207",
                            "id": "220781",
                            "fullname": "吉林省松原市扶余市"
                        }
                    ]
                },
                {
                    "name": "白城市",
                    "pId": "22",
                    "id": "2208",
                    "fullname": "吉林省白城市",
                    "items": [
                        {
                            "name": "洮北区",
                            "pId": "2208",
                            "id": "220802",
                            "fullname": "吉林省白城市洮北区"
                        },
                        {
                            "name": "镇赉县",
                            "pId": "2208",
                            "id": "220821",
                            "fullname": "吉林省白城市镇赉县"
                        },
                        {
                            "name": "通榆县",
                            "pId": "2208",
                            "id": "220822",
                            "fullname": "吉林省白城市通榆县"
                        },
                        {
                            "name": "洮南市",
                            "pId": "2208",
                            "id": "220881",
                            "fullname": "吉林省白城市洮南市"
                        },
                        {
                            "name": "大安市",
                            "pId": "2208",
                            "id": "220882",
                            "fullname": "吉林省白城市大安市"
                        }
                    ]
                },
                {
                    "name": "延边朝鲜族自治州",
                    "pId": "22",
                    "id": "2224",
                    "fullname": "吉林省延边朝鲜族自治州",
                    "items": [
                        {
                            "name": "延吉市",
                            "pId": "2224",
                            "id": "222401",
                            "fullname": "吉林省延边朝鲜族自治州延吉市"
                        },
                        {
                            "name": "图们市",
                            "pId": "2224",
                            "id": "222402",
                            "fullname": "吉林省延边朝鲜族自治州图们市"
                        },
                        {
                            "name": "敦化市",
                            "pId": "2224",
                            "id": "222403",
                            "fullname": "吉林省延边朝鲜族自治州敦化市"
                        },
                        {
                            "name": "珲春市",
                            "pId": "2224",
                            "id": "222404",
                            "fullname": "吉林省延边朝鲜族自治州珲春市"
                        },
                        {
                            "name": "龙井市",
                            "pId": "2224",
                            "id": "222405",
                            "fullname": "吉林省延边朝鲜族自治州龙井市"
                        },
                        {
                            "name": "和龙市",
                            "pId": "2224",
                            "id": "222406",
                            "fullname": "吉林省延边朝鲜族自治州和龙市"
                        },
                        {
                            "name": "汪清县",
                            "pId": "2224",
                            "id": "222424",
                            "fullname": "吉林省延边朝鲜族自治州汪清县"
                        },
                        {
                            "name": "安图县",
                            "pId": "2224",
                            "id": "222426",
                            "fullname": "吉林省延边朝鲜族自治州安图县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "黑龙江省",
            "pId": "1",
            "id": "23",
            "fullname": "黑龙江省",
            "items": [
                {
                    "name": "哈尔滨市",
                    "pId": "23",
                    "id": "2301",
                    "fullname": "黑龙江省哈尔滨市",
                    "items": [
                        {
                            "name": "道里区",
                            "pId": "2301",
                            "id": "230102",
                            "fullname": "黑龙江省哈尔滨市道里区"
                        },
                        {
                            "name": "南岗区",
                            "pId": "2301",
                            "id": "230103",
                            "fullname": "黑龙江省哈尔滨市南岗区"
                        },
                        {
                            "name": "道外区",
                            "pId": "2301",
                            "id": "230104",
                            "fullname": "黑龙江省哈尔滨市道外区"
                        },
                        {
                            "name": "平房区",
                            "pId": "2301",
                            "id": "230108",
                            "fullname": "黑龙江省哈尔滨市平房区"
                        },
                        {
                            "name": "松北区",
                            "pId": "2301",
                            "id": "230109",
                            "fullname": "黑龙江省哈尔滨市松北区"
                        },
                        {
                            "name": "香坊区",
                            "pId": "2301",
                            "id": "230110",
                            "fullname": "黑龙江省哈尔滨市香坊区"
                        },
                        {
                            "name": "呼兰区",
                            "pId": "2301",
                            "id": "230111",
                            "fullname": "黑龙江省哈尔滨市呼兰区"
                        },
                        {
                            "name": "阿城区",
                            "pId": "2301",
                            "id": "230112",
                            "fullname": "黑龙江省哈尔滨市阿城区"
                        },
                        {
                            "name": "依兰县",
                            "pId": "2301",
                            "id": "230123",
                            "fullname": "黑龙江省哈尔滨市依兰县"
                        },
                        {
                            "name": "方正县",
                            "pId": "2301",
                            "id": "230124",
                            "fullname": "黑龙江省哈尔滨市方正县"
                        },
                        {
                            "name": "宾县",
                            "pId": "2301",
                            "id": "230125",
                            "fullname": "黑龙江省哈尔滨市宾县"
                        },
                        {
                            "name": "巴彦县",
                            "pId": "2301",
                            "id": "230126",
                            "fullname": "黑龙江省哈尔滨市巴彦县"
                        },
                        {
                            "name": "木兰县",
                            "pId": "2301",
                            "id": "230127",
                            "fullname": "黑龙江省哈尔滨市木兰县"
                        },
                        {
                            "name": "通河县",
                            "pId": "2301",
                            "id": "230128",
                            "fullname": "黑龙江省哈尔滨市通河县"
                        },
                        {
                            "name": "延寿县",
                            "pId": "2301",
                            "id": "230129",
                            "fullname": "黑龙江省哈尔滨市延寿县"
                        },
                        {
                            "name": "双城市",
                            "pId": "2301",
                            "id": "230182",
                            "fullname": "黑龙江省哈尔滨市双城市"
                        },
                        {
                            "name": "尚志市",
                            "pId": "2301",
                            "id": "230183",
                            "fullname": "黑龙江省哈尔滨市尚志市"
                        },
                        {
                            "name": "五常市",
                            "pId": "2301",
                            "id": "230184",
                            "fullname": "黑龙江省哈尔滨市五常市"
                        }
                    ]
                },
                {
                    "name": "齐齐哈尔市",
                    "pId": "23",
                    "id": "2302",
                    "fullname": "黑龙江省齐齐哈尔市",
                    "items": [
                        {
                            "name": "龙沙区",
                            "pId": "2302",
                            "id": "230202",
                            "fullname": "黑龙江省齐齐哈尔市龙沙区"
                        },
                        {
                            "name": "建华区",
                            "pId": "2302",
                            "id": "230203",
                            "fullname": "黑龙江省齐齐哈尔市建华区"
                        },
                        {
                            "name": "铁锋区",
                            "pId": "2302",
                            "id": "230204",
                            "fullname": "黑龙江省齐齐哈尔市铁锋区"
                        },
                        {
                            "name": "昂昂溪区",
                            "pId": "2302",
                            "id": "230205",
                            "fullname": "黑龙江省齐齐哈尔市昂昂溪区"
                        },
                        {
                            "name": "富拉尔基区",
                            "pId": "2302",
                            "id": "230206",
                            "fullname": "黑龙江省齐齐哈尔市富拉尔基区"
                        },
                        {
                            "name": "碾子山区",
                            "pId": "2302",
                            "id": "230207",
                            "fullname": "黑龙江省齐齐哈尔市碾子山区"
                        },
                        {
                            "name": "梅里斯达斡尔族区",
                            "pId": "2302",
                            "id": "230208",
                            "fullname": "黑龙江省齐齐哈尔市梅里斯达斡尔族区"
                        },
                        {
                            "name": "龙江县",
                            "pId": "2302",
                            "id": "230221",
                            "fullname": "黑龙江省齐齐哈尔市龙江县"
                        },
                        {
                            "name": "依安县",
                            "pId": "2302",
                            "id": "230223",
                            "fullname": "黑龙江省齐齐哈尔市依安县"
                        },
                        {
                            "name": "泰来县",
                            "pId": "2302",
                            "id": "230224",
                            "fullname": "黑龙江省齐齐哈尔市泰来县"
                        },
                        {
                            "name": "甘南县",
                            "pId": "2302",
                            "id": "230225",
                            "fullname": "黑龙江省齐齐哈尔市甘南县"
                        },
                        {
                            "name": "富裕县",
                            "pId": "2302",
                            "id": "230227",
                            "fullname": "黑龙江省齐齐哈尔市富裕县"
                        },
                        {
                            "name": "克山县",
                            "pId": "2302",
                            "id": "230229",
                            "fullname": "黑龙江省齐齐哈尔市克山县"
                        },
                        {
                            "name": "克东县",
                            "pId": "2302",
                            "id": "230230",
                            "fullname": "黑龙江省齐齐哈尔市克东县"
                        },
                        {
                            "name": "拜泉县",
                            "pId": "2302",
                            "id": "230231",
                            "fullname": "黑龙江省齐齐哈尔市拜泉县"
                        },
                        {
                            "name": "讷河市",
                            "pId": "2302",
                            "id": "230281",
                            "fullname": "黑龙江省齐齐哈尔市讷河市"
                        }
                    ]
                },
                {
                    "name": "鸡西市",
                    "pId": "23",
                    "id": "2303",
                    "fullname": "黑龙江省鸡西市",
                    "items": [
                        {
                            "name": "鸡冠区",
                            "pId": "2303",
                            "id": "230302",
                            "fullname": "黑龙江省鸡西市鸡冠区"
                        },
                        {
                            "name": "恒山区",
                            "pId": "2303",
                            "id": "230303",
                            "fullname": "黑龙江省鸡西市恒山区"
                        },
                        {
                            "name": "滴道区",
                            "pId": "2303",
                            "id": "230304",
                            "fullname": "黑龙江省鸡西市滴道区"
                        },
                        {
                            "name": "梨树区",
                            "pId": "2303",
                            "id": "230305",
                            "fullname": "黑龙江省鸡西市梨树区"
                        },
                        {
                            "name": "城子河区",
                            "pId": "2303",
                            "id": "230306",
                            "fullname": "黑龙江省鸡西市城子河区"
                        },
                        {
                            "name": "麻山区",
                            "pId": "2303",
                            "id": "230307",
                            "fullname": "黑龙江省鸡西市麻山区"
                        },
                        {
                            "name": "鸡东县",
                            "pId": "2303",
                            "id": "230321",
                            "fullname": "黑龙江省鸡西市鸡东县"
                        },
                        {
                            "name": "虎林市",
                            "pId": "2303",
                            "id": "230381",
                            "fullname": "黑龙江省鸡西市虎林市"
                        },
                        {
                            "name": "密山市",
                            "pId": "2303",
                            "id": "230382",
                            "fullname": "黑龙江省鸡西市密山市"
                        }
                    ]
                },
                {
                    "name": "鹤岗市",
                    "pId": "23",
                    "id": "2304",
                    "fullname": "黑龙江省鹤岗市",
                    "items": [
                        {
                            "name": "向阳区",
                            "pId": "2304",
                            "id": "230402",
                            "fullname": "黑龙江省鹤岗市向阳区"
                        },
                        {
                            "name": "工农区",
                            "pId": "2304",
                            "id": "230403",
                            "fullname": "黑龙江省鹤岗市工农区"
                        },
                        {
                            "name": "南山区",
                            "pId": "2304",
                            "id": "230404",
                            "fullname": "黑龙江省鹤岗市南山区"
                        },
                        {
                            "name": "兴安区",
                            "pId": "2304",
                            "id": "230405",
                            "fullname": "黑龙江省鹤岗市兴安区"
                        },
                        {
                            "name": "东山区",
                            "pId": "2304",
                            "id": "230406",
                            "fullname": "黑龙江省鹤岗市东山区"
                        },
                        {
                            "name": "兴山区",
                            "pId": "2304",
                            "id": "230407",
                            "fullname": "黑龙江省鹤岗市兴山区"
                        },
                        {
                            "name": "萝北县",
                            "pId": "2304",
                            "id": "230421",
                            "fullname": "黑龙江省鹤岗市萝北县"
                        },
                        {
                            "name": "绥滨县",
                            "pId": "2304",
                            "id": "230422",
                            "fullname": "黑龙江省鹤岗市绥滨县"
                        }
                    ]
                },
                {
                    "name": "双鸭山市",
                    "pId": "23",
                    "id": "2305",
                    "fullname": "黑龙江省双鸭山市",
                    "items": [
                        {
                            "name": "尖山区",
                            "pId": "2305",
                            "id": "230502",
                            "fullname": "黑龙江省双鸭山市尖山区"
                        },
                        {
                            "name": "岭东区",
                            "pId": "2305",
                            "id": "230503",
                            "fullname": "黑龙江省双鸭山市岭东区"
                        },
                        {
                            "name": "四方台区",
                            "pId": "2305",
                            "id": "230505",
                            "fullname": "黑龙江省双鸭山市四方台区"
                        },
                        {
                            "name": "宝山区",
                            "pId": "2305",
                            "id": "230506",
                            "fullname": "黑龙江省双鸭山市宝山区"
                        },
                        {
                            "name": "集贤县",
                            "pId": "2305",
                            "id": "230521",
                            "fullname": "黑龙江省双鸭山市集贤县"
                        },
                        {
                            "name": "友谊县",
                            "pId": "2305",
                            "id": "230522",
                            "fullname": "黑龙江省双鸭山市友谊县"
                        },
                        {
                            "name": "宝清县",
                            "pId": "2305",
                            "id": "230523",
                            "fullname": "黑龙江省双鸭山市宝清县"
                        },
                        {
                            "name": "饶河县",
                            "pId": "2305",
                            "id": "230524",
                            "fullname": "黑龙江省双鸭山市饶河县"
                        }
                    ]
                },
                {
                    "name": "大庆市",
                    "pId": "23",
                    "id": "2306",
                    "fullname": "黑龙江省大庆市",
                    "items": [
                        {
                            "name": "萨尔图区",
                            "pId": "2306",
                            "id": "230602",
                            "fullname": "黑龙江省大庆市萨尔图区"
                        },
                        {
                            "name": "龙凤区",
                            "pId": "2306",
                            "id": "230603",
                            "fullname": "黑龙江省大庆市龙凤区"
                        },
                        {
                            "name": "让胡路区",
                            "pId": "2306",
                            "id": "230604",
                            "fullname": "黑龙江省大庆市让胡路区"
                        },
                        {
                            "name": "红岗区",
                            "pId": "2306",
                            "id": "230605",
                            "fullname": "黑龙江省大庆市红岗区"
                        },
                        {
                            "name": "大同区",
                            "pId": "2306",
                            "id": "230606",
                            "fullname": "黑龙江省大庆市大同区"
                        },
                        {
                            "name": "肇州县",
                            "pId": "2306",
                            "id": "230621",
                            "fullname": "黑龙江省大庆市肇州县"
                        },
                        {
                            "name": "肇源县",
                            "pId": "2306",
                            "id": "230622",
                            "fullname": "黑龙江省大庆市肇源县"
                        },
                        {
                            "name": "林甸县",
                            "pId": "2306",
                            "id": "230623",
                            "fullname": "黑龙江省大庆市林甸县"
                        },
                        {
                            "name": "杜尔伯特蒙古族自治县",
                            "pId": "2306",
                            "id": "230624",
                            "fullname": "黑龙江省大庆市杜尔伯特蒙古族自治县"
                        }
                    ]
                },
                {
                    "name": "伊春市",
                    "pId": "23",
                    "id": "2307",
                    "fullname": "黑龙江省伊春市",
                    "items": [
                        {
                            "name": "伊春区",
                            "pId": "2307",
                            "id": "230702",
                            "fullname": "黑龙江省伊春市伊春区"
                        },
                        {
                            "name": "南岔区",
                            "pId": "2307",
                            "id": "230703",
                            "fullname": "黑龙江省伊春市南岔区"
                        },
                        {
                            "name": "友好区",
                            "pId": "2307",
                            "id": "230704",
                            "fullname": "黑龙江省伊春市友好区"
                        },
                        {
                            "name": "西林区",
                            "pId": "2307",
                            "id": "230705",
                            "fullname": "黑龙江省伊春市西林区"
                        },
                        {
                            "name": "翠峦区",
                            "pId": "2307",
                            "id": "230706",
                            "fullname": "黑龙江省伊春市翠峦区"
                        },
                        {
                            "name": "新青区",
                            "pId": "2307",
                            "id": "230707",
                            "fullname": "黑龙江省伊春市新青区"
                        },
                        {
                            "name": "美溪区",
                            "pId": "2307",
                            "id": "230708",
                            "fullname": "黑龙江省伊春市美溪区"
                        },
                        {
                            "name": "金山屯区",
                            "pId": "2307",
                            "id": "230709",
                            "fullname": "黑龙江省伊春市金山屯区"
                        },
                        {
                            "name": "五营区",
                            "pId": "2307",
                            "id": "230710",
                            "fullname": "黑龙江省伊春市五营区"
                        },
                        {
                            "name": "乌马河区",
                            "pId": "2307",
                            "id": "230711",
                            "fullname": "黑龙江省伊春市乌马河区"
                        },
                        {
                            "name": "汤旺河区",
                            "pId": "2307",
                            "id": "230712",
                            "fullname": "黑龙江省伊春市汤旺河区"
                        },
                        {
                            "name": "带岭区",
                            "pId": "2307",
                            "id": "230713",
                            "fullname": "黑龙江省伊春市带岭区"
                        },
                        {
                            "name": "乌伊岭区",
                            "pId": "2307",
                            "id": "230714",
                            "fullname": "黑龙江省伊春市乌伊岭区"
                        },
                        {
                            "name": "红星区",
                            "pId": "2307",
                            "id": "230715",
                            "fullname": "黑龙江省伊春市红星区"
                        },
                        {
                            "name": "上甘岭区",
                            "pId": "2307",
                            "id": "230716",
                            "fullname": "黑龙江省伊春市上甘岭区"
                        },
                        {
                            "name": "嘉荫县",
                            "pId": "2307",
                            "id": "230722",
                            "fullname": "黑龙江省伊春市嘉荫县"
                        },
                        {
                            "name": "铁力市",
                            "pId": "2307",
                            "id": "230781",
                            "fullname": "黑龙江省伊春市铁力市"
                        }
                    ]
                },
                {
                    "name": "佳木斯市",
                    "pId": "23",
                    "id": "2308",
                    "fullname": "黑龙江省佳木斯市",
                    "items": [
                        {
                            "name": "向阳区",
                            "pId": "2308",
                            "id": "230803",
                            "fullname": "黑龙江省佳木斯市向阳区"
                        },
                        {
                            "name": "前进区",
                            "pId": "2308",
                            "id": "230804",
                            "fullname": "黑龙江省佳木斯市前进区"
                        },
                        {
                            "name": "东风区",
                            "pId": "2308",
                            "id": "230805",
                            "fullname": "黑龙江省佳木斯市东风区"
                        },
                        {
                            "name": "郊区",
                            "pId": "2308",
                            "id": "230811",
                            "fullname": "黑龙江省佳木斯市郊区"
                        },
                        {
                            "name": "桦南县",
                            "pId": "2308",
                            "id": "230822",
                            "fullname": "黑龙江省佳木斯市桦南县"
                        },
                        {
                            "name": "桦川县",
                            "pId": "2308",
                            "id": "230826",
                            "fullname": "黑龙江省佳木斯市桦川县"
                        },
                        {
                            "name": "汤原县",
                            "pId": "2308",
                            "id": "230828",
                            "fullname": "黑龙江省佳木斯市汤原县"
                        },
                        {
                            "name": "抚远县",
                            "pId": "2308",
                            "id": "230833",
                            "fullname": "黑龙江省佳木斯市抚远县"
                        },
                        {
                            "name": "同江市",
                            "pId": "2308",
                            "id": "230881",
                            "fullname": "黑龙江省佳木斯市同江市"
                        },
                        {
                            "name": "富锦市",
                            "pId": "2308",
                            "id": "230882",
                            "fullname": "黑龙江省佳木斯市富锦市"
                        }
                    ]
                },
                {
                    "name": "七台河市",
                    "pId": "23",
                    "id": "2309",
                    "fullname": "黑龙江省七台河市",
                    "items": [
                        {
                            "name": "新兴区",
                            "pId": "2309",
                            "id": "230902",
                            "fullname": "黑龙江省七台河市新兴区"
                        },
                        {
                            "name": "桃山区",
                            "pId": "2309",
                            "id": "230903",
                            "fullname": "黑龙江省七台河市桃山区"
                        },
                        {
                            "name": "茄子河区",
                            "pId": "2309",
                            "id": "230904",
                            "fullname": "黑龙江省七台河市茄子河区"
                        },
                        {
                            "name": "勃利县",
                            "pId": "2309",
                            "id": "230921",
                            "fullname": "黑龙江省七台河市勃利县"
                        }
                    ]
                },
                {
                    "name": "牡丹江市",
                    "pId": "23",
                    "id": "2310",
                    "fullname": "黑龙江省牡丹江市",
                    "items": [
                        {
                            "name": "东安区",
                            "pId": "2310",
                            "id": "231002",
                            "fullname": "黑龙江省牡丹江市东安区"
                        },
                        {
                            "name": "阳明区",
                            "pId": "2310",
                            "id": "231003",
                            "fullname": "黑龙江省牡丹江市阳明区"
                        },
                        {
                            "name": "爱民区",
                            "pId": "2310",
                            "id": "231004",
                            "fullname": "黑龙江省牡丹江市爱民区"
                        },
                        {
                            "name": "西安区",
                            "pId": "2310",
                            "id": "231005",
                            "fullname": "黑龙江省牡丹江市西安区"
                        },
                        {
                            "name": "东宁县",
                            "pId": "2310",
                            "id": "231024",
                            "fullname": "黑龙江省牡丹江市东宁县"
                        },
                        {
                            "name": "林口县",
                            "pId": "2310",
                            "id": "231025",
                            "fullname": "黑龙江省牡丹江市林口县"
                        },
                        {
                            "name": "绥芬河市",
                            "pId": "2310",
                            "id": "231081",
                            "fullname": "黑龙江省牡丹江市绥芬河市"
                        },
                        {
                            "name": "海林市",
                            "pId": "2310",
                            "id": "231083",
                            "fullname": "黑龙江省牡丹江市海林市"
                        },
                        {
                            "name": "宁安市",
                            "pId": "2310",
                            "id": "231084",
                            "fullname": "黑龙江省牡丹江市宁安市"
                        },
                        {
                            "name": "穆棱市",
                            "pId": "2310",
                            "id": "231085",
                            "fullname": "黑龙江省牡丹江市穆棱市"
                        }
                    ]
                },
                {
                    "name": "黑河市",
                    "pId": "23",
                    "id": "2311",
                    "fullname": "黑龙江省黑河市",
                    "items": [
                        {
                            "name": "爱辉区",
                            "pId": "2311",
                            "id": "231102",
                            "fullname": "黑龙江省黑河市爱辉区"
                        },
                        {
                            "name": "嫩江县",
                            "pId": "2311",
                            "id": "231121",
                            "fullname": "黑龙江省黑河市嫩江县"
                        },
                        {
                            "name": "逊克县",
                            "pId": "2311",
                            "id": "231123",
                            "fullname": "黑龙江省黑河市逊克县"
                        },
                        {
                            "name": "孙吴县",
                            "pId": "2311",
                            "id": "231124",
                            "fullname": "黑龙江省黑河市孙吴县"
                        },
                        {
                            "name": "北安市",
                            "pId": "2311",
                            "id": "231181",
                            "fullname": "黑龙江省黑河市北安市"
                        },
                        {
                            "name": "五大连池市",
                            "pId": "2311",
                            "id": "231182",
                            "fullname": "黑龙江省黑河市五大连池市"
                        }
                    ]
                },
                {
                    "name": "绥化市",
                    "pId": "23",
                    "id": "2312",
                    "fullname": "黑龙江省绥化市",
                    "items": [
                        {
                            "name": "北林区",
                            "pId": "2312",
                            "id": "231202",
                            "fullname": "黑龙江省绥化市北林区"
                        },
                        {
                            "name": "望奎县",
                            "pId": "2312",
                            "id": "231221",
                            "fullname": "黑龙江省绥化市望奎县"
                        },
                        {
                            "name": "兰西县",
                            "pId": "2312",
                            "id": "231222",
                            "fullname": "黑龙江省绥化市兰西县"
                        },
                        {
                            "name": "青冈县",
                            "pId": "2312",
                            "id": "231223",
                            "fullname": "黑龙江省绥化市青冈县"
                        },
                        {
                            "name": "庆安县",
                            "pId": "2312",
                            "id": "231224",
                            "fullname": "黑龙江省绥化市庆安县"
                        },
                        {
                            "name": "明水县",
                            "pId": "2312",
                            "id": "231225",
                            "fullname": "黑龙江省绥化市明水县"
                        },
                        {
                            "name": "绥棱县",
                            "pId": "2312",
                            "id": "231226",
                            "fullname": "黑龙江省绥化市绥棱县"
                        },
                        {
                            "name": "安达市",
                            "pId": "2312",
                            "id": "231281",
                            "fullname": "黑龙江省绥化市安达市"
                        },
                        {
                            "name": "肇东市",
                            "pId": "2312",
                            "id": "231282",
                            "fullname": "黑龙江省绥化市肇东市"
                        },
                        {
                            "name": "海伦市",
                            "pId": "2312",
                            "id": "231283",
                            "fullname": "黑龙江省绥化市海伦市"
                        }
                    ]
                },
                {
                    "name": "大兴安岭地区",
                    "pId": "23",
                    "id": "2327",
                    "fullname": "黑龙江省大兴安岭地区",
                    "items": [
                        {
                            "name": "呼玛县",
                            "pId": "2327",
                            "id": "232721",
                            "fullname": "黑龙江省大兴安岭地区呼玛县"
                        },
                        {
                            "name": "塔河县",
                            "pId": "2327",
                            "id": "232722",
                            "fullname": "黑龙江省大兴安岭地区塔河县"
                        },
                        {
                            "name": "漠河县",
                            "pId": "2327",
                            "id": "232723",
                            "fullname": "黑龙江省大兴安岭地区漠河县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "上海市",
            "pId": "1",
            "id": "31",
            "fullname": "上海市",
            "items": [
                {
                    "name": "市辖区",
                    "pId": "31",
                    "id": "3101",
                    "fullname": "上海市市辖区",
                    "items": [
                        {
                            "name": "黄浦区",
                            "pId": "3101",
                            "id": "310101",
                            "fullname": "上海市市辖区黄浦区"
                        },
                        {
                            "name": "徐汇区",
                            "pId": "3101",
                            "id": "310104",
                            "fullname": "上海市市辖区徐汇区"
                        },
                        {
                            "name": "长宁区",
                            "pId": "3101",
                            "id": "310105",
                            "fullname": "上海市市辖区长宁区"
                        },
                        {
                            "name": "静安区",
                            "pId": "3101",
                            "id": "310106",
                            "fullname": "上海市市辖区静安区"
                        },
                        {
                            "name": "普陀区",
                            "pId": "3101",
                            "id": "310107",
                            "fullname": "上海市市辖区普陀区"
                        },
                        {
                            "name": "闸北区",
                            "pId": "3101",
                            "id": "310108",
                            "fullname": "上海市市辖区闸北区"
                        },
                        {
                            "name": "虹口区",
                            "pId": "3101",
                            "id": "310109",
                            "fullname": "上海市市辖区虹口区"
                        },
                        {
                            "name": "杨浦区",
                            "pId": "3101",
                            "id": "310110",
                            "fullname": "上海市市辖区杨浦区"
                        },
                        {
                            "name": "闵行区",
                            "pId": "3101",
                            "id": "310112",
                            "fullname": "上海市市辖区闵行区"
                        },
                        {
                            "name": "宝山区",
                            "pId": "3101",
                            "id": "310113",
                            "fullname": "上海市市辖区宝山区"
                        },
                        {
                            "name": "嘉定区",
                            "pId": "3101",
                            "id": "310114",
                            "fullname": "上海市市辖区嘉定区"
                        },
                        {
                            "name": "浦东新区",
                            "pId": "3101",
                            "id": "310115",
                            "fullname": "上海市市辖区浦东新区"
                        },
                        {
                            "name": "金山区",
                            "pId": "3101",
                            "id": "310116",
                            "fullname": "上海市市辖区金山区"
                        },
                        {
                            "name": "松江区",
                            "pId": "3101",
                            "id": "310117",
                            "fullname": "上海市市辖区松江区"
                        },
                        {
                            "name": "青浦区",
                            "pId": "3101",
                            "id": "310118",
                            "fullname": "上海市市辖区青浦区"
                        },
                        {
                            "name": "奉贤区",
                            "pId": "3101",
                            "id": "310120",
                            "fullname": "上海市市辖区奉贤区"
                        }
                    ]
                },
                {
                    "name": "县",
                    "pId": "31",
                    "id": "3102",
                    "fullname": "上海市县",
                    "items": [
                        {
                            "name": "崇明县",
                            "pId": "3102",
                            "id": "310230",
                            "fullname": "上海市县崇明县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "江苏省",
            "pId": "1",
            "id": "32",
            "fullname": "江苏省",
            "items": [
                {
                    "name": "南京市",
                    "pId": "32",
                    "id": "3201",
                    "fullname": "江苏省南京市",
                    "items": [
                        {
                            "name": "玄武区",
                            "pId": "3201",
                            "id": "320102",
                            "fullname": "江苏省南京市玄武区"
                        },
                        {
                            "name": "秦淮区",
                            "pId": "3201",
                            "id": "320104",
                            "fullname": "江苏省南京市秦淮区"
                        },
                        {
                            "name": "建邺区",
                            "pId": "3201",
                            "id": "320105",
                            "fullname": "江苏省南京市建邺区"
                        },
                        {
                            "name": "鼓楼区",
                            "pId": "3201",
                            "id": "320106",
                            "fullname": "江苏省南京市鼓楼区"
                        },
                        {
                            "name": "浦口区",
                            "pId": "3201",
                            "id": "320111",
                            "fullname": "江苏省南京市浦口区"
                        },
                        {
                            "name": "栖霞区",
                            "pId": "3201",
                            "id": "320113",
                            "fullname": "江苏省南京市栖霞区"
                        },
                        {
                            "name": "雨花台区",
                            "pId": "3201",
                            "id": "320114",
                            "fullname": "江苏省南京市雨花台区"
                        },
                        {
                            "name": "江宁区",
                            "pId": "3201",
                            "id": "320115",
                            "fullname": "江苏省南京市江宁区"
                        },
                        {
                            "name": "六合区",
                            "pId": "3201",
                            "id": "320116",
                            "fullname": "江苏省南京市六合区"
                        },
                        {
                            "name": "溧水区",
                            "pId": "3201",
                            "id": "320117",
                            "fullname": "江苏省南京市溧水区"
                        },
                        {
                            "name": "高淳区",
                            "pId": "3201",
                            "id": "320118",
                            "fullname": "江苏省南京市高淳区"
                        }
                    ]
                },
                {
                    "name": "无锡市",
                    "pId": "32",
                    "id": "3202",
                    "fullname": "江苏省无锡市",
                    "items": [
                        {
                            "name": "崇安区",
                            "pId": "3202",
                            "id": "320202",
                            "fullname": "江苏省无锡市崇安区"
                        },
                        {
                            "name": "南长区",
                            "pId": "3202",
                            "id": "320203",
                            "fullname": "江苏省无锡市南长区"
                        },
                        {
                            "name": "北塘区",
                            "pId": "3202",
                            "id": "320204",
                            "fullname": "江苏省无锡市北塘区"
                        },
                        {
                            "name": "锡山区",
                            "pId": "3202",
                            "id": "320205",
                            "fullname": "江苏省无锡市锡山区"
                        },
                        {
                            "name": "惠山区",
                            "pId": "3202",
                            "id": "320206",
                            "fullname": "江苏省无锡市惠山区"
                        },
                        {
                            "name": "滨湖区",
                            "pId": "3202",
                            "id": "320211",
                            "fullname": "江苏省无锡市滨湖区"
                        },
                        {
                            "name": "江阴市",
                            "pId": "3202",
                            "id": "320281",
                            "fullname": "江苏省无锡市江阴市"
                        },
                        {
                            "name": "宜兴市",
                            "pId": "3202",
                            "id": "320282",
                            "fullname": "江苏省无锡市宜兴市"
                        }
                    ]
                },
                {
                    "name": "徐州市",
                    "pId": "32",
                    "id": "3203",
                    "fullname": "江苏省徐州市",
                    "items": [
                        {
                            "name": "鼓楼区",
                            "pId": "3203",
                            "id": "320302",
                            "fullname": "江苏省徐州市鼓楼区"
                        },
                        {
                            "name": "云龙区",
                            "pId": "3203",
                            "id": "320303",
                            "fullname": "江苏省徐州市云龙区"
                        },
                        {
                            "name": "贾汪区",
                            "pId": "3203",
                            "id": "320305",
                            "fullname": "江苏省徐州市贾汪区"
                        },
                        {
                            "name": "泉山区",
                            "pId": "3203",
                            "id": "320311",
                            "fullname": "江苏省徐州市泉山区"
                        },
                        {
                            "name": "铜山区",
                            "pId": "3203",
                            "id": "320312",
                            "fullname": "江苏省徐州市铜山区"
                        },
                        {
                            "name": "丰县",
                            "pId": "3203",
                            "id": "320321",
                            "fullname": "江苏省徐州市丰县"
                        },
                        {
                            "name": "沛县",
                            "pId": "3203",
                            "id": "320322",
                            "fullname": "江苏省徐州市沛县"
                        },
                        {
                            "name": "睢宁县",
                            "pId": "3203",
                            "id": "320324",
                            "fullname": "江苏省徐州市睢宁县"
                        },
                        {
                            "name": "新沂市",
                            "pId": "3203",
                            "id": "320381",
                            "fullname": "江苏省徐州市新沂市"
                        },
                        {
                            "name": "邳州市",
                            "pId": "3203",
                            "id": "320382",
                            "fullname": "江苏省徐州市邳州市"
                        }
                    ]
                },
                {
                    "name": "常州市",
                    "pId": "32",
                    "id": "3204",
                    "fullname": "江苏省常州市",
                    "items": [
                        {
                            "name": "天宁区",
                            "pId": "3204",
                            "id": "320402",
                            "fullname": "江苏省常州市天宁区"
                        },
                        {
                            "name": "钟楼区",
                            "pId": "3204",
                            "id": "320404",
                            "fullname": "江苏省常州市钟楼区"
                        },
                        {
                            "name": "戚墅堰区",
                            "pId": "3204",
                            "id": "320405",
                            "fullname": "江苏省常州市戚墅堰区"
                        },
                        {
                            "name": "新北区",
                            "pId": "3204",
                            "id": "320411",
                            "fullname": "江苏省常州市新北区"
                        },
                        {
                            "name": "武进区",
                            "pId": "3204",
                            "id": "320412",
                            "fullname": "江苏省常州市武进区"
                        },
                        {
                            "name": "溧阳市",
                            "pId": "3204",
                            "id": "320481",
                            "fullname": "江苏省常州市溧阳市"
                        },
                        {
                            "name": "金坛市",
                            "pId": "3204",
                            "id": "320482",
                            "fullname": "江苏省常州市金坛市"
                        }
                    ]
                },
                {
                    "name": "苏州市",
                    "pId": "32",
                    "id": "3205",
                    "fullname": "江苏省苏州市",
                    "items": [
                        {
                            "name": "虎丘区",
                            "pId": "3205",
                            "id": "320505",
                            "fullname": "江苏省苏州市虎丘区"
                        },
                        {
                            "name": "吴中区",
                            "pId": "3205",
                            "id": "320506",
                            "fullname": "江苏省苏州市吴中区"
                        },
                        {
                            "name": "相城区",
                            "pId": "3205",
                            "id": "320507",
                            "fullname": "江苏省苏州市相城区"
                        },
                        {
                            "name": "姑苏区",
                            "pId": "3205",
                            "id": "320508",
                            "fullname": "江苏省苏州市姑苏区"
                        },
                        {
                            "name": "吴江区",
                            "pId": "3205",
                            "id": "320509",
                            "fullname": "江苏省苏州市吴江区"
                        },
                        {
                            "name": "常熟市",
                            "pId": "3205",
                            "id": "320581",
                            "fullname": "江苏省苏州市常熟市"
                        },
                        {
                            "name": "张家港市",
                            "pId": "3205",
                            "id": "320582",
                            "fullname": "江苏省苏州市张家港市"
                        },
                        {
                            "name": "昆山市",
                            "pId": "3205",
                            "id": "320583",
                            "fullname": "江苏省苏州市昆山市"
                        },
                        {
                            "name": "太仓市",
                            "pId": "3205",
                            "id": "320585",
                            "fullname": "江苏省苏州市太仓市"
                        }
                    ]
                },
                {
                    "name": "南通市",
                    "pId": "32",
                    "id": "3206",
                    "fullname": "江苏省南通市",
                    "items": [
                        {
                            "name": "崇川区",
                            "pId": "3206",
                            "id": "320602",
                            "fullname": "江苏省南通市崇川区"
                        },
                        {
                            "name": "港闸区",
                            "pId": "3206",
                            "id": "320611",
                            "fullname": "江苏省南通市港闸区"
                        },
                        {
                            "name": "通州区",
                            "pId": "3206",
                            "id": "320612",
                            "fullname": "江苏省南通市通州区"
                        },
                        {
                            "name": "海安县",
                            "pId": "3206",
                            "id": "320621",
                            "fullname": "江苏省南通市海安县"
                        },
                        {
                            "name": "如东县",
                            "pId": "3206",
                            "id": "320623",
                            "fullname": "江苏省南通市如东县"
                        },
                        {
                            "name": "启东市",
                            "pId": "3206",
                            "id": "320681",
                            "fullname": "江苏省南通市启东市"
                        },
                        {
                            "name": "如皋市",
                            "pId": "3206",
                            "id": "320682",
                            "fullname": "江苏省南通市如皋市"
                        },
                        {
                            "name": "海门市",
                            "pId": "3206",
                            "id": "320684",
                            "fullname": "江苏省南通市海门市"
                        }
                    ]
                },
                {
                    "name": "连云港市",
                    "pId": "32",
                    "id": "3207",
                    "fullname": "江苏省连云港市",
                    "items": [
                        {
                            "name": "连云区",
                            "pId": "3207",
                            "id": "320703",
                            "fullname": "江苏省连云港市连云区"
                        },
                        {
                            "name": "新浦区",
                            "pId": "3207",
                            "id": "320705",
                            "fullname": "江苏省连云港市新浦区"
                        },
                        {
                            "name": "海州区",
                            "pId": "3207",
                            "id": "320706",
                            "fullname": "江苏省连云港市海州区"
                        },
                        {
                            "name": "赣榆县",
                            "pId": "3207",
                            "id": "320721",
                            "fullname": "江苏省连云港市赣榆县"
                        },
                        {
                            "name": "东海县",
                            "pId": "3207",
                            "id": "320722",
                            "fullname": "江苏省连云港市东海县"
                        },
                        {
                            "name": "灌云县",
                            "pId": "3207",
                            "id": "320723",
                            "fullname": "江苏省连云港市灌云县"
                        },
                        {
                            "name": "灌南县",
                            "pId": "3207",
                            "id": "320724",
                            "fullname": "江苏省连云港市灌南县"
                        }
                    ]
                },
                {
                    "name": "淮安市",
                    "pId": "32",
                    "id": "3208",
                    "fullname": "江苏省淮安市",
                    "items": [
                        {
                            "name": "清河区",
                            "pId": "3208",
                            "id": "320802",
                            "fullname": "江苏省淮安市清河区"
                        },
                        {
                            "name": "淮安区",
                            "pId": "3208",
                            "id": "320803",
                            "fullname": "江苏省淮安市淮安区"
                        },
                        {
                            "name": "淮阴区",
                            "pId": "3208",
                            "id": "320804",
                            "fullname": "江苏省淮安市淮阴区"
                        },
                        {
                            "name": "清浦区",
                            "pId": "3208",
                            "id": "320811",
                            "fullname": "江苏省淮安市清浦区"
                        },
                        {
                            "name": "涟水县",
                            "pId": "3208",
                            "id": "320826",
                            "fullname": "江苏省淮安市涟水县"
                        },
                        {
                            "name": "洪泽县",
                            "pId": "3208",
                            "id": "320829",
                            "fullname": "江苏省淮安市洪泽县"
                        },
                        {
                            "name": "盱眙县",
                            "pId": "3208",
                            "id": "320830",
                            "fullname": "江苏省淮安市盱眙县"
                        },
                        {
                            "name": "金湖县",
                            "pId": "3208",
                            "id": "320831",
                            "fullname": "江苏省淮安市金湖县"
                        }
                    ]
                },
                {
                    "name": "盐城市",
                    "pId": "32",
                    "id": "3209",
                    "fullname": "江苏省盐城市",
                    "items": [
                        {
                            "name": "亭湖区",
                            "pId": "3209",
                            "id": "320902",
                            "fullname": "江苏省盐城市亭湖区"
                        },
                        {
                            "name": "盐都区",
                            "pId": "3209",
                            "id": "320903",
                            "fullname": "江苏省盐城市盐都区"
                        },
                        {
                            "name": "响水县",
                            "pId": "3209",
                            "id": "320921",
                            "fullname": "江苏省盐城市响水县"
                        },
                        {
                            "name": "滨海县",
                            "pId": "3209",
                            "id": "320922",
                            "fullname": "江苏省盐城市滨海县"
                        },
                        {
                            "name": "阜宁县",
                            "pId": "3209",
                            "id": "320923",
                            "fullname": "江苏省盐城市阜宁县"
                        },
                        {
                            "name": "射阳县",
                            "pId": "3209",
                            "id": "320924",
                            "fullname": "江苏省盐城市射阳县"
                        },
                        {
                            "name": "建湖县",
                            "pId": "3209",
                            "id": "320925",
                            "fullname": "江苏省盐城市建湖县"
                        },
                        {
                            "name": "东台市",
                            "pId": "3209",
                            "id": "320981",
                            "fullname": "江苏省盐城市东台市"
                        },
                        {
                            "name": "大丰市",
                            "pId": "3209",
                            "id": "320982",
                            "fullname": "江苏省盐城市大丰市"
                        }
                    ]
                },
                {
                    "name": "扬州市",
                    "pId": "32",
                    "id": "3210",
                    "fullname": "江苏省扬州市",
                    "items": [
                        {
                            "name": "广陵区",
                            "pId": "3210",
                            "id": "321002",
                            "fullname": "江苏省扬州市广陵区"
                        },
                        {
                            "name": "邗江区",
                            "pId": "3210",
                            "id": "321003",
                            "fullname": "江苏省扬州市邗江区"
                        },
                        {
                            "name": "江都区",
                            "pId": "3210",
                            "id": "321012",
                            "fullname": "江苏省扬州市江都区"
                        },
                        {
                            "name": "宝应县",
                            "pId": "3210",
                            "id": "321023",
                            "fullname": "江苏省扬州市宝应县"
                        },
                        {
                            "name": "仪征市",
                            "pId": "3210",
                            "id": "321081",
                            "fullname": "江苏省扬州市仪征市"
                        },
                        {
                            "name": "高邮市",
                            "pId": "3210",
                            "id": "321084",
                            "fullname": "江苏省扬州市高邮市"
                        }
                    ]
                },
                {
                    "name": "镇江市",
                    "pId": "32",
                    "id": "3211",
                    "fullname": "江苏省镇江市",
                    "items": [
                        {
                            "name": "京口区",
                            "pId": "3211",
                            "id": "321102",
                            "fullname": "江苏省镇江市京口区"
                        },
                        {
                            "name": "润州区",
                            "pId": "3211",
                            "id": "321111",
                            "fullname": "江苏省镇江市润州区"
                        },
                        {
                            "name": "丹徒区",
                            "pId": "3211",
                            "id": "321112",
                            "fullname": "江苏省镇江市丹徒区"
                        },
                        {
                            "name": "丹阳市",
                            "pId": "3211",
                            "id": "321181",
                            "fullname": "江苏省镇江市丹阳市"
                        },
                        {
                            "name": "扬中市",
                            "pId": "3211",
                            "id": "321182",
                            "fullname": "江苏省镇江市扬中市"
                        },
                        {
                            "name": "句容市",
                            "pId": "3211",
                            "id": "321183",
                            "fullname": "江苏省镇江市句容市"
                        }
                    ]
                },
                {
                    "name": "泰州市",
                    "pId": "32",
                    "id": "3212",
                    "fullname": "江苏省泰州市",
                    "items": [
                        {
                            "name": "海陵区",
                            "pId": "3212",
                            "id": "321202",
                            "fullname": "江苏省泰州市海陵区"
                        },
                        {
                            "name": "高港区",
                            "pId": "3212",
                            "id": "321203",
                            "fullname": "江苏省泰州市高港区"
                        },
                        {
                            "name": "姜堰区",
                            "pId": "3212",
                            "id": "321204",
                            "fullname": "江苏省泰州市姜堰区"
                        },
                        {
                            "name": "兴化市",
                            "pId": "3212",
                            "id": "321281",
                            "fullname": "江苏省泰州市兴化市"
                        },
                        {
                            "name": "靖江市",
                            "pId": "3212",
                            "id": "321282",
                            "fullname": "江苏省泰州市靖江市"
                        },
                        {
                            "name": "泰兴市",
                            "pId": "3212",
                            "id": "321283",
                            "fullname": "江苏省泰州市泰兴市"
                        }
                    ]
                },
                {
                    "name": "宿迁市",
                    "pId": "32",
                    "id": "3213",
                    "fullname": "江苏省宿迁市",
                    "items": [
                        {
                            "name": "宿城区",
                            "pId": "3213",
                            "id": "321302",
                            "fullname": "江苏省宿迁市宿城区"
                        },
                        {
                            "name": "宿豫区",
                            "pId": "3213",
                            "id": "321311",
                            "fullname": "江苏省宿迁市宿豫区"
                        },
                        {
                            "name": "沭阳县",
                            "pId": "3213",
                            "id": "321322",
                            "fullname": "江苏省宿迁市沭阳县"
                        },
                        {
                            "name": "泗阳县",
                            "pId": "3213",
                            "id": "321323",
                            "fullname": "江苏省宿迁市泗阳县"
                        },
                        {
                            "name": "泗洪县",
                            "pId": "3213",
                            "id": "321324",
                            "fullname": "江苏省宿迁市泗洪县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "浙江省",
            "pId": "1",
            "id": "33",
            "fullname": "浙江省",
            "items": [
                {
                    "name": "杭州市",
                    "pId": "33",
                    "id": "3301",
                    "fullname": "浙江省杭州市",
                    "items": [
                        {
                            "name": "上城区",
                            "pId": "3301",
                            "id": "330102",
                            "fullname": "浙江省杭州市上城区"
                        },
                        {
                            "name": "下城区",
                            "pId": "3301",
                            "id": "330103",
                            "fullname": "浙江省杭州市下城区"
                        },
                        {
                            "name": "江干区",
                            "pId": "3301",
                            "id": "330104",
                            "fullname": "浙江省杭州市江干区"
                        },
                        {
                            "name": "拱墅区",
                            "pId": "3301",
                            "id": "330105",
                            "fullname": "浙江省杭州市拱墅区"
                        },
                        {
                            "name": "西湖区",
                            "pId": "3301",
                            "id": "330106",
                            "fullname": "浙江省杭州市西湖区"
                        },
                        {
                            "name": "滨江区",
                            "pId": "3301",
                            "id": "330108",
                            "fullname": "浙江省杭州市滨江区"
                        },
                        {
                            "name": "萧山区",
                            "pId": "3301",
                            "id": "330109",
                            "fullname": "浙江省杭州市萧山区"
                        },
                        {
                            "name": "余杭区",
                            "pId": "3301",
                            "id": "330110",
                            "fullname": "浙江省杭州市余杭区"
                        },
                        {
                            "name": "桐庐县",
                            "pId": "3301",
                            "id": "330122",
                            "fullname": "浙江省杭州市桐庐县"
                        },
                        {
                            "name": "淳安县",
                            "pId": "3301",
                            "id": "330127",
                            "fullname": "浙江省杭州市淳安县"
                        },
                        {
                            "name": "建德市",
                            "pId": "3301",
                            "id": "330182",
                            "fullname": "浙江省杭州市建德市"
                        },
                        {
                            "name": "富阳市",
                            "pId": "3301",
                            "id": "330183",
                            "fullname": "浙江省杭州市富阳市"
                        },
                        {
                            "name": "临安市",
                            "pId": "3301",
                            "id": "330185",
                            "fullname": "浙江省杭州市临安市"
                        }
                    ]
                },
                {
                    "name": "宁波市",
                    "pId": "33",
                    "id": "3302",
                    "fullname": "浙江省宁波市",
                    "items": [
                        {
                            "name": "海曙区",
                            "pId": "3302",
                            "id": "330203",
                            "fullname": "浙江省宁波市海曙区"
                        },
                        {
                            "name": "江东区",
                            "pId": "3302",
                            "id": "330204",
                            "fullname": "浙江省宁波市江东区"
                        },
                        {
                            "name": "江北区",
                            "pId": "3302",
                            "id": "330205",
                            "fullname": "浙江省宁波市江北区"
                        },
                        {
                            "name": "北仑区",
                            "pId": "3302",
                            "id": "330206",
                            "fullname": "浙江省宁波市北仑区"
                        },
                        {
                            "name": "镇海区",
                            "pId": "3302",
                            "id": "330211",
                            "fullname": "浙江省宁波市镇海区"
                        },
                        {
                            "name": "鄞州区",
                            "pId": "3302",
                            "id": "330212",
                            "fullname": "浙江省宁波市鄞州区"
                        },
                        {
                            "name": "象山县",
                            "pId": "3302",
                            "id": "330225",
                            "fullname": "浙江省宁波市象山县"
                        },
                        {
                            "name": "宁海县",
                            "pId": "3302",
                            "id": "330226",
                            "fullname": "浙江省宁波市宁海县"
                        },
                        {
                            "name": "余姚市",
                            "pId": "3302",
                            "id": "330281",
                            "fullname": "浙江省宁波市余姚市"
                        },
                        {
                            "name": "慈溪市",
                            "pId": "3302",
                            "id": "330282",
                            "fullname": "浙江省宁波市慈溪市"
                        },
                        {
                            "name": "奉化市",
                            "pId": "3302",
                            "id": "330283",
                            "fullname": "浙江省宁波市奉化市"
                        }
                    ]
                },
                {
                    "name": "温州市",
                    "pId": "33",
                    "id": "3303",
                    "fullname": "浙江省温州市",
                    "items": [
                        {
                            "name": "鹿城区",
                            "pId": "3303",
                            "id": "330302",
                            "fullname": "浙江省温州市鹿城区"
                        },
                        {
                            "name": "龙湾区",
                            "pId": "3303",
                            "id": "330303",
                            "fullname": "浙江省温州市龙湾区"
                        },
                        {
                            "name": "瓯海区",
                            "pId": "3303",
                            "id": "330304",
                            "fullname": "浙江省温州市瓯海区"
                        },
                        {
                            "name": "洞头县",
                            "pId": "3303",
                            "id": "330322",
                            "fullname": "浙江省温州市洞头县"
                        },
                        {
                            "name": "永嘉县",
                            "pId": "3303",
                            "id": "330324",
                            "fullname": "浙江省温州市永嘉县"
                        },
                        {
                            "name": "平阳县",
                            "pId": "3303",
                            "id": "330326",
                            "fullname": "浙江省温州市平阳县"
                        },
                        {
                            "name": "苍南县",
                            "pId": "3303",
                            "id": "330327",
                            "fullname": "浙江省温州市苍南县"
                        },
                        {
                            "name": "文成县",
                            "pId": "3303",
                            "id": "330328",
                            "fullname": "浙江省温州市文成县"
                        },
                        {
                            "name": "泰顺县",
                            "pId": "3303",
                            "id": "330329",
                            "fullname": "浙江省温州市泰顺县"
                        },
                        {
                            "name": "瑞安市",
                            "pId": "3303",
                            "id": "330381",
                            "fullname": "浙江省温州市瑞安市"
                        },
                        {
                            "name": "乐清市",
                            "pId": "3303",
                            "id": "330382",
                            "fullname": "浙江省温州市乐清市"
                        }
                    ]
                },
                {
                    "name": "嘉兴市",
                    "pId": "33",
                    "id": "3304",
                    "fullname": "浙江省嘉兴市",
                    "items": [
                        {
                            "name": "南湖区",
                            "pId": "3304",
                            "id": "330402",
                            "fullname": "浙江省嘉兴市南湖区"
                        },
                        {
                            "name": "秀洲区",
                            "pId": "3304",
                            "id": "330411",
                            "fullname": "浙江省嘉兴市秀洲区"
                        },
                        {
                            "name": "嘉善县",
                            "pId": "3304",
                            "id": "330421",
                            "fullname": "浙江省嘉兴市嘉善县"
                        },
                        {
                            "name": "海盐县",
                            "pId": "3304",
                            "id": "330424",
                            "fullname": "浙江省嘉兴市海盐县"
                        },
                        {
                            "name": "海宁市",
                            "pId": "3304",
                            "id": "330481",
                            "fullname": "浙江省嘉兴市海宁市"
                        },
                        {
                            "name": "平湖市",
                            "pId": "3304",
                            "id": "330482",
                            "fullname": "浙江省嘉兴市平湖市"
                        },
                        {
                            "name": "桐乡市",
                            "pId": "3304",
                            "id": "330483",
                            "fullname": "浙江省嘉兴市桐乡市"
                        }
                    ]
                },
                {
                    "name": "湖州市",
                    "pId": "33",
                    "id": "3305",
                    "fullname": "浙江省湖州市",
                    "items": [
                        {
                            "name": "吴兴区",
                            "pId": "3305",
                            "id": "330502",
                            "fullname": "浙江省湖州市吴兴区"
                        },
                        {
                            "name": "南浔区",
                            "pId": "3305",
                            "id": "330503",
                            "fullname": "浙江省湖州市南浔区"
                        },
                        {
                            "name": "德清县",
                            "pId": "3305",
                            "id": "330521",
                            "fullname": "浙江省湖州市德清县"
                        },
                        {
                            "name": "长兴县",
                            "pId": "3305",
                            "id": "330522",
                            "fullname": "浙江省湖州市长兴县"
                        },
                        {
                            "name": "安吉县",
                            "pId": "3305",
                            "id": "330523",
                            "fullname": "浙江省湖州市安吉县"
                        }
                    ]
                },
                {
                    "name": "绍兴市",
                    "pId": "33",
                    "id": "3306",
                    "fullname": "浙江省绍兴市",
                    "items": [
                        {
                            "name": "越城区",
                            "pId": "3306",
                            "id": "330602",
                            "fullname": "浙江省绍兴市越城区"
                        },
                        {
                            "name": "绍兴县",
                            "pId": "3306",
                            "id": "330621",
                            "fullname": "浙江省绍兴市绍兴县"
                        },
                        {
                            "name": "新昌县",
                            "pId": "3306",
                            "id": "330624",
                            "fullname": "浙江省绍兴市新昌县"
                        },
                        {
                            "name": "诸暨市",
                            "pId": "3306",
                            "id": "330681",
                            "fullname": "浙江省绍兴市诸暨市"
                        },
                        {
                            "name": "上虞市",
                            "pId": "3306",
                            "id": "330682",
                            "fullname": "浙江省绍兴市上虞市"
                        },
                        {
                            "name": "嵊州市",
                            "pId": "3306",
                            "id": "330683",
                            "fullname": "浙江省绍兴市嵊州市"
                        }
                    ]
                },
                {
                    "name": "金华市",
                    "pId": "33",
                    "id": "3307",
                    "fullname": "浙江省金华市",
                    "items": [
                        {
                            "name": "婺城区",
                            "pId": "3307",
                            "id": "330702",
                            "fullname": "浙江省金华市婺城区"
                        },
                        {
                            "name": "金东区",
                            "pId": "3307",
                            "id": "330703",
                            "fullname": "浙江省金华市金东区"
                        },
                        {
                            "name": "武义县",
                            "pId": "3307",
                            "id": "330723",
                            "fullname": "浙江省金华市武义县"
                        },
                        {
                            "name": "浦江县",
                            "pId": "3307",
                            "id": "330726",
                            "fullname": "浙江省金华市浦江县"
                        },
                        {
                            "name": "磐安县",
                            "pId": "3307",
                            "id": "330727",
                            "fullname": "浙江省金华市磐安县"
                        },
                        {
                            "name": "兰溪市",
                            "pId": "3307",
                            "id": "330781",
                            "fullname": "浙江省金华市兰溪市"
                        },
                        {
                            "name": "义乌市",
                            "pId": "3307",
                            "id": "330782",
                            "fullname": "浙江省金华市义乌市"
                        },
                        {
                            "name": "东阳市",
                            "pId": "3307",
                            "id": "330783",
                            "fullname": "浙江省金华市东阳市"
                        },
                        {
                            "name": "永康市",
                            "pId": "3307",
                            "id": "330784",
                            "fullname": "浙江省金华市永康市"
                        }
                    ]
                },
                {
                    "name": "衢州市",
                    "pId": "33",
                    "id": "3308",
                    "fullname": "浙江省衢州市",
                    "items": [
                        {
                            "name": "柯城区",
                            "pId": "3308",
                            "id": "330802",
                            "fullname": "浙江省衢州市柯城区"
                        },
                        {
                            "name": "衢江区",
                            "pId": "3308",
                            "id": "330803",
                            "fullname": "浙江省衢州市衢江区"
                        },
                        {
                            "name": "常山县",
                            "pId": "3308",
                            "id": "330822",
                            "fullname": "浙江省衢州市常山县"
                        },
                        {
                            "name": "开化县",
                            "pId": "3308",
                            "id": "330824",
                            "fullname": "浙江省衢州市开化县"
                        },
                        {
                            "name": "龙游县",
                            "pId": "3308",
                            "id": "330825",
                            "fullname": "浙江省衢州市龙游县"
                        },
                        {
                            "name": "江山市",
                            "pId": "3308",
                            "id": "330881",
                            "fullname": "浙江省衢州市江山市"
                        }
                    ]
                },
                {
                    "name": "舟山市",
                    "pId": "33",
                    "id": "3309",
                    "fullname": "浙江省舟山市",
                    "items": [
                        {
                            "name": "定海区",
                            "pId": "3309",
                            "id": "330902",
                            "fullname": "浙江省舟山市定海区"
                        },
                        {
                            "name": "普陀区",
                            "pId": "3309",
                            "id": "330903",
                            "fullname": "浙江省舟山市普陀区"
                        },
                        {
                            "name": "岱山县",
                            "pId": "3309",
                            "id": "330921",
                            "fullname": "浙江省舟山市岱山县"
                        },
                        {
                            "name": "嵊泗县",
                            "pId": "3309",
                            "id": "330922",
                            "fullname": "浙江省舟山市嵊泗县"
                        }
                    ]
                },
                {
                    "name": "台州市",
                    "pId": "33",
                    "id": "3310",
                    "fullname": "浙江省台州市",
                    "items": [
                        {
                            "name": "椒江区",
                            "pId": "3310",
                            "id": "331002",
                            "fullname": "浙江省台州市椒江区"
                        },
                        {
                            "name": "黄岩区",
                            "pId": "3310",
                            "id": "331003",
                            "fullname": "浙江省台州市黄岩区"
                        },
                        {
                            "name": "路桥区",
                            "pId": "3310",
                            "id": "331004",
                            "fullname": "浙江省台州市路桥区"
                        },
                        {
                            "name": "玉环县",
                            "pId": "3310",
                            "id": "331021",
                            "fullname": "浙江省台州市玉环县"
                        },
                        {
                            "name": "三门县",
                            "pId": "3310",
                            "id": "331022",
                            "fullname": "浙江省台州市三门县"
                        },
                        {
                            "name": "天台县",
                            "pId": "3310",
                            "id": "331023",
                            "fullname": "浙江省台州市天台县"
                        },
                        {
                            "name": "仙居县",
                            "pId": "3310",
                            "id": "331024",
                            "fullname": "浙江省台州市仙居县"
                        },
                        {
                            "name": "温岭市",
                            "pId": "3310",
                            "id": "331081",
                            "fullname": "浙江省台州市温岭市"
                        },
                        {
                            "name": "临海市",
                            "pId": "3310",
                            "id": "331082",
                            "fullname": "浙江省台州市临海市"
                        }
                    ]
                },
                {
                    "name": "丽水市",
                    "pId": "33",
                    "id": "3311",
                    "fullname": "浙江省丽水市",
                    "items": [
                        {
                            "name": "莲都区",
                            "pId": "3311",
                            "id": "331102",
                            "fullname": "浙江省丽水市莲都区"
                        },
                        {
                            "name": "青田县",
                            "pId": "3311",
                            "id": "331121",
                            "fullname": "浙江省丽水市青田县"
                        },
                        {
                            "name": "缙云县",
                            "pId": "3311",
                            "id": "331122",
                            "fullname": "浙江省丽水市缙云县"
                        },
                        {
                            "name": "遂昌县",
                            "pId": "3311",
                            "id": "331123",
                            "fullname": "浙江省丽水市遂昌县"
                        },
                        {
                            "name": "松阳县",
                            "pId": "3311",
                            "id": "331124",
                            "fullname": "浙江省丽水市松阳县"
                        },
                        {
                            "name": "云和县",
                            "pId": "3311",
                            "id": "331125",
                            "fullname": "浙江省丽水市云和县"
                        },
                        {
                            "name": "庆元县",
                            "pId": "3311",
                            "id": "331126",
                            "fullname": "浙江省丽水市庆元县"
                        },
                        {
                            "name": "景宁畲族自治县",
                            "pId": "3311",
                            "id": "331127",
                            "fullname": "浙江省丽水市景宁畲族自治县"
                        },
                        {
                            "name": "龙泉市",
                            "pId": "3311",
                            "id": "331181",
                            "fullname": "浙江省丽水市龙泉市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "安徽省",
            "pId": "1",
            "id": "34",
            "fullname": "安徽省",
            "items": [
                {
                    "name": "合肥市",
                    "pId": "34",
                    "id": "3401",
                    "fullname": "安徽省合肥市",
                    "items": [
                        {
                            "name": "瑶海区",
                            "pId": "3401",
                            "id": "340102",
                            "fullname": "安徽省合肥市瑶海区"
                        },
                        {
                            "name": "庐阳区",
                            "pId": "3401",
                            "id": "340103",
                            "fullname": "安徽省合肥市庐阳区"
                        },
                        {
                            "name": "蜀山区",
                            "pId": "3401",
                            "id": "340104",
                            "fullname": "安徽省合肥市蜀山区"
                        },
                        {
                            "name": "包河区",
                            "pId": "3401",
                            "id": "340111",
                            "fullname": "安徽省合肥市包河区"
                        },
                        {
                            "name": "长丰县",
                            "pId": "3401",
                            "id": "340121",
                            "fullname": "安徽省合肥市长丰县"
                        },
                        {
                            "name": "肥东县",
                            "pId": "3401",
                            "id": "340122",
                            "fullname": "安徽省合肥市肥东县"
                        },
                        {
                            "name": "肥西县",
                            "pId": "3401",
                            "id": "340123",
                            "fullname": "安徽省合肥市肥西县"
                        },
                        {
                            "name": "庐江县",
                            "pId": "3401",
                            "id": "340124",
                            "fullname": "安徽省合肥市庐江县"
                        },
                        {
                            "name": "巢湖市",
                            "pId": "3401",
                            "id": "340181",
                            "fullname": "安徽省合肥市巢湖市"
                        }
                    ]
                },
                {
                    "name": "芜湖市",
                    "pId": "34",
                    "id": "3402",
                    "fullname": "安徽省芜湖市",
                    "items": [
                        {
                            "name": "镜湖区",
                            "pId": "3402",
                            "id": "340202",
                            "fullname": "安徽省芜湖市镜湖区"
                        },
                        {
                            "name": "弋江区",
                            "pId": "3402",
                            "id": "340203",
                            "fullname": "安徽省芜湖市弋江区"
                        },
                        {
                            "name": "鸠江区",
                            "pId": "3402",
                            "id": "340207",
                            "fullname": "安徽省芜湖市鸠江区"
                        },
                        {
                            "name": "三山区",
                            "pId": "3402",
                            "id": "340208",
                            "fullname": "安徽省芜湖市三山区"
                        },
                        {
                            "name": "芜湖县",
                            "pId": "3402",
                            "id": "340221",
                            "fullname": "安徽省芜湖市芜湖县"
                        },
                        {
                            "name": "繁昌县",
                            "pId": "3402",
                            "id": "340222",
                            "fullname": "安徽省芜湖市繁昌县"
                        },
                        {
                            "name": "南陵县",
                            "pId": "3402",
                            "id": "340223",
                            "fullname": "安徽省芜湖市南陵县"
                        },
                        {
                            "name": "无为县",
                            "pId": "3402",
                            "id": "340225",
                            "fullname": "安徽省芜湖市无为县"
                        }
                    ]
                },
                {
                    "name": "蚌埠市",
                    "pId": "34",
                    "id": "3403",
                    "fullname": "安徽省蚌埠市",
                    "items": [
                        {
                            "name": "龙子湖区",
                            "pId": "3403",
                            "id": "340302",
                            "fullname": "安徽省蚌埠市龙子湖区"
                        },
                        {
                            "name": "蚌山区",
                            "pId": "3403",
                            "id": "340303",
                            "fullname": "安徽省蚌埠市蚌山区"
                        },
                        {
                            "name": "禹会区",
                            "pId": "3403",
                            "id": "340304",
                            "fullname": "安徽省蚌埠市禹会区"
                        },
                        {
                            "name": "淮上区",
                            "pId": "3403",
                            "id": "340311",
                            "fullname": "安徽省蚌埠市淮上区"
                        },
                        {
                            "name": "怀远县",
                            "pId": "3403",
                            "id": "340321",
                            "fullname": "安徽省蚌埠市怀远县"
                        },
                        {
                            "name": "五河县",
                            "pId": "3403",
                            "id": "340322",
                            "fullname": "安徽省蚌埠市五河县"
                        },
                        {
                            "name": "固镇县",
                            "pId": "3403",
                            "id": "340323",
                            "fullname": "安徽省蚌埠市固镇县"
                        }
                    ]
                },
                {
                    "name": "淮南市",
                    "pId": "34",
                    "id": "3404",
                    "fullname": "安徽省淮南市",
                    "items": [
                        {
                            "name": "大通区",
                            "pId": "3404",
                            "id": "340402",
                            "fullname": "安徽省淮南市大通区"
                        },
                        {
                            "name": "田家庵区",
                            "pId": "3404",
                            "id": "340403",
                            "fullname": "安徽省淮南市田家庵区"
                        },
                        {
                            "name": "谢家集区",
                            "pId": "3404",
                            "id": "340404",
                            "fullname": "安徽省淮南市谢家集区"
                        },
                        {
                            "name": "八公山区",
                            "pId": "3404",
                            "id": "340405",
                            "fullname": "安徽省淮南市八公山区"
                        },
                        {
                            "name": "潘集区",
                            "pId": "3404",
                            "id": "340406",
                            "fullname": "安徽省淮南市潘集区"
                        },
                        {
                            "name": "凤台县",
                            "pId": "3404",
                            "id": "340421",
                            "fullname": "安徽省淮南市凤台县"
                        }
                    ]
                },
                {
                    "name": "马鞍山市",
                    "pId": "34",
                    "id": "3405",
                    "fullname": "安徽省马鞍山市",
                    "items": [
                        {
                            "name": "花山区",
                            "pId": "3405",
                            "id": "340503",
                            "fullname": "安徽省马鞍山市花山区"
                        },
                        {
                            "name": "雨山区",
                            "pId": "3405",
                            "id": "340504",
                            "fullname": "安徽省马鞍山市雨山区"
                        },
                        {
                            "name": "博望区",
                            "pId": "3405",
                            "id": "340506",
                            "fullname": "安徽省马鞍山市博望区"
                        },
                        {
                            "name": "当涂县",
                            "pId": "3405",
                            "id": "340521",
                            "fullname": "安徽省马鞍山市当涂县"
                        },
                        {
                            "name": "含山县",
                            "pId": "3405",
                            "id": "340522",
                            "fullname": "安徽省马鞍山市含山县"
                        },
                        {
                            "name": "和县",
                            "pId": "3405",
                            "id": "340523",
                            "fullname": "安徽省马鞍山市和县"
                        }
                    ]
                },
                {
                    "name": "淮北市",
                    "pId": "34",
                    "id": "3406",
                    "fullname": "安徽省淮北市",
                    "items": [
                        {
                            "name": "杜集区",
                            "pId": "3406",
                            "id": "340602",
                            "fullname": "安徽省淮北市杜集区"
                        },
                        {
                            "name": "相山区",
                            "pId": "3406",
                            "id": "340603",
                            "fullname": "安徽省淮北市相山区"
                        },
                        {
                            "name": "烈山区",
                            "pId": "3406",
                            "id": "340604",
                            "fullname": "安徽省淮北市烈山区"
                        },
                        {
                            "name": "濉溪县",
                            "pId": "3406",
                            "id": "340621",
                            "fullname": "安徽省淮北市濉溪县"
                        }
                    ]
                },
                {
                    "name": "铜陵市",
                    "pId": "34",
                    "id": "3407",
                    "fullname": "安徽省铜陵市",
                    "items": [
                        {
                            "name": "铜官山区",
                            "pId": "3407",
                            "id": "340702",
                            "fullname": "安徽省铜陵市铜官山区"
                        },
                        {
                            "name": "狮子山区",
                            "pId": "3407",
                            "id": "340703",
                            "fullname": "安徽省铜陵市狮子山区"
                        },
                        {
                            "name": "郊区",
                            "pId": "3407",
                            "id": "340711",
                            "fullname": "安徽省铜陵市郊区"
                        },
                        {
                            "name": "铜陵县",
                            "pId": "3407",
                            "id": "340721",
                            "fullname": "安徽省铜陵市铜陵县"
                        }
                    ]
                },
                {
                    "name": "安庆市",
                    "pId": "34",
                    "id": "3408",
                    "fullname": "安徽省安庆市",
                    "items": [
                        {
                            "name": "迎江区",
                            "pId": "3408",
                            "id": "340802",
                            "fullname": "安徽省安庆市迎江区"
                        },
                        {
                            "name": "大观区",
                            "pId": "3408",
                            "id": "340803",
                            "fullname": "安徽省安庆市大观区"
                        },
                        {
                            "name": "宜秀区",
                            "pId": "3408",
                            "id": "340811",
                            "fullname": "安徽省安庆市宜秀区"
                        },
                        {
                            "name": "怀宁县",
                            "pId": "3408",
                            "id": "340822",
                            "fullname": "安徽省安庆市怀宁县"
                        },
                        {
                            "name": "枞阳县",
                            "pId": "3408",
                            "id": "340823",
                            "fullname": "安徽省安庆市枞阳县"
                        },
                        {
                            "name": "潜山县",
                            "pId": "3408",
                            "id": "340824",
                            "fullname": "安徽省安庆市潜山县"
                        },
                        {
                            "name": "太湖县",
                            "pId": "3408",
                            "id": "340825",
                            "fullname": "安徽省安庆市太湖县"
                        },
                        {
                            "name": "宿松县",
                            "pId": "3408",
                            "id": "340826",
                            "fullname": "安徽省安庆市宿松县"
                        },
                        {
                            "name": "望江县",
                            "pId": "3408",
                            "id": "340827",
                            "fullname": "安徽省安庆市望江县"
                        },
                        {
                            "name": "岳西县",
                            "pId": "3408",
                            "id": "340828",
                            "fullname": "安徽省安庆市岳西县"
                        },
                        {
                            "name": "桐城市",
                            "pId": "3408",
                            "id": "340881",
                            "fullname": "安徽省安庆市桐城市"
                        }
                    ]
                },
                {
                    "name": "黄山市",
                    "pId": "34",
                    "id": "3410",
                    "fullname": "安徽省黄山市",
                    "items": [
                        {
                            "name": "屯溪区",
                            "pId": "3410",
                            "id": "341002",
                            "fullname": "安徽省黄山市屯溪区"
                        },
                        {
                            "name": "黄山区",
                            "pId": "3410",
                            "id": "341003",
                            "fullname": "安徽省黄山市黄山区"
                        },
                        {
                            "name": "徽州区",
                            "pId": "3410",
                            "id": "341004",
                            "fullname": "安徽省黄山市徽州区"
                        },
                        {
                            "name": "歙县",
                            "pId": "3410",
                            "id": "341021",
                            "fullname": "安徽省黄山市歙县"
                        },
                        {
                            "name": "休宁县",
                            "pId": "3410",
                            "id": "341022",
                            "fullname": "安徽省黄山市休宁县"
                        },
                        {
                            "name": "黟县",
                            "pId": "3410",
                            "id": "341023",
                            "fullname": "安徽省黄山市黟县"
                        },
                        {
                            "name": "祁门县",
                            "pId": "3410",
                            "id": "341024",
                            "fullname": "安徽省黄山市祁门县"
                        }
                    ]
                },
                {
                    "name": "滁州市",
                    "pId": "34",
                    "id": "3411",
                    "fullname": "安徽省滁州市",
                    "items": [
                        {
                            "name": "琅琊区",
                            "pId": "3411",
                            "id": "341102",
                            "fullname": "安徽省滁州市琅琊区"
                        },
                        {
                            "name": "南谯区",
                            "pId": "3411",
                            "id": "341103",
                            "fullname": "安徽省滁州市南谯区"
                        },
                        {
                            "name": "来安县",
                            "pId": "3411",
                            "id": "341122",
                            "fullname": "安徽省滁州市来安县"
                        },
                        {
                            "name": "全椒县",
                            "pId": "3411",
                            "id": "341124",
                            "fullname": "安徽省滁州市全椒县"
                        },
                        {
                            "name": "定远县",
                            "pId": "3411",
                            "id": "341125",
                            "fullname": "安徽省滁州市定远县"
                        },
                        {
                            "name": "凤阳县",
                            "pId": "3411",
                            "id": "341126",
                            "fullname": "安徽省滁州市凤阳县"
                        },
                        {
                            "name": "天长市",
                            "pId": "3411",
                            "id": "341181",
                            "fullname": "安徽省滁州市天长市"
                        },
                        {
                            "name": "明光市",
                            "pId": "3411",
                            "id": "341182",
                            "fullname": "安徽省滁州市明光市"
                        }
                    ]
                },
                {
                    "name": "阜阳市",
                    "pId": "34",
                    "id": "3412",
                    "fullname": "安徽省阜阳市",
                    "items": [
                        {
                            "name": "颍州区",
                            "pId": "3412",
                            "id": "341202",
                            "fullname": "安徽省阜阳市颍州区"
                        },
                        {
                            "name": "颍东区",
                            "pId": "3412",
                            "id": "341203",
                            "fullname": "安徽省阜阳市颍东区"
                        },
                        {
                            "name": "颍泉区",
                            "pId": "3412",
                            "id": "341204",
                            "fullname": "安徽省阜阳市颍泉区"
                        },
                        {
                            "name": "临泉县",
                            "pId": "3412",
                            "id": "341221",
                            "fullname": "安徽省阜阳市临泉县"
                        },
                        {
                            "name": "太和县",
                            "pId": "3412",
                            "id": "341222",
                            "fullname": "安徽省阜阳市太和县"
                        },
                        {
                            "name": "阜南县",
                            "pId": "3412",
                            "id": "341225",
                            "fullname": "安徽省阜阳市阜南县"
                        },
                        {
                            "name": "颍上县",
                            "pId": "3412",
                            "id": "341226",
                            "fullname": "安徽省阜阳市颍上县"
                        },
                        {
                            "name": "界首市",
                            "pId": "3412",
                            "id": "341282",
                            "fullname": "安徽省阜阳市界首市"
                        }
                    ]
                },
                {
                    "name": "宿州市",
                    "pId": "34",
                    "id": "3413",
                    "fullname": "安徽省宿州市",
                    "items": [
                        {
                            "name": "�桥区",
                            "pId": "3413",
                            "id": "341302",
                            "fullname": "安徽省宿州市�桥区"
                        },
                        {
                            "name": "砀山县",
                            "pId": "3413",
                            "id": "341321",
                            "fullname": "安徽省宿州市砀山县"
                        },
                        {
                            "name": "萧县",
                            "pId": "3413",
                            "id": "341322",
                            "fullname": "安徽省宿州市萧县"
                        },
                        {
                            "name": "灵璧县",
                            "pId": "3413",
                            "id": "341323",
                            "fullname": "安徽省宿州市灵璧县"
                        },
                        {
                            "name": "泗县",
                            "pId": "3413",
                            "id": "341324",
                            "fullname": "安徽省宿州市泗县"
                        }
                    ]
                },
                {
                    "name": "六安市",
                    "pId": "34",
                    "id": "3415",
                    "fullname": "安徽省六安市",
                    "items": [
                        {
                            "name": "金安区",
                            "pId": "3415",
                            "id": "341502",
                            "fullname": "安徽省六安市金安区"
                        },
                        {
                            "name": "裕安区",
                            "pId": "3415",
                            "id": "341503",
                            "fullname": "安徽省六安市裕安区"
                        },
                        {
                            "name": "寿县",
                            "pId": "3415",
                            "id": "341521",
                            "fullname": "安徽省六安市寿县"
                        },
                        {
                            "name": "霍邱县",
                            "pId": "3415",
                            "id": "341522",
                            "fullname": "安徽省六安市霍邱县"
                        },
                        {
                            "name": "舒城县",
                            "pId": "3415",
                            "id": "341523",
                            "fullname": "安徽省六安市舒城县"
                        },
                        {
                            "name": "金寨县",
                            "pId": "3415",
                            "id": "341524",
                            "fullname": "安徽省六安市金寨县"
                        },
                        {
                            "name": "霍山县",
                            "pId": "3415",
                            "id": "341525",
                            "fullname": "安徽省六安市霍山县"
                        }
                    ]
                },
                {
                    "name": "亳州市",
                    "pId": "34",
                    "id": "3416",
                    "fullname": "安徽省亳州市",
                    "items": [
                        {
                            "name": "谯城区",
                            "pId": "3416",
                            "id": "341602",
                            "fullname": "安徽省亳州市谯城区"
                        },
                        {
                            "name": "涡阳县",
                            "pId": "3416",
                            "id": "341621",
                            "fullname": "安徽省亳州市涡阳县"
                        },
                        {
                            "name": "蒙城县",
                            "pId": "3416",
                            "id": "341622",
                            "fullname": "安徽省亳州市蒙城县"
                        },
                        {
                            "name": "利辛县",
                            "pId": "3416",
                            "id": "341623",
                            "fullname": "安徽省亳州市利辛县"
                        }
                    ]
                },
                {
                    "name": "池州市",
                    "pId": "34",
                    "id": "3417",
                    "fullname": "安徽省池州市",
                    "items": [
                        {
                            "name": "贵池区",
                            "pId": "3417",
                            "id": "341702",
                            "fullname": "安徽省池州市贵池区"
                        },
                        {
                            "name": "东至县",
                            "pId": "3417",
                            "id": "341721",
                            "fullname": "安徽省池州市东至县"
                        },
                        {
                            "name": "石台县",
                            "pId": "3417",
                            "id": "341722",
                            "fullname": "安徽省池州市石台县"
                        },
                        {
                            "name": "青阳县",
                            "pId": "3417",
                            "id": "341723",
                            "fullname": "安徽省池州市青阳县"
                        }
                    ]
                },
                {
                    "name": "宣城市",
                    "pId": "34",
                    "id": "3418",
                    "fullname": "安徽省宣城市",
                    "items": [
                        {
                            "name": "宣州区",
                            "pId": "3418",
                            "id": "341802",
                            "fullname": "安徽省宣城市宣州区"
                        },
                        {
                            "name": "郎溪县",
                            "pId": "3418",
                            "id": "341821",
                            "fullname": "安徽省宣城市郎溪县"
                        },
                        {
                            "name": "广德县",
                            "pId": "3418",
                            "id": "341822",
                            "fullname": "安徽省宣城市广德县"
                        },
                        {
                            "name": "泾县",
                            "pId": "3418",
                            "id": "341823",
                            "fullname": "安徽省宣城市泾县"
                        },
                        {
                            "name": "绩溪县",
                            "pId": "3418",
                            "id": "341824",
                            "fullname": "安徽省宣城市绩溪县"
                        },
                        {
                            "name": "旌德县",
                            "pId": "3418",
                            "id": "341825",
                            "fullname": "安徽省宣城市旌德县"
                        },
                        {
                            "name": "宁国市",
                            "pId": "3418",
                            "id": "341881",
                            "fullname": "安徽省宣城市宁国市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "福建省",
            "pId": "1",
            "id": "35",
            "fullname": "福建省",
            "items": [
                {
                    "name": "福州市",
                    "pId": "35",
                    "id": "3501",
                    "fullname": "福建省福州市",
                    "items": [
                        {
                            "name": "鼓楼区",
                            "pId": "3501",
                            "id": "350102",
                            "fullname": "福建省福州市鼓楼区"
                        },
                        {
                            "name": "台江区",
                            "pId": "3501",
                            "id": "350103",
                            "fullname": "福建省福州市台江区"
                        },
                        {
                            "name": "仓山区",
                            "pId": "3501",
                            "id": "350104",
                            "fullname": "福建省福州市仓山区"
                        },
                        {
                            "name": "马尾区",
                            "pId": "3501",
                            "id": "350105",
                            "fullname": "福建省福州市马尾区"
                        },
                        {
                            "name": "晋安区",
                            "pId": "3501",
                            "id": "350111",
                            "fullname": "福建省福州市晋安区"
                        },
                        {
                            "name": "闽侯县",
                            "pId": "3501",
                            "id": "350121",
                            "fullname": "福建省福州市闽侯县"
                        },
                        {
                            "name": "连江县",
                            "pId": "3501",
                            "id": "350122",
                            "fullname": "福建省福州市连江县"
                        },
                        {
                            "name": "罗源县",
                            "pId": "3501",
                            "id": "350123",
                            "fullname": "福建省福州市罗源县"
                        },
                        {
                            "name": "闽清县",
                            "pId": "3501",
                            "id": "350124",
                            "fullname": "福建省福州市闽清县"
                        },
                        {
                            "name": "永泰县",
                            "pId": "3501",
                            "id": "350125",
                            "fullname": "福建省福州市永泰县"
                        },
                        {
                            "name": "平潭县",
                            "pId": "3501",
                            "id": "350128",
                            "fullname": "福建省福州市平潭县"
                        },
                        {
                            "name": "福清市",
                            "pId": "3501",
                            "id": "350181",
                            "fullname": "福建省福州市福清市"
                        },
                        {
                            "name": "长乐市",
                            "pId": "3501",
                            "id": "350182",
                            "fullname": "福建省福州市长乐市"
                        }
                    ]
                },
                {
                    "name": "厦门市",
                    "pId": "35",
                    "id": "3502",
                    "fullname": "福建省厦门市",
                    "items": [
                        {
                            "name": "思明区",
                            "pId": "3502",
                            "id": "350203",
                            "fullname": "福建省厦门市思明区"
                        },
                        {
                            "name": "海沧区",
                            "pId": "3502",
                            "id": "350205",
                            "fullname": "福建省厦门市海沧区"
                        },
                        {
                            "name": "湖里区",
                            "pId": "3502",
                            "id": "350206",
                            "fullname": "福建省厦门市湖里区"
                        },
                        {
                            "name": "集美区",
                            "pId": "3502",
                            "id": "350211",
                            "fullname": "福建省厦门市集美区"
                        },
                        {
                            "name": "同安区",
                            "pId": "3502",
                            "id": "350212",
                            "fullname": "福建省厦门市同安区"
                        },
                        {
                            "name": "翔安区",
                            "pId": "3502",
                            "id": "350213",
                            "fullname": "福建省厦门市翔安区"
                        }
                    ]
                },
                {
                    "name": "莆田市",
                    "pId": "35",
                    "id": "3503",
                    "fullname": "福建省莆田市",
                    "items": [
                        {
                            "name": "城厢区",
                            "pId": "3503",
                            "id": "350302",
                            "fullname": "福建省莆田市城厢区"
                        },
                        {
                            "name": "涵江区",
                            "pId": "3503",
                            "id": "350303",
                            "fullname": "福建省莆田市涵江区"
                        },
                        {
                            "name": "荔城区",
                            "pId": "3503",
                            "id": "350304",
                            "fullname": "福建省莆田市荔城区"
                        },
                        {
                            "name": "秀屿区",
                            "pId": "3503",
                            "id": "350305",
                            "fullname": "福建省莆田市秀屿区"
                        },
                        {
                            "name": "仙游县",
                            "pId": "3503",
                            "id": "350322",
                            "fullname": "福建省莆田市仙游县"
                        }
                    ]
                },
                {
                    "name": "三明市",
                    "pId": "35",
                    "id": "3504",
                    "fullname": "福建省三明市",
                    "items": [
                        {
                            "name": "梅列区",
                            "pId": "3504",
                            "id": "350402",
                            "fullname": "福建省三明市梅列区"
                        },
                        {
                            "name": "三元区",
                            "pId": "3504",
                            "id": "350403",
                            "fullname": "福建省三明市三元区"
                        },
                        {
                            "name": "明溪县",
                            "pId": "3504",
                            "id": "350421",
                            "fullname": "福建省三明市明溪县"
                        },
                        {
                            "name": "清流县",
                            "pId": "3504",
                            "id": "350423",
                            "fullname": "福建省三明市清流县"
                        },
                        {
                            "name": "宁化县",
                            "pId": "3504",
                            "id": "350424",
                            "fullname": "福建省三明市宁化县"
                        },
                        {
                            "name": "大田县",
                            "pId": "3504",
                            "id": "350425",
                            "fullname": "福建省三明市大田县"
                        },
                        {
                            "name": "尤溪县",
                            "pId": "3504",
                            "id": "350426",
                            "fullname": "福建省三明市尤溪县"
                        },
                        {
                            "name": "沙县",
                            "pId": "3504",
                            "id": "350427",
                            "fullname": "福建省三明市沙县"
                        },
                        {
                            "name": "将乐县",
                            "pId": "3504",
                            "id": "350428",
                            "fullname": "福建省三明市将乐县"
                        },
                        {
                            "name": "泰宁县",
                            "pId": "3504",
                            "id": "350429",
                            "fullname": "福建省三明市泰宁县"
                        },
                        {
                            "name": "建宁县",
                            "pId": "3504",
                            "id": "350430",
                            "fullname": "福建省三明市建宁县"
                        },
                        {
                            "name": "永安市",
                            "pId": "3504",
                            "id": "350481",
                            "fullname": "福建省三明市永安市"
                        }
                    ]
                },
                {
                    "name": "泉州市",
                    "pId": "35",
                    "id": "3505",
                    "fullname": "福建省泉州市",
                    "items": [
                        {
                            "name": "鲤城区",
                            "pId": "3505",
                            "id": "350502",
                            "fullname": "福建省泉州市鲤城区"
                        },
                        {
                            "name": "丰泽区",
                            "pId": "3505",
                            "id": "350503",
                            "fullname": "福建省泉州市丰泽区"
                        },
                        {
                            "name": "洛江区",
                            "pId": "3505",
                            "id": "350504",
                            "fullname": "福建省泉州市洛江区"
                        },
                        {
                            "name": "泉港区",
                            "pId": "3505",
                            "id": "350505",
                            "fullname": "福建省泉州市泉港区"
                        },
                        {
                            "name": "惠安县",
                            "pId": "3505",
                            "id": "350521",
                            "fullname": "福建省泉州市惠安县"
                        },
                        {
                            "name": "安溪县",
                            "pId": "3505",
                            "id": "350524",
                            "fullname": "福建省泉州市安溪县"
                        },
                        {
                            "name": "永春县",
                            "pId": "3505",
                            "id": "350525",
                            "fullname": "福建省泉州市永春县"
                        },
                        {
                            "name": "德化县",
                            "pId": "3505",
                            "id": "350526",
                            "fullname": "福建省泉州市德化县"
                        },
                        {
                            "name": "石狮市",
                            "pId": "3505",
                            "id": "350581",
                            "fullname": "福建省泉州市石狮市"
                        },
                        {
                            "name": "晋江市",
                            "pId": "3505",
                            "id": "350582",
                            "fullname": "福建省泉州市晋江市"
                        },
                        {
                            "name": "南安市",
                            "pId": "3505",
                            "id": "350583",
                            "fullname": "福建省泉州市南安市"
                        }
                    ]
                },
                {
                    "name": "漳州市",
                    "pId": "35",
                    "id": "3506",
                    "fullname": "福建省漳州市",
                    "items": [
                        {
                            "name": "芗城区",
                            "pId": "3506",
                            "id": "350602",
                            "fullname": "福建省漳州市芗城区"
                        },
                        {
                            "name": "龙文区",
                            "pId": "3506",
                            "id": "350603",
                            "fullname": "福建省漳州市龙文区"
                        },
                        {
                            "name": "云霄县",
                            "pId": "3506",
                            "id": "350622",
                            "fullname": "福建省漳州市云霄县"
                        },
                        {
                            "name": "漳浦县",
                            "pId": "3506",
                            "id": "350623",
                            "fullname": "福建省漳州市漳浦县"
                        },
                        {
                            "name": "诏安县",
                            "pId": "3506",
                            "id": "350624",
                            "fullname": "福建省漳州市诏安县"
                        },
                        {
                            "name": "长泰县",
                            "pId": "3506",
                            "id": "350625",
                            "fullname": "福建省漳州市长泰县"
                        },
                        {
                            "name": "东山县",
                            "pId": "3506",
                            "id": "350626",
                            "fullname": "福建省漳州市东山县"
                        },
                        {
                            "name": "南靖县",
                            "pId": "3506",
                            "id": "350627",
                            "fullname": "福建省漳州市南靖县"
                        },
                        {
                            "name": "平和县",
                            "pId": "3506",
                            "id": "350628",
                            "fullname": "福建省漳州市平和县"
                        },
                        {
                            "name": "华安县",
                            "pId": "3506",
                            "id": "350629",
                            "fullname": "福建省漳州市华安县"
                        },
                        {
                            "name": "龙海市",
                            "pId": "3506",
                            "id": "350681",
                            "fullname": "福建省漳州市龙海市"
                        }
                    ]
                },
                {
                    "name": "南平市",
                    "pId": "35",
                    "id": "3507",
                    "fullname": "福建省南平市",
                    "items": [
                        {
                            "name": "延平区",
                            "pId": "3507",
                            "id": "350702",
                            "fullname": "福建省南平市延平区"
                        },
                        {
                            "name": "顺昌县",
                            "pId": "3507",
                            "id": "350721",
                            "fullname": "福建省南平市顺昌县"
                        },
                        {
                            "name": "浦城县",
                            "pId": "3507",
                            "id": "350722",
                            "fullname": "福建省南平市浦城县"
                        },
                        {
                            "name": "光泽县",
                            "pId": "3507",
                            "id": "350723",
                            "fullname": "福建省南平市光泽县"
                        },
                        {
                            "name": "松溪县",
                            "pId": "3507",
                            "id": "350724",
                            "fullname": "福建省南平市松溪县"
                        },
                        {
                            "name": "政和县",
                            "pId": "3507",
                            "id": "350725",
                            "fullname": "福建省南平市政和县"
                        },
                        {
                            "name": "邵武市",
                            "pId": "3507",
                            "id": "350781",
                            "fullname": "福建省南平市邵武市"
                        },
                        {
                            "name": "武夷山市",
                            "pId": "3507",
                            "id": "350782",
                            "fullname": "福建省南平市武夷山市"
                        },
                        {
                            "name": "建瓯市",
                            "pId": "3507",
                            "id": "350783",
                            "fullname": "福建省南平市建瓯市"
                        },
                        {
                            "name": "建阳市",
                            "pId": "3507",
                            "id": "350784",
                            "fullname": "福建省南平市建阳市"
                        }
                    ]
                },
                {
                    "name": "龙岩市",
                    "pId": "35",
                    "id": "3508",
                    "fullname": "福建省龙岩市",
                    "items": [
                        {
                            "name": "新罗区",
                            "pId": "3508",
                            "id": "350802",
                            "fullname": "福建省龙岩市新罗区"
                        },
                        {
                            "name": "长汀县",
                            "pId": "3508",
                            "id": "350821",
                            "fullname": "福建省龙岩市长汀县"
                        },
                        {
                            "name": "永定县",
                            "pId": "3508",
                            "id": "350822",
                            "fullname": "福建省龙岩市永定县"
                        },
                        {
                            "name": "上杭县",
                            "pId": "3508",
                            "id": "350823",
                            "fullname": "福建省龙岩市上杭县"
                        },
                        {
                            "name": "武平县",
                            "pId": "3508",
                            "id": "350824",
                            "fullname": "福建省龙岩市武平县"
                        },
                        {
                            "name": "连城县",
                            "pId": "3508",
                            "id": "350825",
                            "fullname": "福建省龙岩市连城县"
                        },
                        {
                            "name": "漳平市",
                            "pId": "3508",
                            "id": "350881",
                            "fullname": "福建省龙岩市漳平市"
                        }
                    ]
                },
                {
                    "name": "宁德市",
                    "pId": "35",
                    "id": "3509",
                    "fullname": "福建省宁德市",
                    "items": [
                        {
                            "name": "蕉城区",
                            "pId": "3509",
                            "id": "350902",
                            "fullname": "福建省宁德市蕉城区"
                        },
                        {
                            "name": "霞浦县",
                            "pId": "3509",
                            "id": "350921",
                            "fullname": "福建省宁德市霞浦县"
                        },
                        {
                            "name": "古田县",
                            "pId": "3509",
                            "id": "350922",
                            "fullname": "福建省宁德市古田县"
                        },
                        {
                            "name": "屏南县",
                            "pId": "3509",
                            "id": "350923",
                            "fullname": "福建省宁德市屏南县"
                        },
                        {
                            "name": "寿宁县",
                            "pId": "3509",
                            "id": "350924",
                            "fullname": "福建省宁德市寿宁县"
                        },
                        {
                            "name": "周宁县",
                            "pId": "3509",
                            "id": "350925",
                            "fullname": "福建省宁德市周宁县"
                        },
                        {
                            "name": "柘荣县",
                            "pId": "3509",
                            "id": "350926",
                            "fullname": "福建省宁德市柘荣县"
                        },
                        {
                            "name": "福安市",
                            "pId": "3509",
                            "id": "350981",
                            "fullname": "福建省宁德市福安市"
                        },
                        {
                            "name": "福鼎市",
                            "pId": "3509",
                            "id": "350982",
                            "fullname": "福建省宁德市福鼎市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "江西省",
            "pId": "1",
            "id": "36",
            "fullname": "江西省",
            "items": [
                {
                    "name": "南昌市",
                    "pId": "36",
                    "id": "3601",
                    "fullname": "江西省南昌市",
                    "items": [
                        {
                            "name": "东湖区",
                            "pId": "3601",
                            "id": "360102",
                            "fullname": "江西省南昌市东湖区"
                        },
                        {
                            "name": "西湖区",
                            "pId": "3601",
                            "id": "360103",
                            "fullname": "江西省南昌市西湖区"
                        },
                        {
                            "name": "青云谱区",
                            "pId": "3601",
                            "id": "360104",
                            "fullname": "江西省南昌市青云谱区"
                        },
                        {
                            "name": "湾里区",
                            "pId": "3601",
                            "id": "360105",
                            "fullname": "江西省南昌市湾里区"
                        },
                        {
                            "name": "青山湖区",
                            "pId": "3601",
                            "id": "360111",
                            "fullname": "江西省南昌市青山湖区"
                        },
                        {
                            "name": "南昌县",
                            "pId": "3601",
                            "id": "360121",
                            "fullname": "江西省南昌市南昌县"
                        },
                        {
                            "name": "新建县",
                            "pId": "3601",
                            "id": "360122",
                            "fullname": "江西省南昌市新建县"
                        },
                        {
                            "name": "安义县",
                            "pId": "3601",
                            "id": "360123",
                            "fullname": "江西省南昌市安义县"
                        },
                        {
                            "name": "进贤县",
                            "pId": "3601",
                            "id": "360124",
                            "fullname": "江西省南昌市进贤县"
                        }
                    ]
                },
                {
                    "name": "景德镇市",
                    "pId": "36",
                    "id": "3602",
                    "fullname": "江西省景德镇市",
                    "items": [
                        {
                            "name": "昌江区",
                            "pId": "3602",
                            "id": "360202",
                            "fullname": "江西省景德镇市昌江区"
                        },
                        {
                            "name": "珠山区",
                            "pId": "3602",
                            "id": "360203",
                            "fullname": "江西省景德镇市珠山区"
                        },
                        {
                            "name": "浮梁县",
                            "pId": "3602",
                            "id": "360222",
                            "fullname": "江西省景德镇市浮梁县"
                        },
                        {
                            "name": "乐平市",
                            "pId": "3602",
                            "id": "360281",
                            "fullname": "江西省景德镇市乐平市"
                        }
                    ]
                },
                {
                    "name": "萍乡市",
                    "pId": "36",
                    "id": "3603",
                    "fullname": "江西省萍乡市",
                    "items": [
                        {
                            "name": "安源区",
                            "pId": "3603",
                            "id": "360302",
                            "fullname": "江西省萍乡市安源区"
                        },
                        {
                            "name": "湘东区",
                            "pId": "3603",
                            "id": "360313",
                            "fullname": "江西省萍乡市湘东区"
                        },
                        {
                            "name": "莲花县",
                            "pId": "3603",
                            "id": "360321",
                            "fullname": "江西省萍乡市莲花县"
                        },
                        {
                            "name": "上栗县",
                            "pId": "3603",
                            "id": "360322",
                            "fullname": "江西省萍乡市上栗县"
                        },
                        {
                            "name": "芦溪县",
                            "pId": "3603",
                            "id": "360323",
                            "fullname": "江西省萍乡市芦溪县"
                        }
                    ]
                },
                {
                    "name": "九江市",
                    "pId": "36",
                    "id": "3604",
                    "fullname": "江西省九江市",
                    "items": [
                        {
                            "name": "庐山区",
                            "pId": "3604",
                            "id": "360402",
                            "fullname": "江西省九江市庐山区"
                        },
                        {
                            "name": "浔阳区",
                            "pId": "3604",
                            "id": "360403",
                            "fullname": "江西省九江市浔阳区"
                        },
                        {
                            "name": "九江县",
                            "pId": "3604",
                            "id": "360421",
                            "fullname": "江西省九江市九江县"
                        },
                        {
                            "name": "武宁县",
                            "pId": "3604",
                            "id": "360423",
                            "fullname": "江西省九江市武宁县"
                        },
                        {
                            "name": "修水县",
                            "pId": "3604",
                            "id": "360424",
                            "fullname": "江西省九江市修水县"
                        },
                        {
                            "name": "永修县",
                            "pId": "3604",
                            "id": "360425",
                            "fullname": "江西省九江市永修县"
                        },
                        {
                            "name": "德安县",
                            "pId": "3604",
                            "id": "360426",
                            "fullname": "江西省九江市德安县"
                        },
                        {
                            "name": "星子县",
                            "pId": "3604",
                            "id": "360427",
                            "fullname": "江西省九江市星子县"
                        },
                        {
                            "name": "都昌县",
                            "pId": "3604",
                            "id": "360428",
                            "fullname": "江西省九江市都昌县"
                        },
                        {
                            "name": "湖口县",
                            "pId": "3604",
                            "id": "360429",
                            "fullname": "江西省九江市湖口县"
                        },
                        {
                            "name": "彭泽县",
                            "pId": "3604",
                            "id": "360430",
                            "fullname": "江西省九江市彭泽县"
                        },
                        {
                            "name": "瑞昌市",
                            "pId": "3604",
                            "id": "360481",
                            "fullname": "江西省九江市瑞昌市"
                        },
                        {
                            "name": "共青城市",
                            "pId": "3604",
                            "id": "360482",
                            "fullname": "江西省九江市共青城市"
                        }
                    ]
                },
                {
                    "name": "新余市",
                    "pId": "36",
                    "id": "3605",
                    "fullname": "江西省新余市",
                    "items": [
                        {
                            "name": "渝水区",
                            "pId": "3605",
                            "id": "360502",
                            "fullname": "江西省新余市渝水区"
                        },
                        {
                            "name": "分宜县",
                            "pId": "3605",
                            "id": "360521",
                            "fullname": "江西省新余市分宜县"
                        }
                    ]
                },
                {
                    "name": "鹰潭市",
                    "pId": "36",
                    "id": "3606",
                    "fullname": "江西省鹰潭市",
                    "items": [
                        {
                            "name": "月湖区",
                            "pId": "3606",
                            "id": "360602",
                            "fullname": "江西省鹰潭市月湖区"
                        },
                        {
                            "name": "余江县",
                            "pId": "3606",
                            "id": "360622",
                            "fullname": "江西省鹰潭市余江县"
                        },
                        {
                            "name": "贵溪市",
                            "pId": "3606",
                            "id": "360681",
                            "fullname": "江西省鹰潭市贵溪市"
                        }
                    ]
                },
                {
                    "name": "赣州市",
                    "pId": "36",
                    "id": "3607",
                    "fullname": "江西省赣州市",
                    "items": [
                        {
                            "name": "章贡区",
                            "pId": "3607",
                            "id": "360702",
                            "fullname": "江西省赣州市章贡区"
                        },
                        {
                            "name": "赣县",
                            "pId": "3607",
                            "id": "360721",
                            "fullname": "江西省赣州市赣县"
                        },
                        {
                            "name": "信丰县",
                            "pId": "3607",
                            "id": "360722",
                            "fullname": "江西省赣州市信丰县"
                        },
                        {
                            "name": "大余县",
                            "pId": "3607",
                            "id": "360723",
                            "fullname": "江西省赣州市大余县"
                        },
                        {
                            "name": "上犹县",
                            "pId": "3607",
                            "id": "360724",
                            "fullname": "江西省赣州市上犹县"
                        },
                        {
                            "name": "崇义县",
                            "pId": "3607",
                            "id": "360725",
                            "fullname": "江西省赣州市崇义县"
                        },
                        {
                            "name": "安远县",
                            "pId": "3607",
                            "id": "360726",
                            "fullname": "江西省赣州市安远县"
                        },
                        {
                            "name": "龙南县",
                            "pId": "3607",
                            "id": "360727",
                            "fullname": "江西省赣州市龙南县"
                        },
                        {
                            "name": "定南县",
                            "pId": "3607",
                            "id": "360728",
                            "fullname": "江西省赣州市定南县"
                        },
                        {
                            "name": "全南县",
                            "pId": "3607",
                            "id": "360729",
                            "fullname": "江西省赣州市全南县"
                        },
                        {
                            "name": "宁都县",
                            "pId": "3607",
                            "id": "360730",
                            "fullname": "江西省赣州市宁都县"
                        },
                        {
                            "name": "于都县",
                            "pId": "3607",
                            "id": "360731",
                            "fullname": "江西省赣州市于都县"
                        },
                        {
                            "name": "兴国县",
                            "pId": "3607",
                            "id": "360732",
                            "fullname": "江西省赣州市兴国县"
                        },
                        {
                            "name": "会昌县",
                            "pId": "3607",
                            "id": "360733",
                            "fullname": "江西省赣州市会昌县"
                        },
                        {
                            "name": "寻乌县",
                            "pId": "3607",
                            "id": "360734",
                            "fullname": "江西省赣州市寻乌县"
                        },
                        {
                            "name": "石城县",
                            "pId": "3607",
                            "id": "360735",
                            "fullname": "江西省赣州市石城县"
                        },
                        {
                            "name": "瑞金市",
                            "pId": "3607",
                            "id": "360781",
                            "fullname": "江西省赣州市瑞金市"
                        },
                        {
                            "name": "南康市",
                            "pId": "3607",
                            "id": "360782",
                            "fullname": "江西省赣州市南康市"
                        }
                    ]
                },
                {
                    "name": "吉安市",
                    "pId": "36",
                    "id": "3608",
                    "fullname": "江西省吉安市",
                    "items": [
                        {
                            "name": "吉州区",
                            "pId": "3608",
                            "id": "360802",
                            "fullname": "江西省吉安市吉州区"
                        },
                        {
                            "name": "青原区",
                            "pId": "3608",
                            "id": "360803",
                            "fullname": "江西省吉安市青原区"
                        },
                        {
                            "name": "吉安县",
                            "pId": "3608",
                            "id": "360821",
                            "fullname": "江西省吉安市吉安县"
                        },
                        {
                            "name": "吉水县",
                            "pId": "3608",
                            "id": "360822",
                            "fullname": "江西省吉安市吉水县"
                        },
                        {
                            "name": "峡江县",
                            "pId": "3608",
                            "id": "360823",
                            "fullname": "江西省吉安市峡江县"
                        },
                        {
                            "name": "新干县",
                            "pId": "3608",
                            "id": "360824",
                            "fullname": "江西省吉安市新干县"
                        },
                        {
                            "name": "永丰县",
                            "pId": "3608",
                            "id": "360825",
                            "fullname": "江西省吉安市永丰县"
                        },
                        {
                            "name": "泰和县",
                            "pId": "3608",
                            "id": "360826",
                            "fullname": "江西省吉安市泰和县"
                        },
                        {
                            "name": "遂川县",
                            "pId": "3608",
                            "id": "360827",
                            "fullname": "江西省吉安市遂川县"
                        },
                        {
                            "name": "万安县",
                            "pId": "3608",
                            "id": "360828",
                            "fullname": "江西省吉安市万安县"
                        },
                        {
                            "name": "安福县",
                            "pId": "3608",
                            "id": "360829",
                            "fullname": "江西省吉安市安福县"
                        },
                        {
                            "name": "永新县",
                            "pId": "3608",
                            "id": "360830",
                            "fullname": "江西省吉安市永新县"
                        },
                        {
                            "name": "井冈山市",
                            "pId": "3608",
                            "id": "360881",
                            "fullname": "江西省吉安市井冈山市"
                        }
                    ]
                },
                {
                    "name": "宜春市",
                    "pId": "36",
                    "id": "3609",
                    "fullname": "江西省宜春市",
                    "items": [
                        {
                            "name": "袁州区",
                            "pId": "3609",
                            "id": "360902",
                            "fullname": "江西省宜春市袁州区"
                        },
                        {
                            "name": "奉新县",
                            "pId": "3609",
                            "id": "360921",
                            "fullname": "江西省宜春市奉新县"
                        },
                        {
                            "name": "万载县",
                            "pId": "3609",
                            "id": "360922",
                            "fullname": "江西省宜春市万载县"
                        },
                        {
                            "name": "上高县",
                            "pId": "3609",
                            "id": "360923",
                            "fullname": "江西省宜春市上高县"
                        },
                        {
                            "name": "宜丰县",
                            "pId": "3609",
                            "id": "360924",
                            "fullname": "江西省宜春市宜丰县"
                        },
                        {
                            "name": "靖安县",
                            "pId": "3609",
                            "id": "360925",
                            "fullname": "江西省宜春市靖安县"
                        },
                        {
                            "name": "铜鼓县",
                            "pId": "3609",
                            "id": "360926",
                            "fullname": "江西省宜春市铜鼓县"
                        },
                        {
                            "name": "丰城市",
                            "pId": "3609",
                            "id": "360981",
                            "fullname": "江西省宜春市丰城市"
                        },
                        {
                            "name": "樟树市",
                            "pId": "3609",
                            "id": "360982",
                            "fullname": "江西省宜春市樟树市"
                        },
                        {
                            "name": "高安市",
                            "pId": "3609",
                            "id": "360983",
                            "fullname": "江西省宜春市高安市"
                        }
                    ]
                },
                {
                    "name": "抚州市",
                    "pId": "36",
                    "id": "3610",
                    "fullname": "江西省抚州市",
                    "items": [
                        {
                            "name": "临川区",
                            "pId": "3610",
                            "id": "361002",
                            "fullname": "江西省抚州市临川区"
                        },
                        {
                            "name": "南城县",
                            "pId": "3610",
                            "id": "361021",
                            "fullname": "江西省抚州市南城县"
                        },
                        {
                            "name": "黎川县",
                            "pId": "3610",
                            "id": "361022",
                            "fullname": "江西省抚州市黎川县"
                        },
                        {
                            "name": "南丰县",
                            "pId": "3610",
                            "id": "361023",
                            "fullname": "江西省抚州市南丰县"
                        },
                        {
                            "name": "崇仁县",
                            "pId": "3610",
                            "id": "361024",
                            "fullname": "江西省抚州市崇仁县"
                        },
                        {
                            "name": "乐安县",
                            "pId": "3610",
                            "id": "361025",
                            "fullname": "江西省抚州市乐安县"
                        },
                        {
                            "name": "宜黄县",
                            "pId": "3610",
                            "id": "361026",
                            "fullname": "江西省抚州市宜黄县"
                        },
                        {
                            "name": "金溪县",
                            "pId": "3610",
                            "id": "361027",
                            "fullname": "江西省抚州市金溪县"
                        },
                        {
                            "name": "资溪县",
                            "pId": "3610",
                            "id": "361028",
                            "fullname": "江西省抚州市资溪县"
                        },
                        {
                            "name": "东乡县",
                            "pId": "3610",
                            "id": "361029",
                            "fullname": "江西省抚州市东乡县"
                        },
                        {
                            "name": "广昌县",
                            "pId": "3610",
                            "id": "361030",
                            "fullname": "江西省抚州市广昌县"
                        }
                    ]
                },
                {
                    "name": "上饶市",
                    "pId": "36",
                    "id": "3611",
                    "fullname": "江西省上饶市",
                    "items": [
                        {
                            "name": "信州区",
                            "pId": "3611",
                            "id": "361102",
                            "fullname": "江西省上饶市信州区"
                        },
                        {
                            "name": "上饶县",
                            "pId": "3611",
                            "id": "361121",
                            "fullname": "江西省上饶市上饶县"
                        },
                        {
                            "name": "广丰县",
                            "pId": "3611",
                            "id": "361122",
                            "fullname": "江西省上饶市广丰县"
                        },
                        {
                            "name": "玉山县",
                            "pId": "3611",
                            "id": "361123",
                            "fullname": "江西省上饶市玉山县"
                        },
                        {
                            "name": "铅山县",
                            "pId": "3611",
                            "id": "361124",
                            "fullname": "江西省上饶市铅山县"
                        },
                        {
                            "name": "横峰县",
                            "pId": "3611",
                            "id": "361125",
                            "fullname": "江西省上饶市横峰县"
                        },
                        {
                            "name": "弋阳县",
                            "pId": "3611",
                            "id": "361126",
                            "fullname": "江西省上饶市弋阳县"
                        },
                        {
                            "name": "余干县",
                            "pId": "3611",
                            "id": "361127",
                            "fullname": "江西省上饶市余干县"
                        },
                        {
                            "name": "鄱阳县",
                            "pId": "3611",
                            "id": "361128",
                            "fullname": "江西省上饶市鄱阳县"
                        },
                        {
                            "name": "万年县",
                            "pId": "3611",
                            "id": "361129",
                            "fullname": "江西省上饶市万年县"
                        },
                        {
                            "name": "婺源县",
                            "pId": "3611",
                            "id": "361130",
                            "fullname": "江西省上饶市婺源县"
                        },
                        {
                            "name": "德兴市",
                            "pId": "3611",
                            "id": "361181",
                            "fullname": "江西省上饶市德兴市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "山东省",
            "pId": "1",
            "id": "37",
            "fullname": "山东省",
            "items": [
                {
                    "name": "济南市",
                    "pId": "37",
                    "id": "3701",
                    "fullname": "山东省济南市",
                    "items": [
                        {
                            "name": "历下区",
                            "pId": "3701",
                            "id": "370102",
                            "fullname": "山东省济南市历下区"
                        },
                        {
                            "name": "市中区",
                            "pId": "3701",
                            "id": "370103",
                            "fullname": "山东省济南市市中区"
                        },
                        {
                            "name": "槐荫区",
                            "pId": "3701",
                            "id": "370104",
                            "fullname": "山东省济南市槐荫区"
                        },
                        {
                            "name": "天桥区",
                            "pId": "3701",
                            "id": "370105",
                            "fullname": "山东省济南市天桥区"
                        },
                        {
                            "name": "历城区",
                            "pId": "3701",
                            "id": "370112",
                            "fullname": "山东省济南市历城区"
                        },
                        {
                            "name": "长清区",
                            "pId": "3701",
                            "id": "370113",
                            "fullname": "山东省济南市长清区"
                        },
                        {
                            "name": "平阴县",
                            "pId": "3701",
                            "id": "370124",
                            "fullname": "山东省济南市平阴县"
                        },
                        {
                            "name": "济阳县",
                            "pId": "3701",
                            "id": "370125",
                            "fullname": "山东省济南市济阳县"
                        },
                        {
                            "name": "商河县",
                            "pId": "3701",
                            "id": "370126",
                            "fullname": "山东省济南市商河县"
                        },
                        {
                            "name": "章丘市",
                            "pId": "3701",
                            "id": "370181",
                            "fullname": "山东省济南市章丘市"
                        }
                    ]
                },
                {
                    "name": "青岛市",
                    "pId": "37",
                    "id": "3702",
                    "fullname": "山东省青岛市",
                    "items": [
                        {
                            "name": "市南区",
                            "pId": "3702",
                            "id": "370202",
                            "fullname": "山东省青岛市市南区"
                        },
                        {
                            "name": "市北区",
                            "pId": "3702",
                            "id": "370203",
                            "fullname": "山东省青岛市市北区"
                        },
                        {
                            "name": "黄岛区",
                            "pId": "3702",
                            "id": "370211",
                            "fullname": "山东省青岛市黄岛区"
                        },
                        {
                            "name": "崂山区",
                            "pId": "3702",
                            "id": "370212",
                            "fullname": "山东省青岛市崂山区"
                        },
                        {
                            "name": "李沧区",
                            "pId": "3702",
                            "id": "370213",
                            "fullname": "山东省青岛市李沧区"
                        },
                        {
                            "name": "城阳区",
                            "pId": "3702",
                            "id": "370214",
                            "fullname": "山东省青岛市城阳区"
                        },
                        {
                            "name": "胶州市",
                            "pId": "3702",
                            "id": "370281",
                            "fullname": "山东省青岛市胶州市"
                        },
                        {
                            "name": "即墨市",
                            "pId": "3702",
                            "id": "370282",
                            "fullname": "山东省青岛市即墨市"
                        },
                        {
                            "name": "平度市",
                            "pId": "3702",
                            "id": "370283",
                            "fullname": "山东省青岛市平度市"
                        },
                        {
                            "name": "莱西市",
                            "pId": "3702",
                            "id": "370285",
                            "fullname": "山东省青岛市莱西市"
                        }
                    ]
                },
                {
                    "name": "淄博市",
                    "pId": "37",
                    "id": "3703",
                    "fullname": "山东省淄博市",
                    "items": [
                        {
                            "name": "淄川区",
                            "pId": "3703",
                            "id": "370302",
                            "fullname": "山东省淄博市淄川区"
                        },
                        {
                            "name": "张店区",
                            "pId": "3703",
                            "id": "370303",
                            "fullname": "山东省淄博市张店区"
                        },
                        {
                            "name": "博山区",
                            "pId": "3703",
                            "id": "370304",
                            "fullname": "山东省淄博市博山区"
                        },
                        {
                            "name": "临淄区",
                            "pId": "3703",
                            "id": "370305",
                            "fullname": "山东省淄博市临淄区"
                        },
                        {
                            "name": "周村区",
                            "pId": "3703",
                            "id": "370306",
                            "fullname": "山东省淄博市周村区"
                        },
                        {
                            "name": "桓台县",
                            "pId": "3703",
                            "id": "370321",
                            "fullname": "山东省淄博市桓台县"
                        },
                        {
                            "name": "高青县",
                            "pId": "3703",
                            "id": "370322",
                            "fullname": "山东省淄博市高青县"
                        },
                        {
                            "name": "沂源县",
                            "pId": "3703",
                            "id": "370323",
                            "fullname": "山东省淄博市沂源县"
                        }
                    ]
                },
                {
                    "name": "枣庄市",
                    "pId": "37",
                    "id": "3704",
                    "fullname": "山东省枣庄市",
                    "items": [
                        {
                            "name": "市中区",
                            "pId": "3704",
                            "id": "370402",
                            "fullname": "山东省枣庄市市中区"
                        },
                        {
                            "name": "薛城区",
                            "pId": "3704",
                            "id": "370403",
                            "fullname": "山东省枣庄市薛城区"
                        },
                        {
                            "name": "峄城区",
                            "pId": "3704",
                            "id": "370404",
                            "fullname": "山东省枣庄市峄城区"
                        },
                        {
                            "name": "台儿庄区",
                            "pId": "3704",
                            "id": "370405",
                            "fullname": "山东省枣庄市台儿庄区"
                        },
                        {
                            "name": "山亭区",
                            "pId": "3704",
                            "id": "370406",
                            "fullname": "山东省枣庄市山亭区"
                        },
                        {
                            "name": "滕州市",
                            "pId": "3704",
                            "id": "370481",
                            "fullname": "山东省枣庄市滕州市"
                        }
                    ]
                },
                {
                    "name": "东营市",
                    "pId": "37",
                    "id": "3705",
                    "fullname": "山东省东营市",
                    "items": [
                        {
                            "name": "东营区",
                            "pId": "3705",
                            "id": "370502",
                            "fullname": "山东省东营市东营区"
                        },
                        {
                            "name": "河口区",
                            "pId": "3705",
                            "id": "370503",
                            "fullname": "山东省东营市河口区"
                        },
                        {
                            "name": "垦利县",
                            "pId": "3705",
                            "id": "370521",
                            "fullname": "山东省东营市垦利县"
                        },
                        {
                            "name": "利津县",
                            "pId": "3705",
                            "id": "370522",
                            "fullname": "山东省东营市利津县"
                        },
                        {
                            "name": "广饶县",
                            "pId": "3705",
                            "id": "370523",
                            "fullname": "山东省东营市广饶县"
                        }
                    ]
                },
                {
                    "name": "烟台市",
                    "pId": "37",
                    "id": "3706",
                    "fullname": "山东省烟台市",
                    "items": [
                        {
                            "name": "芝罘区",
                            "pId": "3706",
                            "id": "370602",
                            "fullname": "山东省烟台市芝罘区"
                        },
                        {
                            "name": "福山区",
                            "pId": "3706",
                            "id": "370611",
                            "fullname": "山东省烟台市福山区"
                        },
                        {
                            "name": "牟平区",
                            "pId": "3706",
                            "id": "370612",
                            "fullname": "山东省烟台市牟平区"
                        },
                        {
                            "name": "莱山区",
                            "pId": "3706",
                            "id": "370613",
                            "fullname": "山东省烟台市莱山区"
                        },
                        {
                            "name": "长岛县",
                            "pId": "3706",
                            "id": "370634",
                            "fullname": "山东省烟台市长岛县"
                        },
                        {
                            "name": "龙口市",
                            "pId": "3706",
                            "id": "370681",
                            "fullname": "山东省烟台市龙口市"
                        },
                        {
                            "name": "莱阳市",
                            "pId": "3706",
                            "id": "370682",
                            "fullname": "山东省烟台市莱阳市"
                        },
                        {
                            "name": "莱州市",
                            "pId": "3706",
                            "id": "370683",
                            "fullname": "山东省烟台市莱州市"
                        },
                        {
                            "name": "蓬莱市",
                            "pId": "3706",
                            "id": "370684",
                            "fullname": "山东省烟台市蓬莱市"
                        },
                        {
                            "name": "招远市",
                            "pId": "3706",
                            "id": "370685",
                            "fullname": "山东省烟台市招远市"
                        },
                        {
                            "name": "栖霞市",
                            "pId": "3706",
                            "id": "370686",
                            "fullname": "山东省烟台市栖霞市"
                        },
                        {
                            "name": "海阳市",
                            "pId": "3706",
                            "id": "370687",
                            "fullname": "山东省烟台市海阳市"
                        }
                    ]
                },
                {
                    "name": "潍坊市",
                    "pId": "37",
                    "id": "3707",
                    "fullname": "山东省潍坊市",
                    "items": [
                        {
                            "name": "潍城区",
                            "pId": "3707",
                            "id": "370702",
                            "fullname": "山东省潍坊市潍城区"
                        },
                        {
                            "name": "寒亭区",
                            "pId": "3707",
                            "id": "370703",
                            "fullname": "山东省潍坊市寒亭区"
                        },
                        {
                            "name": "坊子区",
                            "pId": "3707",
                            "id": "370704",
                            "fullname": "山东省潍坊市坊子区"
                        },
                        {
                            "name": "奎文区",
                            "pId": "3707",
                            "id": "370705",
                            "fullname": "山东省潍坊市奎文区"
                        },
                        {
                            "name": "临朐县",
                            "pId": "3707",
                            "id": "370724",
                            "fullname": "山东省潍坊市临朐县"
                        },
                        {
                            "name": "昌乐县",
                            "pId": "3707",
                            "id": "370725",
                            "fullname": "山东省潍坊市昌乐县"
                        },
                        {
                            "name": "青州市",
                            "pId": "3707",
                            "id": "370781",
                            "fullname": "山东省潍坊市青州市"
                        },
                        {
                            "name": "诸城市",
                            "pId": "3707",
                            "id": "370782",
                            "fullname": "山东省潍坊市诸城市"
                        },
                        {
                            "name": "寿光市",
                            "pId": "3707",
                            "id": "370783",
                            "fullname": "山东省潍坊市寿光市"
                        },
                        {
                            "name": "安丘市",
                            "pId": "3707",
                            "id": "370784",
                            "fullname": "山东省潍坊市安丘市"
                        },
                        {
                            "name": "高密市",
                            "pId": "3707",
                            "id": "370785",
                            "fullname": "山东省潍坊市高密市"
                        },
                        {
                            "name": "昌邑市",
                            "pId": "3707",
                            "id": "370786",
                            "fullname": "山东省潍坊市昌邑市"
                        }
                    ]
                },
                {
                    "name": "济宁市",
                    "pId": "37",
                    "id": "3708",
                    "fullname": "山东省济宁市",
                    "items": [
                        {
                            "name": "市中区",
                            "pId": "3708",
                            "id": "370802",
                            "fullname": "山东省济宁市市中区"
                        },
                        {
                            "name": "任城区",
                            "pId": "3708",
                            "id": "370811",
                            "fullname": "山东省济宁市任城区"
                        },
                        {
                            "name": "微山县",
                            "pId": "3708",
                            "id": "370826",
                            "fullname": "山东省济宁市微山县"
                        },
                        {
                            "name": "鱼台县",
                            "pId": "3708",
                            "id": "370827",
                            "fullname": "山东省济宁市鱼台县"
                        },
                        {
                            "name": "金乡县",
                            "pId": "3708",
                            "id": "370828",
                            "fullname": "山东省济宁市金乡县"
                        },
                        {
                            "name": "嘉祥县",
                            "pId": "3708",
                            "id": "370829",
                            "fullname": "山东省济宁市嘉祥县"
                        },
                        {
                            "name": "汶上县",
                            "pId": "3708",
                            "id": "370830",
                            "fullname": "山东省济宁市汶上县"
                        },
                        {
                            "name": "泗水县",
                            "pId": "3708",
                            "id": "370831",
                            "fullname": "山东省济宁市泗水县"
                        },
                        {
                            "name": "梁山县",
                            "pId": "3708",
                            "id": "370832",
                            "fullname": "山东省济宁市梁山县"
                        },
                        {
                            "name": "曲阜市",
                            "pId": "3708",
                            "id": "370881",
                            "fullname": "山东省济宁市曲阜市"
                        },
                        {
                            "name": "兖州市",
                            "pId": "3708",
                            "id": "370882",
                            "fullname": "山东省济宁市兖州市"
                        },
                        {
                            "name": "邹城市",
                            "pId": "3708",
                            "id": "370883",
                            "fullname": "山东省济宁市邹城市"
                        }
                    ]
                },
                {
                    "name": "泰安市",
                    "pId": "37",
                    "id": "3709",
                    "fullname": "山东省泰安市",
                    "items": [
                        {
                            "name": "泰山区",
                            "pId": "3709",
                            "id": "370902",
                            "fullname": "山东省泰安市泰山区"
                        },
                        {
                            "name": "岱岳区",
                            "pId": "3709",
                            "id": "370911",
                            "fullname": "山东省泰安市岱岳区"
                        },
                        {
                            "name": "宁阳县",
                            "pId": "3709",
                            "id": "370921",
                            "fullname": "山东省泰安市宁阳县"
                        },
                        {
                            "name": "东平县",
                            "pId": "3709",
                            "id": "370923",
                            "fullname": "山东省泰安市东平县"
                        },
                        {
                            "name": "新泰市",
                            "pId": "3709",
                            "id": "370982",
                            "fullname": "山东省泰安市新泰市"
                        },
                        {
                            "name": "肥城市",
                            "pId": "3709",
                            "id": "370983",
                            "fullname": "山东省泰安市肥城市"
                        }
                    ]
                },
                {
                    "name": "威海市",
                    "pId": "37",
                    "id": "3710",
                    "fullname": "山东省威海市",
                    "items": [
                        {
                            "name": "环翠区",
                            "pId": "3710",
                            "id": "371002",
                            "fullname": "山东省威海市环翠区"
                        },
                        {
                            "name": "文登市",
                            "pId": "3710",
                            "id": "371081",
                            "fullname": "山东省威海市文登市"
                        },
                        {
                            "name": "荣成市",
                            "pId": "3710",
                            "id": "371082",
                            "fullname": "山东省威海市荣成市"
                        },
                        {
                            "name": "乳山市",
                            "pId": "3710",
                            "id": "371083",
                            "fullname": "山东省威海市乳山市"
                        }
                    ]
                },
                {
                    "name": "日照市",
                    "pId": "37",
                    "id": "3711",
                    "fullname": "山东省日照市",
                    "items": [
                        {
                            "name": "东港区",
                            "pId": "3711",
                            "id": "371102",
                            "fullname": "山东省日照市东港区"
                        },
                        {
                            "name": "岚山区",
                            "pId": "3711",
                            "id": "371103",
                            "fullname": "山东省日照市岚山区"
                        },
                        {
                            "name": "五莲县",
                            "pId": "3711",
                            "id": "371121",
                            "fullname": "山东省日照市五莲县"
                        },
                        {
                            "name": "莒县",
                            "pId": "3711",
                            "id": "371122",
                            "fullname": "山东省日照市莒县"
                        }
                    ]
                },
                {
                    "name": "莱芜市",
                    "pId": "37",
                    "id": "3712",
                    "fullname": "山东省莱芜市",
                    "items": [
                        {
                            "name": "莱城区",
                            "pId": "3712",
                            "id": "371202",
                            "fullname": "山东省莱芜市莱城区"
                        },
                        {
                            "name": "钢城区",
                            "pId": "3712",
                            "id": "371203",
                            "fullname": "山东省莱芜市钢城区"
                        }
                    ]
                },
                {
                    "name": "临沂市",
                    "pId": "37",
                    "id": "3713",
                    "fullname": "山东省临沂市",
                    "items": [
                        {
                            "name": "兰山区",
                            "pId": "3713",
                            "id": "371302",
                            "fullname": "山东省临沂市兰山区"
                        },
                        {
                            "name": "罗庄区",
                            "pId": "3713",
                            "id": "371311",
                            "fullname": "山东省临沂市罗庄区"
                        },
                        {
                            "name": "河东区",
                            "pId": "3713",
                            "id": "371312",
                            "fullname": "山东省临沂市河东区"
                        },
                        {
                            "name": "沂南县",
                            "pId": "3713",
                            "id": "371321",
                            "fullname": "山东省临沂市沂南县"
                        },
                        {
                            "name": "郯城县",
                            "pId": "3713",
                            "id": "371322",
                            "fullname": "山东省临沂市郯城县"
                        },
                        {
                            "name": "沂水县",
                            "pId": "3713",
                            "id": "371323",
                            "fullname": "山东省临沂市沂水县"
                        },
                        {
                            "name": "苍山县",
                            "pId": "3713",
                            "id": "371324",
                            "fullname": "山东省临沂市苍山县"
                        },
                        {
                            "name": "费县",
                            "pId": "3713",
                            "id": "371325",
                            "fullname": "山东省临沂市费县"
                        },
                        {
                            "name": "平邑县",
                            "pId": "3713",
                            "id": "371326",
                            "fullname": "山东省临沂市平邑县"
                        },
                        {
                            "name": "莒南县",
                            "pId": "3713",
                            "id": "371327",
                            "fullname": "山东省临沂市莒南县"
                        },
                        {
                            "name": "蒙阴县",
                            "pId": "3713",
                            "id": "371328",
                            "fullname": "山东省临沂市蒙阴县"
                        },
                        {
                            "name": "临沭县",
                            "pId": "3713",
                            "id": "371329",
                            "fullname": "山东省临沂市临沭县"
                        }
                    ]
                },
                {
                    "name": "德州市",
                    "pId": "37",
                    "id": "3714",
                    "fullname": "山东省德州市",
                    "items": [
                        {
                            "name": "德城区",
                            "pId": "3714",
                            "id": "371402",
                            "fullname": "山东省德州市德城区"
                        },
                        {
                            "name": "陵县",
                            "pId": "3714",
                            "id": "371421",
                            "fullname": "山东省德州市陵县"
                        },
                        {
                            "name": "宁津县",
                            "pId": "3714",
                            "id": "371422",
                            "fullname": "山东省德州市宁津县"
                        },
                        {
                            "name": "庆云县",
                            "pId": "3714",
                            "id": "371423",
                            "fullname": "山东省德州市庆云县"
                        },
                        {
                            "name": "临邑县",
                            "pId": "3714",
                            "id": "371424",
                            "fullname": "山东省德州市临邑县"
                        },
                        {
                            "name": "齐河县",
                            "pId": "3714",
                            "id": "371425",
                            "fullname": "山东省德州市齐河县"
                        },
                        {
                            "name": "平原县",
                            "pId": "3714",
                            "id": "371426",
                            "fullname": "山东省德州市平原县"
                        },
                        {
                            "name": "夏津县",
                            "pId": "3714",
                            "id": "371427",
                            "fullname": "山东省德州市夏津县"
                        },
                        {
                            "name": "武城县",
                            "pId": "3714",
                            "id": "371428",
                            "fullname": "山东省德州市武城县"
                        },
                        {
                            "name": "乐陵市",
                            "pId": "3714",
                            "id": "371481",
                            "fullname": "山东省德州市乐陵市"
                        },
                        {
                            "name": "禹城市",
                            "pId": "3714",
                            "id": "371482",
                            "fullname": "山东省德州市禹城市"
                        }
                    ]
                },
                {
                    "name": "聊城市",
                    "pId": "37",
                    "id": "3715",
                    "fullname": "山东省聊城市",
                    "items": [
                        {
                            "name": "东昌府区",
                            "pId": "3715",
                            "id": "371502",
                            "fullname": "山东省聊城市东昌府区"
                        },
                        {
                            "name": "阳谷县",
                            "pId": "3715",
                            "id": "371521",
                            "fullname": "山东省聊城市阳谷县"
                        },
                        {
                            "name": "莘县",
                            "pId": "3715",
                            "id": "371522",
                            "fullname": "山东省聊城市莘县"
                        },
                        {
                            "name": "茌平县",
                            "pId": "3715",
                            "id": "371523",
                            "fullname": "山东省聊城市茌平县"
                        },
                        {
                            "name": "东阿县",
                            "pId": "3715",
                            "id": "371524",
                            "fullname": "山东省聊城市东阿县"
                        },
                        {
                            "name": "冠县",
                            "pId": "3715",
                            "id": "371525",
                            "fullname": "山东省聊城市冠县"
                        },
                        {
                            "name": "高唐县",
                            "pId": "3715",
                            "id": "371526",
                            "fullname": "山东省聊城市高唐县"
                        },
                        {
                            "name": "临清市",
                            "pId": "3715",
                            "id": "371581",
                            "fullname": "山东省聊城市临清市"
                        }
                    ]
                },
                {
                    "name": "滨州市",
                    "pId": "37",
                    "id": "3716",
                    "fullname": "山东省滨州市",
                    "items": [
                        {
                            "name": "滨城区",
                            "pId": "3716",
                            "id": "371602",
                            "fullname": "山东省滨州市滨城区"
                        },
                        {
                            "name": "惠民县",
                            "pId": "3716",
                            "id": "371621",
                            "fullname": "山东省滨州市惠民县"
                        },
                        {
                            "name": "阳信县",
                            "pId": "3716",
                            "id": "371622",
                            "fullname": "山东省滨州市阳信县"
                        },
                        {
                            "name": "无棣县",
                            "pId": "3716",
                            "id": "371623",
                            "fullname": "山东省滨州市无棣县"
                        },
                        {
                            "name": "沾化县",
                            "pId": "3716",
                            "id": "371624",
                            "fullname": "山东省滨州市沾化县"
                        },
                        {
                            "name": "博兴县",
                            "pId": "3716",
                            "id": "371625",
                            "fullname": "山东省滨州市博兴县"
                        },
                        {
                            "name": "邹平县",
                            "pId": "3716",
                            "id": "371626",
                            "fullname": "山东省滨州市邹平县"
                        }
                    ]
                },
                {
                    "name": "菏泽市",
                    "pId": "37",
                    "id": "3717",
                    "fullname": "山东省菏泽市",
                    "items": [
                        {
                            "name": "牡丹区",
                            "pId": "3717",
                            "id": "371702",
                            "fullname": "山东省菏泽市牡丹区"
                        },
                        {
                            "name": "曹县",
                            "pId": "3717",
                            "id": "371721",
                            "fullname": "山东省菏泽市曹县"
                        },
                        {
                            "name": "单县",
                            "pId": "3717",
                            "id": "371722",
                            "fullname": "山东省菏泽市单县"
                        },
                        {
                            "name": "成武县",
                            "pId": "3717",
                            "id": "371723",
                            "fullname": "山东省菏泽市成武县"
                        },
                        {
                            "name": "巨野县",
                            "pId": "3717",
                            "id": "371724",
                            "fullname": "山东省菏泽市巨野县"
                        },
                        {
                            "name": "郓城县",
                            "pId": "3717",
                            "id": "371725",
                            "fullname": "山东省菏泽市郓城县"
                        },
                        {
                            "name": "鄄城县",
                            "pId": "3717",
                            "id": "371726",
                            "fullname": "山东省菏泽市鄄城县"
                        },
                        {
                            "name": "定陶县",
                            "pId": "3717",
                            "id": "371727",
                            "fullname": "山东省菏泽市定陶县"
                        },
                        {
                            "name": "东明县",
                            "pId": "3717",
                            "id": "371728",
                            "fullname": "山东省菏泽市东明县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "河南省",
            "pId": "1",
            "id": "41",
            "fullname": "河南省",
            "items": [
                {
                    "name": "郑州市",
                    "pId": "41",
                    "id": "4101",
                    "fullname": "河南省郑州市",
                    "items": [
                        {
                            "name": "中原区",
                            "pId": "4101",
                            "id": "410102",
                            "fullname": "河南省郑州市中原区"
                        },
                        {
                            "name": "二七区",
                            "pId": "4101",
                            "id": "410103",
                            "fullname": "河南省郑州市二七区"
                        },
                        {
                            "name": "管城回族区",
                            "pId": "4101",
                            "id": "410104",
                            "fullname": "河南省郑州市管城回族区"
                        },
                        {
                            "name": "金水区",
                            "pId": "4101",
                            "id": "410105",
                            "fullname": "河南省郑州市金水区"
                        },
                        {
                            "name": "上街区",
                            "pId": "4101",
                            "id": "410106",
                            "fullname": "河南省郑州市上街区"
                        },
                        {
                            "name": "惠济区",
                            "pId": "4101",
                            "id": "410108",
                            "fullname": "河南省郑州市惠济区"
                        },
                        {
                            "name": "中牟县",
                            "pId": "4101",
                            "id": "410122",
                            "fullname": "河南省郑州市中牟县"
                        },
                        {
                            "name": "巩义市",
                            "pId": "4101",
                            "id": "410181",
                            "fullname": "河南省郑州市巩义市"
                        },
                        {
                            "name": "荥阳市",
                            "pId": "4101",
                            "id": "410182",
                            "fullname": "河南省郑州市荥阳市"
                        },
                        {
                            "name": "新密市",
                            "pId": "4101",
                            "id": "410183",
                            "fullname": "河南省郑州市新密市"
                        },
                        {
                            "name": "新郑市",
                            "pId": "4101",
                            "id": "410184",
                            "fullname": "河南省郑州市新郑市"
                        },
                        {
                            "name": "登封市",
                            "pId": "4101",
                            "id": "410185",
                            "fullname": "河南省郑州市登封市"
                        }
                    ]
                },
                {
                    "name": "开封市",
                    "pId": "41",
                    "id": "4102",
                    "fullname": "河南省开封市",
                    "items": [
                        {
                            "name": "龙亭区",
                            "pId": "4102",
                            "id": "410202",
                            "fullname": "河南省开封市龙亭区"
                        },
                        {
                            "name": "顺河回族区",
                            "pId": "4102",
                            "id": "410203",
                            "fullname": "河南省开封市顺河回族区"
                        },
                        {
                            "name": "鼓楼区",
                            "pId": "4102",
                            "id": "410204",
                            "fullname": "河南省开封市鼓楼区"
                        },
                        {
                            "name": "禹王台区",
                            "pId": "4102",
                            "id": "410205",
                            "fullname": "河南省开封市禹王台区"
                        },
                        {
                            "name": "金明区",
                            "pId": "4102",
                            "id": "410211",
                            "fullname": "河南省开封市金明区"
                        },
                        {
                            "name": "杞县",
                            "pId": "4102",
                            "id": "410221",
                            "fullname": "河南省开封市杞县"
                        },
                        {
                            "name": "通许县",
                            "pId": "4102",
                            "id": "410222",
                            "fullname": "河南省开封市通许县"
                        },
                        {
                            "name": "尉氏县",
                            "pId": "4102",
                            "id": "410223",
                            "fullname": "河南省开封市尉氏县"
                        },
                        {
                            "name": "开封县",
                            "pId": "4102",
                            "id": "410224",
                            "fullname": "河南省开封市开封县"
                        },
                        {
                            "name": "兰考县",
                            "pId": "4102",
                            "id": "410225",
                            "fullname": "河南省开封市兰考县"
                        }
                    ]
                },
                {
                    "name": "洛阳市",
                    "pId": "41",
                    "id": "4103",
                    "fullname": "河南省洛阳市",
                    "items": [
                        {
                            "name": "老城区",
                            "pId": "4103",
                            "id": "410302",
                            "fullname": "河南省洛阳市老城区"
                        },
                        {
                            "name": "西工区",
                            "pId": "4103",
                            "id": "410303",
                            "fullname": "河南省洛阳市西工区"
                        },
                        {
                            "name": "�河回族区",
                            "pId": "4103",
                            "id": "410304",
                            "fullname": "河南省洛阳市�河回族区"
                        },
                        {
                            "name": "涧西区",
                            "pId": "4103",
                            "id": "410305",
                            "fullname": "河南省洛阳市涧西区"
                        },
                        {
                            "name": "吉利区",
                            "pId": "4103",
                            "id": "410306",
                            "fullname": "河南省洛阳市吉利区"
                        },
                        {
                            "name": "洛龙区",
                            "pId": "4103",
                            "id": "410311",
                            "fullname": "河南省洛阳市洛龙区"
                        },
                        {
                            "name": "孟津县",
                            "pId": "4103",
                            "id": "410322",
                            "fullname": "河南省洛阳市孟津县"
                        },
                        {
                            "name": "新安县",
                            "pId": "4103",
                            "id": "410323",
                            "fullname": "河南省洛阳市新安县"
                        },
                        {
                            "name": "栾川县",
                            "pId": "4103",
                            "id": "410324",
                            "fullname": "河南省洛阳市栾川县"
                        },
                        {
                            "name": "嵩县",
                            "pId": "4103",
                            "id": "410325",
                            "fullname": "河南省洛阳市嵩县"
                        },
                        {
                            "name": "汝阳县",
                            "pId": "4103",
                            "id": "410326",
                            "fullname": "河南省洛阳市汝阳县"
                        },
                        {
                            "name": "宜阳县",
                            "pId": "4103",
                            "id": "410327",
                            "fullname": "河南省洛阳市宜阳县"
                        },
                        {
                            "name": "洛宁县",
                            "pId": "4103",
                            "id": "410328",
                            "fullname": "河南省洛阳市洛宁县"
                        },
                        {
                            "name": "伊川县",
                            "pId": "4103",
                            "id": "410329",
                            "fullname": "河南省洛阳市伊川县"
                        },
                        {
                            "name": "偃师市",
                            "pId": "4103",
                            "id": "410381",
                            "fullname": "河南省洛阳市偃师市"
                        }
                    ]
                },
                {
                    "name": "平顶山市",
                    "pId": "41",
                    "id": "4104",
                    "fullname": "河南省平顶山市",
                    "items": [
                        {
                            "name": "新华区",
                            "pId": "4104",
                            "id": "410402",
                            "fullname": "河南省平顶山市新华区"
                        },
                        {
                            "name": "卫东区",
                            "pId": "4104",
                            "id": "410403",
                            "fullname": "河南省平顶山市卫东区"
                        },
                        {
                            "name": "石龙区",
                            "pId": "4104",
                            "id": "410404",
                            "fullname": "河南省平顶山市石龙区"
                        },
                        {
                            "name": "湛河区",
                            "pId": "4104",
                            "id": "410411",
                            "fullname": "河南省平顶山市湛河区"
                        },
                        {
                            "name": "宝丰县",
                            "pId": "4104",
                            "id": "410421",
                            "fullname": "河南省平顶山市宝丰县"
                        },
                        {
                            "name": "叶县",
                            "pId": "4104",
                            "id": "410422",
                            "fullname": "河南省平顶山市叶县"
                        },
                        {
                            "name": "鲁山县",
                            "pId": "4104",
                            "id": "410423",
                            "fullname": "河南省平顶山市鲁山县"
                        },
                        {
                            "name": "郏县",
                            "pId": "4104",
                            "id": "410425",
                            "fullname": "河南省平顶山市郏县"
                        },
                        {
                            "name": "舞钢市",
                            "pId": "4104",
                            "id": "410481",
                            "fullname": "河南省平顶山市舞钢市"
                        },
                        {
                            "name": "汝州市",
                            "pId": "4104",
                            "id": "410482",
                            "fullname": "河南省平顶山市汝州市"
                        }
                    ]
                },
                {
                    "name": "安阳市",
                    "pId": "41",
                    "id": "4105",
                    "fullname": "河南省安阳市",
                    "items": [
                        {
                            "name": "文峰区",
                            "pId": "4105",
                            "id": "410502",
                            "fullname": "河南省安阳市文峰区"
                        },
                        {
                            "name": "北关区",
                            "pId": "4105",
                            "id": "410503",
                            "fullname": "河南省安阳市北关区"
                        },
                        {
                            "name": "殷都区",
                            "pId": "4105",
                            "id": "410505",
                            "fullname": "河南省安阳市殷都区"
                        },
                        {
                            "name": "龙安区",
                            "pId": "4105",
                            "id": "410506",
                            "fullname": "河南省安阳市龙安区"
                        },
                        {
                            "name": "安阳县",
                            "pId": "4105",
                            "id": "410522",
                            "fullname": "河南省安阳市安阳县"
                        },
                        {
                            "name": "汤阴县",
                            "pId": "4105",
                            "id": "410523",
                            "fullname": "河南省安阳市汤阴县"
                        },
                        {
                            "name": "滑县",
                            "pId": "4105",
                            "id": "410526",
                            "fullname": "河南省安阳市滑县"
                        },
                        {
                            "name": "内黄县",
                            "pId": "4105",
                            "id": "410527",
                            "fullname": "河南省安阳市内黄县"
                        },
                        {
                            "name": "林州市",
                            "pId": "4105",
                            "id": "410581",
                            "fullname": "河南省安阳市林州市"
                        }
                    ]
                },
                {
                    "name": "鹤壁市",
                    "pId": "41",
                    "id": "4106",
                    "fullname": "河南省鹤壁市",
                    "items": [
                        {
                            "name": "鹤山区",
                            "pId": "4106",
                            "id": "410602",
                            "fullname": "河南省鹤壁市鹤山区"
                        },
                        {
                            "name": "山城区",
                            "pId": "4106",
                            "id": "410603",
                            "fullname": "河南省鹤壁市山城区"
                        },
                        {
                            "name": "淇滨区",
                            "pId": "4106",
                            "id": "410611",
                            "fullname": "河南省鹤壁市淇滨区"
                        },
                        {
                            "name": "浚县",
                            "pId": "4106",
                            "id": "410621",
                            "fullname": "河南省鹤壁市浚县"
                        },
                        {
                            "name": "淇县",
                            "pId": "4106",
                            "id": "410622",
                            "fullname": "河南省鹤壁市淇县"
                        }
                    ]
                },
                {
                    "name": "新乡市",
                    "pId": "41",
                    "id": "4107",
                    "fullname": "河南省新乡市",
                    "items": [
                        {
                            "name": "红旗区",
                            "pId": "4107",
                            "id": "410702",
                            "fullname": "河南省新乡市红旗区"
                        },
                        {
                            "name": "卫滨区",
                            "pId": "4107",
                            "id": "410703",
                            "fullname": "河南省新乡市卫滨区"
                        },
                        {
                            "name": "凤泉区",
                            "pId": "4107",
                            "id": "410704",
                            "fullname": "河南省新乡市凤泉区"
                        },
                        {
                            "name": "牧野区",
                            "pId": "4107",
                            "id": "410711",
                            "fullname": "河南省新乡市牧野区"
                        },
                        {
                            "name": "新乡县",
                            "pId": "4107",
                            "id": "410721",
                            "fullname": "河南省新乡市新乡县"
                        },
                        {
                            "name": "获嘉县",
                            "pId": "4107",
                            "id": "410724",
                            "fullname": "河南省新乡市获嘉县"
                        },
                        {
                            "name": "原阳县",
                            "pId": "4107",
                            "id": "410725",
                            "fullname": "河南省新乡市原阳县"
                        },
                        {
                            "name": "延津县",
                            "pId": "4107",
                            "id": "410726",
                            "fullname": "河南省新乡市延津县"
                        },
                        {
                            "name": "封丘县",
                            "pId": "4107",
                            "id": "410727",
                            "fullname": "河南省新乡市封丘县"
                        },
                        {
                            "name": "长垣县",
                            "pId": "4107",
                            "id": "410728",
                            "fullname": "河南省新乡市长垣县"
                        },
                        {
                            "name": "卫辉市",
                            "pId": "4107",
                            "id": "410781",
                            "fullname": "河南省新乡市卫辉市"
                        },
                        {
                            "name": "辉县市",
                            "pId": "4107",
                            "id": "410782",
                            "fullname": "河南省新乡市辉县市"
                        }
                    ]
                },
                {
                    "name": "焦作市",
                    "pId": "41",
                    "id": "4108",
                    "fullname": "河南省焦作市",
                    "items": [
                        {
                            "name": "解放区",
                            "pId": "4108",
                            "id": "410802",
                            "fullname": "河南省焦作市解放区"
                        },
                        {
                            "name": "中站区",
                            "pId": "4108",
                            "id": "410803",
                            "fullname": "河南省焦作市中站区"
                        },
                        {
                            "name": "马村区",
                            "pId": "4108",
                            "id": "410804",
                            "fullname": "河南省焦作市马村区"
                        },
                        {
                            "name": "山阳区",
                            "pId": "4108",
                            "id": "410811",
                            "fullname": "河南省焦作市山阳区"
                        },
                        {
                            "name": "修武县",
                            "pId": "4108",
                            "id": "410821",
                            "fullname": "河南省焦作市修武县"
                        },
                        {
                            "name": "博爱县",
                            "pId": "4108",
                            "id": "410822",
                            "fullname": "河南省焦作市博爱县"
                        },
                        {
                            "name": "武陟县",
                            "pId": "4108",
                            "id": "410823",
                            "fullname": "河南省焦作市武陟县"
                        },
                        {
                            "name": "温县",
                            "pId": "4108",
                            "id": "410825",
                            "fullname": "河南省焦作市温县"
                        },
                        {
                            "name": "沁阳市",
                            "pId": "4108",
                            "id": "410882",
                            "fullname": "河南省焦作市沁阳市"
                        },
                        {
                            "name": "孟州市",
                            "pId": "4108",
                            "id": "410883",
                            "fullname": "河南省焦作市孟州市"
                        }
                    ]
                },
                {
                    "name": "濮阳市",
                    "pId": "41",
                    "id": "4109",
                    "fullname": "河南省濮阳市",
                    "items": [
                        {
                            "name": "华龙区",
                            "pId": "4109",
                            "id": "410902",
                            "fullname": "河南省濮阳市华龙区"
                        },
                        {
                            "name": "清丰县",
                            "pId": "4109",
                            "id": "410922",
                            "fullname": "河南省濮阳市清丰县"
                        },
                        {
                            "name": "南乐县",
                            "pId": "4109",
                            "id": "410923",
                            "fullname": "河南省濮阳市南乐县"
                        },
                        {
                            "name": "范县",
                            "pId": "4109",
                            "id": "410926",
                            "fullname": "河南省濮阳市范县"
                        },
                        {
                            "name": "台前县",
                            "pId": "4109",
                            "id": "410927",
                            "fullname": "河南省濮阳市台前县"
                        },
                        {
                            "name": "濮阳县",
                            "pId": "4109",
                            "id": "410928",
                            "fullname": "河南省濮阳市濮阳县"
                        }
                    ]
                },
                {
                    "name": "许昌市",
                    "pId": "41",
                    "id": "4110",
                    "fullname": "河南省许昌市",
                    "items": [
                        {
                            "name": "魏都区",
                            "pId": "4110",
                            "id": "411002",
                            "fullname": "河南省许昌市魏都区"
                        },
                        {
                            "name": "许昌县",
                            "pId": "4110",
                            "id": "411023",
                            "fullname": "河南省许昌市许昌县"
                        },
                        {
                            "name": "鄢陵县",
                            "pId": "4110",
                            "id": "411024",
                            "fullname": "河南省许昌市鄢陵县"
                        },
                        {
                            "name": "襄城县",
                            "pId": "4110",
                            "id": "411025",
                            "fullname": "河南省许昌市襄城县"
                        },
                        {
                            "name": "禹州市",
                            "pId": "4110",
                            "id": "411081",
                            "fullname": "河南省许昌市禹州市"
                        },
                        {
                            "name": "长葛市",
                            "pId": "4110",
                            "id": "411082",
                            "fullname": "河南省许昌市长葛市"
                        }
                    ]
                },
                {
                    "name": "漯河市",
                    "pId": "41",
                    "id": "4111",
                    "fullname": "河南省漯河市",
                    "items": [
                        {
                            "name": "源汇区",
                            "pId": "4111",
                            "id": "411102",
                            "fullname": "河南省漯河市源汇区"
                        },
                        {
                            "name": "郾城区",
                            "pId": "4111",
                            "id": "411103",
                            "fullname": "河南省漯河市郾城区"
                        },
                        {
                            "name": "召陵区",
                            "pId": "4111",
                            "id": "411104",
                            "fullname": "河南省漯河市召陵区"
                        },
                        {
                            "name": "舞阳县",
                            "pId": "4111",
                            "id": "411121",
                            "fullname": "河南省漯河市舞阳县"
                        },
                        {
                            "name": "临颍县",
                            "pId": "4111",
                            "id": "411122",
                            "fullname": "河南省漯河市临颍县"
                        }
                    ]
                },
                {
                    "name": "三门峡市",
                    "pId": "41",
                    "id": "4112",
                    "fullname": "河南省三门峡市",
                    "items": [
                        {
                            "name": "湖滨区",
                            "pId": "4112",
                            "id": "411202",
                            "fullname": "河南省三门峡市湖滨区"
                        },
                        {
                            "name": "渑池县",
                            "pId": "4112",
                            "id": "411221",
                            "fullname": "河南省三门峡市渑池县"
                        },
                        {
                            "name": "陕县",
                            "pId": "4112",
                            "id": "411222",
                            "fullname": "河南省三门峡市陕县"
                        },
                        {
                            "name": "卢氏县",
                            "pId": "4112",
                            "id": "411224",
                            "fullname": "河南省三门峡市卢氏县"
                        },
                        {
                            "name": "义马市",
                            "pId": "4112",
                            "id": "411281",
                            "fullname": "河南省三门峡市义马市"
                        },
                        {
                            "name": "灵宝市",
                            "pId": "4112",
                            "id": "411282",
                            "fullname": "河南省三门峡市灵宝市"
                        }
                    ]
                },
                {
                    "name": "南阳市",
                    "pId": "41",
                    "id": "4113",
                    "fullname": "河南省南阳市",
                    "items": [
                        {
                            "name": "宛城区",
                            "pId": "4113",
                            "id": "411302",
                            "fullname": "河南省南阳市宛城区"
                        },
                        {
                            "name": "卧龙区",
                            "pId": "4113",
                            "id": "411303",
                            "fullname": "河南省南阳市卧龙区"
                        },
                        {
                            "name": "南召县",
                            "pId": "4113",
                            "id": "411321",
                            "fullname": "河南省南阳市南召县"
                        },
                        {
                            "name": "方城县",
                            "pId": "4113",
                            "id": "411322",
                            "fullname": "河南省南阳市方城县"
                        },
                        {
                            "name": "西峡县",
                            "pId": "4113",
                            "id": "411323",
                            "fullname": "河南省南阳市西峡县"
                        },
                        {
                            "name": "镇平县",
                            "pId": "4113",
                            "id": "411324",
                            "fullname": "河南省南阳市镇平县"
                        },
                        {
                            "name": "内乡县",
                            "pId": "4113",
                            "id": "411325",
                            "fullname": "河南省南阳市内乡县"
                        },
                        {
                            "name": "淅川县",
                            "pId": "4113",
                            "id": "411326",
                            "fullname": "河南省南阳市淅川县"
                        },
                        {
                            "name": "社旗县",
                            "pId": "4113",
                            "id": "411327",
                            "fullname": "河南省南阳市社旗县"
                        },
                        {
                            "name": "唐河县",
                            "pId": "4113",
                            "id": "411328",
                            "fullname": "河南省南阳市唐河县"
                        },
                        {
                            "name": "新野县",
                            "pId": "4113",
                            "id": "411329",
                            "fullname": "河南省南阳市新野县"
                        },
                        {
                            "name": "桐柏县",
                            "pId": "4113",
                            "id": "411330",
                            "fullname": "河南省南阳市桐柏县"
                        },
                        {
                            "name": "邓州市",
                            "pId": "4113",
                            "id": "411381",
                            "fullname": "河南省南阳市邓州市"
                        }
                    ]
                },
                {
                    "name": "商丘市",
                    "pId": "41",
                    "id": "4114",
                    "fullname": "河南省商丘市",
                    "items": [
                        {
                            "name": "梁园区",
                            "pId": "4114",
                            "id": "411402",
                            "fullname": "河南省商丘市梁园区"
                        },
                        {
                            "name": "睢阳区",
                            "pId": "4114",
                            "id": "411403",
                            "fullname": "河南省商丘市睢阳区"
                        },
                        {
                            "name": "民权县",
                            "pId": "4114",
                            "id": "411421",
                            "fullname": "河南省商丘市民权县"
                        },
                        {
                            "name": "睢县",
                            "pId": "4114",
                            "id": "411422",
                            "fullname": "河南省商丘市睢县"
                        },
                        {
                            "name": "宁陵县",
                            "pId": "4114",
                            "id": "411423",
                            "fullname": "河南省商丘市宁陵县"
                        },
                        {
                            "name": "柘城县",
                            "pId": "4114",
                            "id": "411424",
                            "fullname": "河南省商丘市柘城县"
                        },
                        {
                            "name": "虞城县",
                            "pId": "4114",
                            "id": "411425",
                            "fullname": "河南省商丘市虞城县"
                        },
                        {
                            "name": "夏邑县",
                            "pId": "4114",
                            "id": "411426",
                            "fullname": "河南省商丘市夏邑县"
                        },
                        {
                            "name": "永城市",
                            "pId": "4114",
                            "id": "411481",
                            "fullname": "河南省商丘市永城市"
                        }
                    ]
                },
                {
                    "name": "信阳市",
                    "pId": "41",
                    "id": "4115",
                    "fullname": "河南省信阳市",
                    "items": [
                        {
                            "name": "�河区",
                            "pId": "4115",
                            "id": "411502",
                            "fullname": "河南省信阳市�河区"
                        },
                        {
                            "name": "平桥区",
                            "pId": "4115",
                            "id": "411503",
                            "fullname": "河南省信阳市平桥区"
                        },
                        {
                            "name": "罗山县",
                            "pId": "4115",
                            "id": "411521",
                            "fullname": "河南省信阳市罗山县"
                        },
                        {
                            "name": "光山县",
                            "pId": "4115",
                            "id": "411522",
                            "fullname": "河南省信阳市光山县"
                        },
                        {
                            "name": "新县",
                            "pId": "4115",
                            "id": "411523",
                            "fullname": "河南省信阳市新县"
                        },
                        {
                            "name": "商城县",
                            "pId": "4115",
                            "id": "411524",
                            "fullname": "河南省信阳市商城县"
                        },
                        {
                            "name": "固始县",
                            "pId": "4115",
                            "id": "411525",
                            "fullname": "河南省信阳市固始县"
                        },
                        {
                            "name": "潢川县",
                            "pId": "4115",
                            "id": "411526",
                            "fullname": "河南省信阳市潢川县"
                        },
                        {
                            "name": "淮滨县",
                            "pId": "4115",
                            "id": "411527",
                            "fullname": "河南省信阳市淮滨县"
                        },
                        {
                            "name": "息县",
                            "pId": "4115",
                            "id": "411528",
                            "fullname": "河南省信阳市息县"
                        }
                    ]
                },
                {
                    "name": "周口市",
                    "pId": "41",
                    "id": "4116",
                    "fullname": "河南省周口市",
                    "items": [
                        {
                            "name": "川汇区",
                            "pId": "4116",
                            "id": "411602",
                            "fullname": "河南省周口市川汇区"
                        },
                        {
                            "name": "扶沟县",
                            "pId": "4116",
                            "id": "411621",
                            "fullname": "河南省周口市扶沟县"
                        },
                        {
                            "name": "西华县",
                            "pId": "4116",
                            "id": "411622",
                            "fullname": "河南省周口市西华县"
                        },
                        {
                            "name": "商水县",
                            "pId": "4116",
                            "id": "411623",
                            "fullname": "河南省周口市商水县"
                        },
                        {
                            "name": "沈丘县",
                            "pId": "4116",
                            "id": "411624",
                            "fullname": "河南省周口市沈丘县"
                        },
                        {
                            "name": "郸城县",
                            "pId": "4116",
                            "id": "411625",
                            "fullname": "河南省周口市郸城县"
                        },
                        {
                            "name": "淮阳县",
                            "pId": "4116",
                            "id": "411626",
                            "fullname": "河南省周口市淮阳县"
                        },
                        {
                            "name": "太康县",
                            "pId": "4116",
                            "id": "411627",
                            "fullname": "河南省周口市太康县"
                        },
                        {
                            "name": "鹿邑县",
                            "pId": "4116",
                            "id": "411628",
                            "fullname": "河南省周口市鹿邑县"
                        },
                        {
                            "name": "项城市",
                            "pId": "4116",
                            "id": "411681",
                            "fullname": "河南省周口市项城市"
                        }
                    ]
                },
                {
                    "name": "驻马店市",
                    "pId": "41",
                    "id": "4117",
                    "fullname": "河南省驻马店市",
                    "items": [
                        {
                            "name": "驿城区",
                            "pId": "4117",
                            "id": "411702",
                            "fullname": "河南省驻马店市驿城区"
                        },
                        {
                            "name": "西平县",
                            "pId": "4117",
                            "id": "411721",
                            "fullname": "河南省驻马店市西平县"
                        },
                        {
                            "name": "上蔡县",
                            "pId": "4117",
                            "id": "411722",
                            "fullname": "河南省驻马店市上蔡县"
                        },
                        {
                            "name": "平舆县",
                            "pId": "4117",
                            "id": "411723",
                            "fullname": "河南省驻马店市平舆县"
                        },
                        {
                            "name": "正阳县",
                            "pId": "4117",
                            "id": "411724",
                            "fullname": "河南省驻马店市正阳县"
                        },
                        {
                            "name": "确山县",
                            "pId": "4117",
                            "id": "411725",
                            "fullname": "河南省驻马店市确山县"
                        },
                        {
                            "name": "泌阳县",
                            "pId": "4117",
                            "id": "411726",
                            "fullname": "河南省驻马店市泌阳县"
                        },
                        {
                            "name": "汝南县",
                            "pId": "4117",
                            "id": "411727",
                            "fullname": "河南省驻马店市汝南县"
                        },
                        {
                            "name": "遂平县",
                            "pId": "4117",
                            "id": "411728",
                            "fullname": "河南省驻马店市遂平县"
                        },
                        {
                            "name": "新蔡县",
                            "pId": "4117",
                            "id": "411729",
                            "fullname": "河南省驻马店市新蔡县"
                        }
                    ]
                },
                {
                    "name": "省直辖县级行政区划",
                    "pId": "41",
                    "id": "4190",
                    "fullname": "河南省省直辖县级行政区划",
                    "items": [
                        {
                            "name": "济源市",
                            "pId": "4190",
                            "id": "419001",
                            "fullname": "河南省省直辖县级行政区划济源市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "湖北省",
            "pId": "1",
            "id": "42",
            "fullname": "湖北省",
            "items": [
                {
                    "name": "武汉市",
                    "pId": "42",
                    "id": "4201",
                    "fullname": "湖北省武汉市",
                    "items": [
                        {
                            "name": "江岸区",
                            "pId": "4201",
                            "id": "420102",
                            "fullname": "湖北省武汉市江岸区"
                        },
                        {
                            "name": "江汉区",
                            "pId": "4201",
                            "id": "420103",
                            "fullname": "湖北省武汉市江汉区"
                        },
                        {
                            "name": "�口区",
                            "pId": "4201",
                            "id": "420104",
                            "fullname": "湖北省武汉市�口区"
                        },
                        {
                            "name": "汉阳区",
                            "pId": "4201",
                            "id": "420105",
                            "fullname": "湖北省武汉市汉阳区"
                        },
                        {
                            "name": "武昌区",
                            "pId": "4201",
                            "id": "420106",
                            "fullname": "湖北省武汉市武昌区"
                        },
                        {
                            "name": "青山区",
                            "pId": "4201",
                            "id": "420107",
                            "fullname": "湖北省武汉市青山区"
                        },
                        {
                            "name": "洪山区",
                            "pId": "4201",
                            "id": "420111",
                            "fullname": "湖北省武汉市洪山区"
                        },
                        {
                            "name": "东西湖区",
                            "pId": "4201",
                            "id": "420112",
                            "fullname": "湖北省武汉市东西湖区"
                        },
                        {
                            "name": "汉南区",
                            "pId": "4201",
                            "id": "420113",
                            "fullname": "湖北省武汉市汉南区"
                        },
                        {
                            "name": "蔡甸区",
                            "pId": "4201",
                            "id": "420114",
                            "fullname": "湖北省武汉市蔡甸区"
                        },
                        {
                            "name": "江夏区",
                            "pId": "4201",
                            "id": "420115",
                            "fullname": "湖北省武汉市江夏区"
                        },
                        {
                            "name": "黄陂区",
                            "pId": "4201",
                            "id": "420116",
                            "fullname": "湖北省武汉市黄陂区"
                        },
                        {
                            "name": "新洲区",
                            "pId": "4201",
                            "id": "420117",
                            "fullname": "湖北省武汉市新洲区"
                        }
                    ]
                },
                {
                    "name": "黄石市",
                    "pId": "42",
                    "id": "4202",
                    "fullname": "湖北省黄石市",
                    "items": [
                        {
                            "name": "黄石港区",
                            "pId": "4202",
                            "id": "420202",
                            "fullname": "湖北省黄石市黄石港区"
                        },
                        {
                            "name": "西塞山区",
                            "pId": "4202",
                            "id": "420203",
                            "fullname": "湖北省黄石市西塞山区"
                        },
                        {
                            "name": "下陆区",
                            "pId": "4202",
                            "id": "420204",
                            "fullname": "湖北省黄石市下陆区"
                        },
                        {
                            "name": "铁山区",
                            "pId": "4202",
                            "id": "420205",
                            "fullname": "湖北省黄石市铁山区"
                        },
                        {
                            "name": "阳新县",
                            "pId": "4202",
                            "id": "420222",
                            "fullname": "湖北省黄石市阳新县"
                        },
                        {
                            "name": "大冶市",
                            "pId": "4202",
                            "id": "420281",
                            "fullname": "湖北省黄石市大冶市"
                        }
                    ]
                },
                {
                    "name": "十堰市",
                    "pId": "42",
                    "id": "4203",
                    "fullname": "湖北省十堰市",
                    "items": [
                        {
                            "name": "茅箭区",
                            "pId": "4203",
                            "id": "420302",
                            "fullname": "湖北省十堰市茅箭区"
                        },
                        {
                            "name": "张湾区",
                            "pId": "4203",
                            "id": "420303",
                            "fullname": "湖北省十堰市张湾区"
                        },
                        {
                            "name": "郧县",
                            "pId": "4203",
                            "id": "420321",
                            "fullname": "湖北省十堰市郧县"
                        },
                        {
                            "name": "郧西县",
                            "pId": "4203",
                            "id": "420322",
                            "fullname": "湖北省十堰市郧西县"
                        },
                        {
                            "name": "竹山县",
                            "pId": "4203",
                            "id": "420323",
                            "fullname": "湖北省十堰市竹山县"
                        },
                        {
                            "name": "竹溪县",
                            "pId": "4203",
                            "id": "420324",
                            "fullname": "湖北省十堰市竹溪县"
                        },
                        {
                            "name": "房县",
                            "pId": "4203",
                            "id": "420325",
                            "fullname": "湖北省十堰市房县"
                        },
                        {
                            "name": "丹江口市",
                            "pId": "4203",
                            "id": "420381",
                            "fullname": "湖北省十堰市丹江口市"
                        }
                    ]
                },
                {
                    "name": "宜昌市",
                    "pId": "42",
                    "id": "4205",
                    "fullname": "湖北省宜昌市",
                    "items": [
                        {
                            "name": "西陵区",
                            "pId": "4205",
                            "id": "420502",
                            "fullname": "湖北省宜昌市西陵区"
                        },
                        {
                            "name": "伍家岗区",
                            "pId": "4205",
                            "id": "420503",
                            "fullname": "湖北省宜昌市伍家岗区"
                        },
                        {
                            "name": "点军区",
                            "pId": "4205",
                            "id": "420504",
                            "fullname": "湖北省宜昌市点军区"
                        },
                        {
                            "name": "�亭区",
                            "pId": "4205",
                            "id": "420505",
                            "fullname": "湖北省宜昌市�亭区"
                        },
                        {
                            "name": "夷陵区",
                            "pId": "4205",
                            "id": "420506",
                            "fullname": "湖北省宜昌市夷陵区"
                        },
                        {
                            "name": "远安县",
                            "pId": "4205",
                            "id": "420525",
                            "fullname": "湖北省宜昌市远安县"
                        },
                        {
                            "name": "兴山县",
                            "pId": "4205",
                            "id": "420526",
                            "fullname": "湖北省宜昌市兴山县"
                        },
                        {
                            "name": "秭归县",
                            "pId": "4205",
                            "id": "420527",
                            "fullname": "湖北省宜昌市秭归县"
                        },
                        {
                            "name": "长阳土家族自治县",
                            "pId": "4205",
                            "id": "420528",
                            "fullname": "湖北省宜昌市长阳土家族自治县"
                        },
                        {
                            "name": "五峰土家族自治县",
                            "pId": "4205",
                            "id": "420529",
                            "fullname": "湖北省宜昌市五峰土家族自治县"
                        },
                        {
                            "name": "宜都市",
                            "pId": "4205",
                            "id": "420581",
                            "fullname": "湖北省宜昌市宜都市"
                        },
                        {
                            "name": "当阳市",
                            "pId": "4205",
                            "id": "420582",
                            "fullname": "湖北省宜昌市当阳市"
                        },
                        {
                            "name": "枝江市",
                            "pId": "4205",
                            "id": "420583",
                            "fullname": "湖北省宜昌市枝江市"
                        }
                    ]
                },
                {
                    "name": "襄阳市",
                    "pId": "42",
                    "id": "4206",
                    "fullname": "湖北省襄阳市",
                    "items": [
                        {
                            "name": "襄城区",
                            "pId": "4206",
                            "id": "420602",
                            "fullname": "湖北省襄阳市襄城区"
                        },
                        {
                            "name": "樊城区",
                            "pId": "4206",
                            "id": "420606",
                            "fullname": "湖北省襄阳市樊城区"
                        },
                        {
                            "name": "襄州区",
                            "pId": "4206",
                            "id": "420607",
                            "fullname": "湖北省襄阳市襄州区"
                        },
                        {
                            "name": "南漳县",
                            "pId": "4206",
                            "id": "420624",
                            "fullname": "湖北省襄阳市南漳县"
                        },
                        {
                            "name": "谷城县",
                            "pId": "4206",
                            "id": "420625",
                            "fullname": "湖北省襄阳市谷城县"
                        },
                        {
                            "name": "保康县",
                            "pId": "4206",
                            "id": "420626",
                            "fullname": "湖北省襄阳市保康县"
                        },
                        {
                            "name": "老河口市",
                            "pId": "4206",
                            "id": "420682",
                            "fullname": "湖北省襄阳市老河口市"
                        },
                        {
                            "name": "枣阳市",
                            "pId": "4206",
                            "id": "420683",
                            "fullname": "湖北省襄阳市枣阳市"
                        },
                        {
                            "name": "宜城市",
                            "pId": "4206",
                            "id": "420684",
                            "fullname": "湖北省襄阳市宜城市"
                        }
                    ]
                },
                {
                    "name": "鄂州市",
                    "pId": "42",
                    "id": "4207",
                    "fullname": "湖北省鄂州市",
                    "items": [
                        {
                            "name": "梁子湖区",
                            "pId": "4207",
                            "id": "420702",
                            "fullname": "湖北省鄂州市梁子湖区"
                        },
                        {
                            "name": "华容区",
                            "pId": "4207",
                            "id": "420703",
                            "fullname": "湖北省鄂州市华容区"
                        },
                        {
                            "name": "鄂城区",
                            "pId": "4207",
                            "id": "420704",
                            "fullname": "湖北省鄂州市鄂城区"
                        }
                    ]
                },
                {
                    "name": "荆门市",
                    "pId": "42",
                    "id": "4208",
                    "fullname": "湖北省荆门市",
                    "items": [
                        {
                            "name": "东宝区",
                            "pId": "4208",
                            "id": "420802",
                            "fullname": "湖北省荆门市东宝区"
                        },
                        {
                            "name": "掇刀区",
                            "pId": "4208",
                            "id": "420804",
                            "fullname": "湖北省荆门市掇刀区"
                        },
                        {
                            "name": "京山县",
                            "pId": "4208",
                            "id": "420821",
                            "fullname": "湖北省荆门市京山县"
                        },
                        {
                            "name": "沙洋县",
                            "pId": "4208",
                            "id": "420822",
                            "fullname": "湖北省荆门市沙洋县"
                        },
                        {
                            "name": "钟祥市",
                            "pId": "4208",
                            "id": "420881",
                            "fullname": "湖北省荆门市钟祥市"
                        }
                    ]
                },
                {
                    "name": "孝感市",
                    "pId": "42",
                    "id": "4209",
                    "fullname": "湖北省孝感市",
                    "items": [
                        {
                            "name": "孝南区",
                            "pId": "4209",
                            "id": "420902",
                            "fullname": "湖北省孝感市孝南区"
                        },
                        {
                            "name": "孝昌县",
                            "pId": "4209",
                            "id": "420921",
                            "fullname": "湖北省孝感市孝昌县"
                        },
                        {
                            "name": "大悟县",
                            "pId": "4209",
                            "id": "420922",
                            "fullname": "湖北省孝感市大悟县"
                        },
                        {
                            "name": "云梦县",
                            "pId": "4209",
                            "id": "420923",
                            "fullname": "湖北省孝感市云梦县"
                        },
                        {
                            "name": "应城市",
                            "pId": "4209",
                            "id": "420981",
                            "fullname": "湖北省孝感市应城市"
                        },
                        {
                            "name": "安陆市",
                            "pId": "4209",
                            "id": "420982",
                            "fullname": "湖北省孝感市安陆市"
                        },
                        {
                            "name": "汉川市",
                            "pId": "4209",
                            "id": "420984",
                            "fullname": "湖北省孝感市汉川市"
                        }
                    ]
                },
                {
                    "name": "荆州市",
                    "pId": "42",
                    "id": "4210",
                    "fullname": "湖北省荆州市",
                    "items": [
                        {
                            "name": "沙市区",
                            "pId": "4210",
                            "id": "421002",
                            "fullname": "湖北省荆州市沙市区"
                        },
                        {
                            "name": "荆州区",
                            "pId": "4210",
                            "id": "421003",
                            "fullname": "湖北省荆州市荆州区"
                        },
                        {
                            "name": "公安县",
                            "pId": "4210",
                            "id": "421022",
                            "fullname": "湖北省荆州市公安县"
                        },
                        {
                            "name": "监利县",
                            "pId": "4210",
                            "id": "421023",
                            "fullname": "湖北省荆州市监利县"
                        },
                        {
                            "name": "江陵县",
                            "pId": "4210",
                            "id": "421024",
                            "fullname": "湖北省荆州市江陵县"
                        },
                        {
                            "name": "石首市",
                            "pId": "4210",
                            "id": "421081",
                            "fullname": "湖北省荆州市石首市"
                        },
                        {
                            "name": "洪湖市",
                            "pId": "4210",
                            "id": "421083",
                            "fullname": "湖北省荆州市洪湖市"
                        },
                        {
                            "name": "松滋市",
                            "pId": "4210",
                            "id": "421087",
                            "fullname": "湖北省荆州市松滋市"
                        }
                    ]
                },
                {
                    "name": "黄冈市",
                    "pId": "42",
                    "id": "4211",
                    "fullname": "湖北省黄冈市",
                    "items": [
                        {
                            "name": "黄州区",
                            "pId": "4211",
                            "id": "421102",
                            "fullname": "湖北省黄冈市黄州区"
                        },
                        {
                            "name": "团风县",
                            "pId": "4211",
                            "id": "421121",
                            "fullname": "湖北省黄冈市团风县"
                        },
                        {
                            "name": "红安县",
                            "pId": "4211",
                            "id": "421122",
                            "fullname": "湖北省黄冈市红安县"
                        },
                        {
                            "name": "罗田县",
                            "pId": "4211",
                            "id": "421123",
                            "fullname": "湖北省黄冈市罗田县"
                        },
                        {
                            "name": "英山县",
                            "pId": "4211",
                            "id": "421124",
                            "fullname": "湖北省黄冈市英山县"
                        },
                        {
                            "name": "浠水县",
                            "pId": "4211",
                            "id": "421125",
                            "fullname": "湖北省黄冈市浠水县"
                        },
                        {
                            "name": "蕲春县",
                            "pId": "4211",
                            "id": "421126",
                            "fullname": "湖北省黄冈市蕲春县"
                        },
                        {
                            "name": "黄梅县",
                            "pId": "4211",
                            "id": "421127",
                            "fullname": "湖北省黄冈市黄梅县"
                        },
                        {
                            "name": "麻城市",
                            "pId": "4211",
                            "id": "421181",
                            "fullname": "湖北省黄冈市麻城市"
                        },
                        {
                            "name": "武穴市",
                            "pId": "4211",
                            "id": "421182",
                            "fullname": "湖北省黄冈市武穴市"
                        }
                    ]
                },
                {
                    "name": "咸宁市",
                    "pId": "42",
                    "id": "4212",
                    "fullname": "湖北省咸宁市",
                    "items": [
                        {
                            "name": "咸安区",
                            "pId": "4212",
                            "id": "421202",
                            "fullname": "湖北省咸宁市咸安区"
                        },
                        {
                            "name": "嘉鱼县",
                            "pId": "4212",
                            "id": "421221",
                            "fullname": "湖北省咸宁市嘉鱼县"
                        },
                        {
                            "name": "通城县",
                            "pId": "4212",
                            "id": "421222",
                            "fullname": "湖北省咸宁市通城县"
                        },
                        {
                            "name": "崇阳县",
                            "pId": "4212",
                            "id": "421223",
                            "fullname": "湖北省咸宁市崇阳县"
                        },
                        {
                            "name": "通山县",
                            "pId": "4212",
                            "id": "421224",
                            "fullname": "湖北省咸宁市通山县"
                        },
                        {
                            "name": "赤壁市",
                            "pId": "4212",
                            "id": "421281",
                            "fullname": "湖北省咸宁市赤壁市"
                        }
                    ]
                },
                {
                    "name": "随州市",
                    "pId": "42",
                    "id": "4213",
                    "fullname": "湖北省随州市",
                    "items": [
                        {
                            "name": "曾都区",
                            "pId": "4213",
                            "id": "421303",
                            "fullname": "湖北省随州市曾都区"
                        },
                        {
                            "name": "随县",
                            "pId": "4213",
                            "id": "421321",
                            "fullname": "湖北省随州市随县"
                        },
                        {
                            "name": "广水市",
                            "pId": "4213",
                            "id": "421381",
                            "fullname": "湖北省随州市广水市"
                        }
                    ]
                },
                {
                    "name": "恩施土家族苗族自治州",
                    "pId": "42",
                    "id": "4228",
                    "fullname": "湖北省恩施土家族苗族自治州",
                    "items": [
                        {
                            "name": "恩施市",
                            "pId": "4228",
                            "id": "422801",
                            "fullname": "湖北省恩施土家族苗族自治州恩施市"
                        },
                        {
                            "name": "利川市",
                            "pId": "4228",
                            "id": "422802",
                            "fullname": "湖北省恩施土家族苗族自治州利川市"
                        },
                        {
                            "name": "建始县",
                            "pId": "4228",
                            "id": "422822",
                            "fullname": "湖北省恩施土家族苗族自治州建始县"
                        },
                        {
                            "name": "巴东县",
                            "pId": "4228",
                            "id": "422823",
                            "fullname": "湖北省恩施土家族苗族自治州巴东县"
                        },
                        {
                            "name": "宣恩县",
                            "pId": "4228",
                            "id": "422825",
                            "fullname": "湖北省恩施土家族苗族自治州宣恩县"
                        },
                        {
                            "name": "咸丰县",
                            "pId": "4228",
                            "id": "422826",
                            "fullname": "湖北省恩施土家族苗族自治州咸丰县"
                        },
                        {
                            "name": "来凤县",
                            "pId": "4228",
                            "id": "422827",
                            "fullname": "湖北省恩施土家族苗族自治州来凤县"
                        },
                        {
                            "name": "鹤峰县",
                            "pId": "4228",
                            "id": "422828",
                            "fullname": "湖北省恩施土家族苗族自治州鹤峰县"
                        }
                    ]
                },
                {
                    "name": "省直辖县级行政区划",
                    "pId": "42",
                    "id": "4290",
                    "fullname": "湖北省省直辖县级行政区划",
                    "items": [
                        {
                            "name": "仙桃市",
                            "pId": "4290",
                            "id": "429004",
                            "fullname": "湖北省省直辖县级行政区划仙桃市"
                        },
                        {
                            "name": "潜江市",
                            "pId": "4290",
                            "id": "429005",
                            "fullname": "湖北省省直辖县级行政区划潜江市"
                        },
                        {
                            "name": "天门市",
                            "pId": "4290",
                            "id": "429006",
                            "fullname": "湖北省省直辖县级行政区划天门市"
                        },
                        {
                            "name": "神农架林区",
                            "pId": "4290",
                            "id": "429021",
                            "fullname": "湖北省省直辖县级行政区划神农架林区"
                        }
                    ]
                }
            ]
        },
        {
            "name": "湖南省",
            "pId": "1",
            "id": "43",
            "fullname": "湖南省",
            "items": [
                {
                    "name": "长沙市",
                    "pId": "43",
                    "id": "4301",
                    "fullname": "湖南省长沙市",
                    "items": [
                        {
                            "name": "芙蓉区",
                            "pId": "4301",
                            "id": "430102",
                            "fullname": "湖南省长沙市芙蓉区"
                        },
                        {
                            "name": "天心区",
                            "pId": "4301",
                            "id": "430103",
                            "fullname": "湖南省长沙市天心区"
                        },
                        {
                            "name": "岳麓区",
                            "pId": "4301",
                            "id": "430104",
                            "fullname": "湖南省长沙市岳麓区"
                        },
                        {
                            "name": "开福区",
                            "pId": "4301",
                            "id": "430105",
                            "fullname": "湖南省长沙市开福区"
                        },
                        {
                            "name": "雨花区",
                            "pId": "4301",
                            "id": "430111",
                            "fullname": "湖南省长沙市雨花区"
                        },
                        {
                            "name": "望城区",
                            "pId": "4301",
                            "id": "430112",
                            "fullname": "湖南省长沙市望城区"
                        },
                        {
                            "name": "长沙县",
                            "pId": "4301",
                            "id": "430121",
                            "fullname": "湖南省长沙市长沙县"
                        },
                        {
                            "name": "宁乡县",
                            "pId": "4301",
                            "id": "430124",
                            "fullname": "湖南省长沙市宁乡县"
                        },
                        {
                            "name": "浏阳市",
                            "pId": "4301",
                            "id": "430181",
                            "fullname": "湖南省长沙市浏阳市"
                        }
                    ]
                },
                {
                    "name": "株洲市",
                    "pId": "43",
                    "id": "4302",
                    "fullname": "湖南省株洲市",
                    "items": [
                        {
                            "name": "荷塘区",
                            "pId": "4302",
                            "id": "430202",
                            "fullname": "湖南省株洲市荷塘区"
                        },
                        {
                            "name": "芦淞区",
                            "pId": "4302",
                            "id": "430203",
                            "fullname": "湖南省株洲市芦淞区"
                        },
                        {
                            "name": "石峰区",
                            "pId": "4302",
                            "id": "430204",
                            "fullname": "湖南省株洲市石峰区"
                        },
                        {
                            "name": "天元区",
                            "pId": "4302",
                            "id": "430211",
                            "fullname": "湖南省株洲市天元区"
                        },
                        {
                            "name": "株洲县",
                            "pId": "4302",
                            "id": "430221",
                            "fullname": "湖南省株洲市株洲县"
                        },
                        {
                            "name": "攸县",
                            "pId": "4302",
                            "id": "430223",
                            "fullname": "湖南省株洲市攸县"
                        },
                        {
                            "name": "茶陵县",
                            "pId": "4302",
                            "id": "430224",
                            "fullname": "湖南省株洲市茶陵县"
                        },
                        {
                            "name": "炎陵县",
                            "pId": "4302",
                            "id": "430225",
                            "fullname": "湖南省株洲市炎陵县"
                        },
                        {
                            "name": "醴陵市",
                            "pId": "4302",
                            "id": "430281",
                            "fullname": "湖南省株洲市醴陵市"
                        }
                    ]
                },
                {
                    "name": "湘潭市",
                    "pId": "43",
                    "id": "4303",
                    "fullname": "湖南省湘潭市",
                    "items": [
                        {
                            "name": "雨湖区",
                            "pId": "4303",
                            "id": "430302",
                            "fullname": "湖南省湘潭市雨湖区"
                        },
                        {
                            "name": "岳塘区",
                            "pId": "4303",
                            "id": "430304",
                            "fullname": "湖南省湘潭市岳塘区"
                        },
                        {
                            "name": "湘潭县",
                            "pId": "4303",
                            "id": "430321",
                            "fullname": "湖南省湘潭市湘潭县"
                        },
                        {
                            "name": "湘乡市",
                            "pId": "4303",
                            "id": "430381",
                            "fullname": "湖南省湘潭市湘乡市"
                        },
                        {
                            "name": "韶山市",
                            "pId": "4303",
                            "id": "430382",
                            "fullname": "湖南省湘潭市韶山市"
                        }
                    ]
                },
                {
                    "name": "衡阳市",
                    "pId": "43",
                    "id": "4304",
                    "fullname": "湖南省衡阳市",
                    "items": [
                        {
                            "name": "珠晖区",
                            "pId": "4304",
                            "id": "430405",
                            "fullname": "湖南省衡阳市珠晖区"
                        },
                        {
                            "name": "雁峰区",
                            "pId": "4304",
                            "id": "430406",
                            "fullname": "湖南省衡阳市雁峰区"
                        },
                        {
                            "name": "石鼓区",
                            "pId": "4304",
                            "id": "430407",
                            "fullname": "湖南省衡阳市石鼓区"
                        },
                        {
                            "name": "蒸湘区",
                            "pId": "4304",
                            "id": "430408",
                            "fullname": "湖南省衡阳市蒸湘区"
                        },
                        {
                            "name": "南岳区",
                            "pId": "4304",
                            "id": "430412",
                            "fullname": "湖南省衡阳市南岳区"
                        },
                        {
                            "name": "衡阳县",
                            "pId": "4304",
                            "id": "430421",
                            "fullname": "湖南省衡阳市衡阳县"
                        },
                        {
                            "name": "衡南县",
                            "pId": "4304",
                            "id": "430422",
                            "fullname": "湖南省衡阳市衡南县"
                        },
                        {
                            "name": "衡山县",
                            "pId": "4304",
                            "id": "430423",
                            "fullname": "湖南省衡阳市衡山县"
                        },
                        {
                            "name": "衡东县",
                            "pId": "4304",
                            "id": "430424",
                            "fullname": "湖南省衡阳市衡东县"
                        },
                        {
                            "name": "祁东县",
                            "pId": "4304",
                            "id": "430426",
                            "fullname": "湖南省衡阳市祁东县"
                        },
                        {
                            "name": "耒阳市",
                            "pId": "4304",
                            "id": "430481",
                            "fullname": "湖南省衡阳市耒阳市"
                        },
                        {
                            "name": "常宁市",
                            "pId": "4304",
                            "id": "430482",
                            "fullname": "湖南省衡阳市常宁市"
                        }
                    ]
                },
                {
                    "name": "邵阳市",
                    "pId": "43",
                    "id": "4305",
                    "fullname": "湖南省邵阳市",
                    "items": [
                        {
                            "name": "双清区",
                            "pId": "4305",
                            "id": "430502",
                            "fullname": "湖南省邵阳市双清区"
                        },
                        {
                            "name": "大祥区",
                            "pId": "4305",
                            "id": "430503",
                            "fullname": "湖南省邵阳市大祥区"
                        },
                        {
                            "name": "北塔区",
                            "pId": "4305",
                            "id": "430511",
                            "fullname": "湖南省邵阳市北塔区"
                        },
                        {
                            "name": "邵东县",
                            "pId": "4305",
                            "id": "430521",
                            "fullname": "湖南省邵阳市邵东县"
                        },
                        {
                            "name": "新邵县",
                            "pId": "4305",
                            "id": "430522",
                            "fullname": "湖南省邵阳市新邵县"
                        },
                        {
                            "name": "邵阳县",
                            "pId": "4305",
                            "id": "430523",
                            "fullname": "湖南省邵阳市邵阳县"
                        },
                        {
                            "name": "隆回县",
                            "pId": "4305",
                            "id": "430524",
                            "fullname": "湖南省邵阳市隆回县"
                        },
                        {
                            "name": "洞口县",
                            "pId": "4305",
                            "id": "430525",
                            "fullname": "湖南省邵阳市洞口县"
                        },
                        {
                            "name": "绥宁县",
                            "pId": "4305",
                            "id": "430527",
                            "fullname": "湖南省邵阳市绥宁县"
                        },
                        {
                            "name": "新宁县",
                            "pId": "4305",
                            "id": "430528",
                            "fullname": "湖南省邵阳市新宁县"
                        },
                        {
                            "name": "城步苗族自治县",
                            "pId": "4305",
                            "id": "430529",
                            "fullname": "湖南省邵阳市城步苗族自治县"
                        },
                        {
                            "name": "武冈市",
                            "pId": "4305",
                            "id": "430581",
                            "fullname": "湖南省邵阳市武冈市"
                        }
                    ]
                },
                {
                    "name": "岳阳市",
                    "pId": "43",
                    "id": "4306",
                    "fullname": "湖南省岳阳市",
                    "items": [
                        {
                            "name": "岳阳楼区",
                            "pId": "4306",
                            "id": "430602",
                            "fullname": "湖南省岳阳市岳阳楼区"
                        },
                        {
                            "name": "云溪区",
                            "pId": "4306",
                            "id": "430603",
                            "fullname": "湖南省岳阳市云溪区"
                        },
                        {
                            "name": "君山区",
                            "pId": "4306",
                            "id": "430611",
                            "fullname": "湖南省岳阳市君山区"
                        },
                        {
                            "name": "岳阳县",
                            "pId": "4306",
                            "id": "430621",
                            "fullname": "湖南省岳阳市岳阳县"
                        },
                        {
                            "name": "华容县",
                            "pId": "4306",
                            "id": "430623",
                            "fullname": "湖南省岳阳市华容县"
                        },
                        {
                            "name": "湘阴县",
                            "pId": "4306",
                            "id": "430624",
                            "fullname": "湖南省岳阳市湘阴县"
                        },
                        {
                            "name": "平江县",
                            "pId": "4306",
                            "id": "430626",
                            "fullname": "湖南省岳阳市平江县"
                        },
                        {
                            "name": "汨罗市",
                            "pId": "4306",
                            "id": "430681",
                            "fullname": "湖南省岳阳市汨罗市"
                        },
                        {
                            "name": "临湘市",
                            "pId": "4306",
                            "id": "430682",
                            "fullname": "湖南省岳阳市临湘市"
                        }
                    ]
                },
                {
                    "name": "常德市",
                    "pId": "43",
                    "id": "4307",
                    "fullname": "湖南省常德市",
                    "items": [
                        {
                            "name": "武陵区",
                            "pId": "4307",
                            "id": "430702",
                            "fullname": "湖南省常德市武陵区"
                        },
                        {
                            "name": "鼎城区",
                            "pId": "4307",
                            "id": "430703",
                            "fullname": "湖南省常德市鼎城区"
                        },
                        {
                            "name": "安乡县",
                            "pId": "4307",
                            "id": "430721",
                            "fullname": "湖南省常德市安乡县"
                        },
                        {
                            "name": "汉寿县",
                            "pId": "4307",
                            "id": "430722",
                            "fullname": "湖南省常德市汉寿县"
                        },
                        {
                            "name": "澧县",
                            "pId": "4307",
                            "id": "430723",
                            "fullname": "湖南省常德市澧县"
                        },
                        {
                            "name": "临澧县",
                            "pId": "4307",
                            "id": "430724",
                            "fullname": "湖南省常德市临澧县"
                        },
                        {
                            "name": "桃源县",
                            "pId": "4307",
                            "id": "430725",
                            "fullname": "湖南省常德市桃源县"
                        },
                        {
                            "name": "石门县",
                            "pId": "4307",
                            "id": "430726",
                            "fullname": "湖南省常德市石门县"
                        },
                        {
                            "name": "津市市",
                            "pId": "4307",
                            "id": "430781",
                            "fullname": "湖南省常德市津市市"
                        }
                    ]
                },
                {
                    "name": "张家界市",
                    "pId": "43",
                    "id": "4308",
                    "fullname": "湖南省张家界市",
                    "items": [
                        {
                            "name": "永定区",
                            "pId": "4308",
                            "id": "430802",
                            "fullname": "湖南省张家界市永定区"
                        },
                        {
                            "name": "武陵源区",
                            "pId": "4308",
                            "id": "430811",
                            "fullname": "湖南省张家界市武陵源区"
                        },
                        {
                            "name": "慈利县",
                            "pId": "4308",
                            "id": "430821",
                            "fullname": "湖南省张家界市慈利县"
                        },
                        {
                            "name": "桑植县",
                            "pId": "4308",
                            "id": "430822",
                            "fullname": "湖南省张家界市桑植县"
                        }
                    ]
                },
                {
                    "name": "益阳市",
                    "pId": "43",
                    "id": "4309",
                    "fullname": "湖南省益阳市",
                    "items": [
                        {
                            "name": "资阳区",
                            "pId": "4309",
                            "id": "430902",
                            "fullname": "湖南省益阳市资阳区"
                        },
                        {
                            "name": "赫山区",
                            "pId": "4309",
                            "id": "430903",
                            "fullname": "湖南省益阳市赫山区"
                        },
                        {
                            "name": "南县",
                            "pId": "4309",
                            "id": "430921",
                            "fullname": "湖南省益阳市南县"
                        },
                        {
                            "name": "桃江县",
                            "pId": "4309",
                            "id": "430922",
                            "fullname": "湖南省益阳市桃江县"
                        },
                        {
                            "name": "安化县",
                            "pId": "4309",
                            "id": "430923",
                            "fullname": "湖南省益阳市安化县"
                        },
                        {
                            "name": "沅江市",
                            "pId": "4309",
                            "id": "430981",
                            "fullname": "湖南省益阳市沅江市"
                        }
                    ]
                },
                {
                    "name": "郴州市",
                    "pId": "43",
                    "id": "4310",
                    "fullname": "湖南省郴州市",
                    "items": [
                        {
                            "name": "北湖区",
                            "pId": "4310",
                            "id": "431002",
                            "fullname": "湖南省郴州市北湖区"
                        },
                        {
                            "name": "苏仙区",
                            "pId": "4310",
                            "id": "431003",
                            "fullname": "湖南省郴州市苏仙区"
                        },
                        {
                            "name": "桂阳县",
                            "pId": "4310",
                            "id": "431021",
                            "fullname": "湖南省郴州市桂阳县"
                        },
                        {
                            "name": "宜章县",
                            "pId": "4310",
                            "id": "431022",
                            "fullname": "湖南省郴州市宜章县"
                        },
                        {
                            "name": "永兴县",
                            "pId": "4310",
                            "id": "431023",
                            "fullname": "湖南省郴州市永兴县"
                        },
                        {
                            "name": "嘉禾县",
                            "pId": "4310",
                            "id": "431024",
                            "fullname": "湖南省郴州市嘉禾县"
                        },
                        {
                            "name": "临武县",
                            "pId": "4310",
                            "id": "431025",
                            "fullname": "湖南省郴州市临武县"
                        },
                        {
                            "name": "汝城县",
                            "pId": "4310",
                            "id": "431026",
                            "fullname": "湖南省郴州市汝城县"
                        },
                        {
                            "name": "桂东县",
                            "pId": "4310",
                            "id": "431027",
                            "fullname": "湖南省郴州市桂东县"
                        },
                        {
                            "name": "安仁县",
                            "pId": "4310",
                            "id": "431028",
                            "fullname": "湖南省郴州市安仁县"
                        },
                        {
                            "name": "资兴市",
                            "pId": "4310",
                            "id": "431081",
                            "fullname": "湖南省郴州市资兴市"
                        }
                    ]
                },
                {
                    "name": "永州市",
                    "pId": "43",
                    "id": "4311",
                    "fullname": "湖南省永州市",
                    "items": [
                        {
                            "name": "零陵区",
                            "pId": "4311",
                            "id": "431102",
                            "fullname": "湖南省永州市零陵区"
                        },
                        {
                            "name": "冷水滩区",
                            "pId": "4311",
                            "id": "431103",
                            "fullname": "湖南省永州市冷水滩区"
                        },
                        {
                            "name": "祁阳县",
                            "pId": "4311",
                            "id": "431121",
                            "fullname": "湖南省永州市祁阳县"
                        },
                        {
                            "name": "东安县",
                            "pId": "4311",
                            "id": "431122",
                            "fullname": "湖南省永州市东安县"
                        },
                        {
                            "name": "双牌县",
                            "pId": "4311",
                            "id": "431123",
                            "fullname": "湖南省永州市双牌县"
                        },
                        {
                            "name": "道县",
                            "pId": "4311",
                            "id": "431124",
                            "fullname": "湖南省永州市道县"
                        },
                        {
                            "name": "江永县",
                            "pId": "4311",
                            "id": "431125",
                            "fullname": "湖南省永州市江永县"
                        },
                        {
                            "name": "宁远县",
                            "pId": "4311",
                            "id": "431126",
                            "fullname": "湖南省永州市宁远县"
                        },
                        {
                            "name": "蓝山县",
                            "pId": "4311",
                            "id": "431127",
                            "fullname": "湖南省永州市蓝山县"
                        },
                        {
                            "name": "新田县",
                            "pId": "4311",
                            "id": "431128",
                            "fullname": "湖南省永州市新田县"
                        },
                        {
                            "name": "江华瑶族自治县",
                            "pId": "4311",
                            "id": "431129",
                            "fullname": "湖南省永州市江华瑶族自治县"
                        }
                    ]
                },
                {
                    "name": "怀化市",
                    "pId": "43",
                    "id": "4312",
                    "fullname": "湖南省怀化市",
                    "items": [
                        {
                            "name": "鹤城区",
                            "pId": "4312",
                            "id": "431202",
                            "fullname": "湖南省怀化市鹤城区"
                        },
                        {
                            "name": "中方县",
                            "pId": "4312",
                            "id": "431221",
                            "fullname": "湖南省怀化市中方县"
                        },
                        {
                            "name": "沅陵县",
                            "pId": "4312",
                            "id": "431222",
                            "fullname": "湖南省怀化市沅陵县"
                        },
                        {
                            "name": "辰溪县",
                            "pId": "4312",
                            "id": "431223",
                            "fullname": "湖南省怀化市辰溪县"
                        },
                        {
                            "name": "溆浦县",
                            "pId": "4312",
                            "id": "431224",
                            "fullname": "湖南省怀化市溆浦县"
                        },
                        {
                            "name": "会同县",
                            "pId": "4312",
                            "id": "431225",
                            "fullname": "湖南省怀化市会同县"
                        },
                        {
                            "name": "麻阳苗族自治县",
                            "pId": "4312",
                            "id": "431226",
                            "fullname": "湖南省怀化市麻阳苗族自治县"
                        },
                        {
                            "name": "新晃侗族自治县",
                            "pId": "4312",
                            "id": "431227",
                            "fullname": "湖南省怀化市新晃侗族自治县"
                        },
                        {
                            "name": "芷江侗族自治县",
                            "pId": "4312",
                            "id": "431228",
                            "fullname": "湖南省怀化市芷江侗族自治县"
                        },
                        {
                            "name": "靖州苗族侗族自治县",
                            "pId": "4312",
                            "id": "431229",
                            "fullname": "湖南省怀化市靖州苗族侗族自治县"
                        },
                        {
                            "name": "通道侗族自治县",
                            "pId": "4312",
                            "id": "431230",
                            "fullname": "湖南省怀化市通道侗族自治县"
                        },
                        {
                            "name": "洪江市",
                            "pId": "4312",
                            "id": "431281",
                            "fullname": "湖南省怀化市洪江市"
                        }
                    ]
                },
                {
                    "name": "娄底市",
                    "pId": "43",
                    "id": "4313",
                    "fullname": "湖南省娄底市",
                    "items": [
                        {
                            "name": "娄星区",
                            "pId": "4313",
                            "id": "431302",
                            "fullname": "湖南省娄底市娄星区"
                        },
                        {
                            "name": "双峰县",
                            "pId": "4313",
                            "id": "431321",
                            "fullname": "湖南省娄底市双峰县"
                        },
                        {
                            "name": "新化县",
                            "pId": "4313",
                            "id": "431322",
                            "fullname": "湖南省娄底市新化县"
                        },
                        {
                            "name": "冷水江市",
                            "pId": "4313",
                            "id": "431381",
                            "fullname": "湖南省娄底市冷水江市"
                        },
                        {
                            "name": "涟源市",
                            "pId": "4313",
                            "id": "431382",
                            "fullname": "湖南省娄底市涟源市"
                        }
                    ]
                },
                {
                    "name": "湘西土家族苗族自治州",
                    "pId": "43",
                    "id": "4331",
                    "fullname": "湖南省湘西土家族苗族自治州",
                    "items": [
                        {
                            "name": "吉首市",
                            "pId": "4331",
                            "id": "433101",
                            "fullname": "湖南省湘西土家族苗族自治州吉首市"
                        },
                        {
                            "name": "泸溪县",
                            "pId": "4331",
                            "id": "433122",
                            "fullname": "湖南省湘西土家族苗族自治州泸溪县"
                        },
                        {
                            "name": "凤凰县",
                            "pId": "4331",
                            "id": "433123",
                            "fullname": "湖南省湘西土家族苗族自治州凤凰县"
                        },
                        {
                            "name": "花垣县",
                            "pId": "4331",
                            "id": "433124",
                            "fullname": "湖南省湘西土家族苗族自治州花垣县"
                        },
                        {
                            "name": "保靖县",
                            "pId": "4331",
                            "id": "433125",
                            "fullname": "湖南省湘西土家族苗族自治州保靖县"
                        },
                        {
                            "name": "古丈县",
                            "pId": "4331",
                            "id": "433126",
                            "fullname": "湖南省湘西土家族苗族自治州古丈县"
                        },
                        {
                            "name": "永顺县",
                            "pId": "4331",
                            "id": "433127",
                            "fullname": "湖南省湘西土家族苗族自治州永顺县"
                        },
                        {
                            "name": "龙山县",
                            "pId": "4331",
                            "id": "433130",
                            "fullname": "湖南省湘西土家族苗族自治州龙山县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "广东省",
            "pId": "1",
            "id": "44",
            "fullname": "广东省",
            "items": [
                {
                    "name": "广州市",
                    "pId": "44",
                    "id": "4401",
                    "fullname": "广东省广州市",
                    "items": [
                        {
                            "name": "荔湾区",
                            "pId": "4401",
                            "id": "440103",
                            "fullname": "广东省广州市荔湾区"
                        },
                        {
                            "name": "越秀区",
                            "pId": "4401",
                            "id": "440104",
                            "fullname": "广东省广州市越秀区"
                        },
                        {
                            "name": "海珠区",
                            "pId": "4401",
                            "id": "440105",
                            "fullname": "广东省广州市海珠区"
                        },
                        {
                            "name": "天河区",
                            "pId": "4401",
                            "id": "440106",
                            "fullname": "广东省广州市天河区"
                        },
                        {
                            "name": "白云区",
                            "pId": "4401",
                            "id": "440111",
                            "fullname": "广东省广州市白云区"
                        },
                        {
                            "name": "黄埔区",
                            "pId": "4401",
                            "id": "440112",
                            "fullname": "广东省广州市黄埔区"
                        },
                        {
                            "name": "番禺区",
                            "pId": "4401",
                            "id": "440113",
                            "fullname": "广东省广州市番禺区"
                        },
                        {
                            "name": "花都区",
                            "pId": "4401",
                            "id": "440114",
                            "fullname": "广东省广州市花都区"
                        },
                        {
                            "name": "南沙区",
                            "pId": "4401",
                            "id": "440115",
                            "fullname": "广东省广州市南沙区"
                        },
                        {
                            "name": "萝岗区",
                            "pId": "4401",
                            "id": "440116",
                            "fullname": "广东省广州市萝岗区"
                        },
                        {
                            "name": "增城市",
                            "pId": "4401",
                            "id": "440183",
                            "fullname": "广东省广州市增城市"
                        },
                        {
                            "name": "从化市",
                            "pId": "4401",
                            "id": "440184",
                            "fullname": "广东省广州市从化市"
                        }
                    ]
                },
                {
                    "name": "韶关市",
                    "pId": "44",
                    "id": "4402",
                    "fullname": "广东省韶关市",
                    "items": [
                        {
                            "name": "武江区",
                            "pId": "4402",
                            "id": "440203",
                            "fullname": "广东省韶关市武江区"
                        },
                        {
                            "name": "浈江区",
                            "pId": "4402",
                            "id": "440204",
                            "fullname": "广东省韶关市浈江区"
                        },
                        {
                            "name": "曲江区",
                            "pId": "4402",
                            "id": "440205",
                            "fullname": "广东省韶关市曲江区"
                        },
                        {
                            "name": "始兴县",
                            "pId": "4402",
                            "id": "440222",
                            "fullname": "广东省韶关市始兴县"
                        },
                        {
                            "name": "仁化县",
                            "pId": "4402",
                            "id": "440224",
                            "fullname": "广东省韶关市仁化县"
                        },
                        {
                            "name": "翁源县",
                            "pId": "4402",
                            "id": "440229",
                            "fullname": "广东省韶关市翁源县"
                        },
                        {
                            "name": "乳源瑶族自治县",
                            "pId": "4402",
                            "id": "440232",
                            "fullname": "广东省韶关市乳源瑶族自治县"
                        },
                        {
                            "name": "新丰县",
                            "pId": "4402",
                            "id": "440233",
                            "fullname": "广东省韶关市新丰县"
                        },
                        {
                            "name": "乐昌市",
                            "pId": "4402",
                            "id": "440281",
                            "fullname": "广东省韶关市乐昌市"
                        },
                        {
                            "name": "南雄市",
                            "pId": "4402",
                            "id": "440282",
                            "fullname": "广东省韶关市南雄市"
                        }
                    ]
                },
                {
                    "name": "深圳市",
                    "pId": "44",
                    "id": "4403",
                    "fullname": "广东省深圳市",
                    "items": [
                        {
                            "name": "罗湖区",
                            "pId": "4403",
                            "id": "440303",
                            "fullname": "广东省深圳市罗湖区"
                        },
                        {
                            "name": "福田区",
                            "pId": "4403",
                            "id": "440304",
                            "fullname": "广东省深圳市福田区"
                        },
                        {
                            "name": "南山区",
                            "pId": "4403",
                            "id": "440305",
                            "fullname": "广东省深圳市南山区"
                        },
                        {
                            "name": "宝安区",
                            "pId": "4403",
                            "id": "440306",
                            "fullname": "广东省深圳市宝安区"
                        },
                        {
                            "name": "龙岗区",
                            "pId": "4403",
                            "id": "440307",
                            "fullname": "广东省深圳市龙岗区"
                        },
                        {
                            "name": "盐田区",
                            "pId": "4403",
                            "id": "440308",
                            "fullname": "广东省深圳市盐田区"
                        },
                        {
                            "name": "光明新区",
                            "pId": "4403",
                            "id": "c4e299828b974a97911e13b87b39a237",
                            "fullname": "广东省深圳市光明新区"
                        }
                    ]
                },
                {
                    "name": "珠海市",
                    "pId": "44",
                    "id": "4404",
                    "fullname": "广东省珠海市",
                    "items": [
                        {
                            "name": "香洲区",
                            "pId": "4404",
                            "id": "440402",
                            "fullname": "广东省珠海市香洲区"
                        },
                        {
                            "name": "斗门区",
                            "pId": "4404",
                            "id": "440403",
                            "fullname": "广东省珠海市斗门区"
                        },
                        {
                            "name": "金湾区",
                            "pId": "4404",
                            "id": "440404",
                            "fullname": "广东省珠海市金湾区"
                        }
                    ]
                },
                {
                    "name": "汕头市",
                    "pId": "44",
                    "id": "4405",
                    "fullname": "广东省汕头市",
                    "items": [
                        {
                            "name": "龙湖区",
                            "pId": "4405",
                            "id": "440507",
                            "fullname": "广东省汕头市龙湖区"
                        },
                        {
                            "name": "金平区",
                            "pId": "4405",
                            "id": "440511",
                            "fullname": "广东省汕头市金平区"
                        },
                        {
                            "name": "濠江区",
                            "pId": "4405",
                            "id": "440512",
                            "fullname": "广东省汕头市濠江区"
                        },
                        {
                            "name": "潮阳区",
                            "pId": "4405",
                            "id": "440513",
                            "fullname": "广东省汕头市潮阳区"
                        },
                        {
                            "name": "潮南区",
                            "pId": "4405",
                            "id": "440514",
                            "fullname": "广东省汕头市潮南区"
                        },
                        {
                            "name": "澄海区",
                            "pId": "4405",
                            "id": "440515",
                            "fullname": "广东省汕头市澄海区"
                        },
                        {
                            "name": "南澳县",
                            "pId": "4405",
                            "id": "440523",
                            "fullname": "广东省汕头市南澳县"
                        }
                    ]
                },
                {
                    "name": "佛山市",
                    "pId": "44",
                    "id": "4406",
                    "fullname": "广东省佛山市",
                    "items": [
                        {
                            "name": "禅城区",
                            "pId": "4406",
                            "id": "440604",
                            "fullname": "广东省佛山市禅城区"
                        },
                        {
                            "name": "南海区",
                            "pId": "4406",
                            "id": "440605",
                            "fullname": "广东省佛山市南海区"
                        },
                        {
                            "name": "顺德区",
                            "pId": "4406",
                            "id": "440606",
                            "fullname": "广东省佛山市顺德区"
                        },
                        {
                            "name": "三水区",
                            "pId": "4406",
                            "id": "440607",
                            "fullname": "广东省佛山市三水区"
                        },
                        {
                            "name": "高明区",
                            "pId": "4406",
                            "id": "440608",
                            "fullname": "广东省佛山市高明区"
                        }
                    ]
                },
                {
                    "name": "江门市",
                    "pId": "44",
                    "id": "4407",
                    "fullname": "广东省江门市",
                    "items": [
                        {
                            "name": "蓬江区",
                            "pId": "4407",
                            "id": "440703",
                            "fullname": "广东省江门市蓬江区"
                        },
                        {
                            "name": "江海区",
                            "pId": "4407",
                            "id": "440704",
                            "fullname": "广东省江门市江海区"
                        },
                        {
                            "name": "新会区",
                            "pId": "4407",
                            "id": "440705",
                            "fullname": "广东省江门市新会区"
                        },
                        {
                            "name": "台山市",
                            "pId": "4407",
                            "id": "440781",
                            "fullname": "广东省江门市台山市"
                        },
                        {
                            "name": "开平市",
                            "pId": "4407",
                            "id": "440783",
                            "fullname": "广东省江门市开平市"
                        },
                        {
                            "name": "鹤山市",
                            "pId": "4407",
                            "id": "440784",
                            "fullname": "广东省江门市鹤山市"
                        },
                        {
                            "name": "恩平市",
                            "pId": "4407",
                            "id": "440785",
                            "fullname": "广东省江门市恩平市"
                        }
                    ]
                },
                {
                    "name": "湛江市",
                    "pId": "44",
                    "id": "4408",
                    "fullname": "广东省湛江市",
                    "items": [
                        {
                            "name": "赤坎区",
                            "pId": "4408",
                            "id": "440802",
                            "fullname": "广东省湛江市赤坎区"
                        },
                        {
                            "name": "霞山区",
                            "pId": "4408",
                            "id": "440803",
                            "fullname": "广东省湛江市霞山区"
                        },
                        {
                            "name": "坡头区",
                            "pId": "4408",
                            "id": "440804",
                            "fullname": "广东省湛江市坡头区"
                        },
                        {
                            "name": "麻章区",
                            "pId": "4408",
                            "id": "440811",
                            "fullname": "广东省湛江市麻章区"
                        },
                        {
                            "name": "遂溪县",
                            "pId": "4408",
                            "id": "440823",
                            "fullname": "广东省湛江市遂溪县"
                        },
                        {
                            "name": "徐闻县",
                            "pId": "4408",
                            "id": "440825",
                            "fullname": "广东省湛江市徐闻县"
                        },
                        {
                            "name": "廉江市",
                            "pId": "4408",
                            "id": "440881",
                            "fullname": "广东省湛江市廉江市"
                        },
                        {
                            "name": "雷州市",
                            "pId": "4408",
                            "id": "440882",
                            "fullname": "广东省湛江市雷州市"
                        },
                        {
                            "name": "吴川市",
                            "pId": "4408",
                            "id": "440883",
                            "fullname": "广东省湛江市吴川市"
                        }
                    ]
                },
                {
                    "name": "茂名市",
                    "pId": "44",
                    "id": "4409",
                    "fullname": "广东省茂名市",
                    "items": [
                        {
                            "name": "茂南区",
                            "pId": "4409",
                            "id": "440902",
                            "fullname": "广东省茂名市茂南区"
                        },
                        {
                            "name": "茂港区",
                            "pId": "4409",
                            "id": "440903",
                            "fullname": "广东省茂名市茂港区"
                        },
                        {
                            "name": "电白县",
                            "pId": "4409",
                            "id": "440923",
                            "fullname": "广东省茂名市电白县"
                        },
                        {
                            "name": "高州市",
                            "pId": "4409",
                            "id": "440981",
                            "fullname": "广东省茂名市高州市"
                        },
                        {
                            "name": "化州市",
                            "pId": "4409",
                            "id": "440982",
                            "fullname": "广东省茂名市化州市"
                        },
                        {
                            "name": "信宜市",
                            "pId": "4409",
                            "id": "440983",
                            "fullname": "广东省茂名市信宜市"
                        }
                    ]
                },
                {
                    "name": "肇庆市",
                    "pId": "44",
                    "id": "4412",
                    "fullname": "广东省肇庆市",
                    "items": [
                        {
                            "name": "端州区",
                            "pId": "4412",
                            "id": "441202",
                            "fullname": "广东省肇庆市端州区"
                        },
                        {
                            "name": "鼎湖区",
                            "pId": "4412",
                            "id": "441203",
                            "fullname": "广东省肇庆市鼎湖区"
                        },
                        {
                            "name": "广宁县",
                            "pId": "4412",
                            "id": "441223",
                            "fullname": "广东省肇庆市广宁县"
                        },
                        {
                            "name": "怀集县",
                            "pId": "4412",
                            "id": "441224",
                            "fullname": "广东省肇庆市怀集县"
                        },
                        {
                            "name": "封开县",
                            "pId": "4412",
                            "id": "441225",
                            "fullname": "广东省肇庆市封开县"
                        },
                        {
                            "name": "德庆县",
                            "pId": "4412",
                            "id": "441226",
                            "fullname": "广东省肇庆市德庆县"
                        },
                        {
                            "name": "高要市",
                            "pId": "4412",
                            "id": "441283",
                            "fullname": "广东省肇庆市高要市"
                        },
                        {
                            "name": "四会市",
                            "pId": "4412",
                            "id": "441284",
                            "fullname": "广东省肇庆市四会市"
                        }
                    ]
                },
                {
                    "name": "惠州市",
                    "pId": "44",
                    "id": "4413",
                    "fullname": "广东省惠州市",
                    "items": [
                        {
                            "name": "惠城区",
                            "pId": "4413",
                            "id": "441302",
                            "fullname": "广东省惠州市惠城区"
                        },
                        {
                            "name": "惠阳区",
                            "pId": "4413",
                            "id": "441303",
                            "fullname": "广东省惠州市惠阳区"
                        },
                        {
                            "name": "博罗县",
                            "pId": "4413",
                            "id": "441322",
                            "fullname": "广东省惠州市博罗县"
                        },
                        {
                            "name": "惠东县",
                            "pId": "4413",
                            "id": "441323",
                            "fullname": "广东省惠州市惠东县"
                        },
                        {
                            "name": "龙门县",
                            "pId": "4413",
                            "id": "441324",
                            "fullname": "广东省惠州市龙门县"
                        }
                    ]
                },
                {
                    "name": "梅州市",
                    "pId": "44",
                    "id": "4414",
                    "fullname": "广东省梅州市",
                    "items": [
                        {
                            "name": "梅江区",
                            "pId": "4414",
                            "id": "441402",
                            "fullname": "广东省梅州市梅江区"
                        },
                        {
                            "name": "梅县",
                            "pId": "4414",
                            "id": "441421",
                            "fullname": "广东省梅州市梅县"
                        },
                        {
                            "name": "大埔县",
                            "pId": "4414",
                            "id": "441422",
                            "fullname": "广东省梅州市大埔县"
                        },
                        {
                            "name": "丰顺县",
                            "pId": "4414",
                            "id": "441423",
                            "fullname": "广东省梅州市丰顺县"
                        },
                        {
                            "name": "五华县",
                            "pId": "4414",
                            "id": "441424",
                            "fullname": "广东省梅州市五华县"
                        },
                        {
                            "name": "平远县",
                            "pId": "4414",
                            "id": "441426",
                            "fullname": "广东省梅州市平远县"
                        },
                        {
                            "name": "蕉岭县",
                            "pId": "4414",
                            "id": "441427",
                            "fullname": "广东省梅州市蕉岭县"
                        },
                        {
                            "name": "兴宁市",
                            "pId": "4414",
                            "id": "441481",
                            "fullname": "广东省梅州市兴宁市"
                        }
                    ]
                },
                {
                    "name": "汕尾市",
                    "pId": "44",
                    "id": "4415",
                    "fullname": "广东省汕尾市",
                    "items": [
                        {
                            "name": "城区",
                            "pId": "4415",
                            "id": "441502",
                            "fullname": "广东省汕尾市城区"
                        },
                        {
                            "name": "海丰县",
                            "pId": "4415",
                            "id": "441521",
                            "fullname": "广东省汕尾市海丰县"
                        },
                        {
                            "name": "陆河县",
                            "pId": "4415",
                            "id": "441523",
                            "fullname": "广东省汕尾市陆河县"
                        },
                        {
                            "name": "陆丰市",
                            "pId": "4415",
                            "id": "441581",
                            "fullname": "广东省汕尾市陆丰市"
                        }
                    ]
                },
                {
                    "name": "河源市",
                    "pId": "44",
                    "id": "4416",
                    "fullname": "广东省河源市",
                    "items": [
                        {
                            "name": "源城区",
                            "pId": "4416",
                            "id": "441602",
                            "fullname": "广东省河源市源城区"
                        },
                        {
                            "name": "紫金县",
                            "pId": "4416",
                            "id": "441621",
                            "fullname": "广东省河源市紫金县"
                        },
                        {
                            "name": "龙川县",
                            "pId": "4416",
                            "id": "441622",
                            "fullname": "广东省河源市龙川县"
                        },
                        {
                            "name": "连平县",
                            "pId": "4416",
                            "id": "441623",
                            "fullname": "广东省河源市连平县"
                        },
                        {
                            "name": "和平县",
                            "pId": "4416",
                            "id": "441624",
                            "fullname": "广东省河源市和平县"
                        },
                        {
                            "name": "东源县",
                            "pId": "4416",
                            "id": "441625",
                            "fullname": "广东省河源市东源县"
                        }
                    ]
                },
                {
                    "name": "阳江市",
                    "pId": "44",
                    "id": "4417",
                    "fullname": "广东省阳江市",
                    "items": [
                        {
                            "name": "江城区",
                            "pId": "4417",
                            "id": "441702",
                            "fullname": "广东省阳江市江城区"
                        },
                        {
                            "name": "阳西县",
                            "pId": "4417",
                            "id": "441721",
                            "fullname": "广东省阳江市阳西县"
                        },
                        {
                            "name": "阳东县",
                            "pId": "4417",
                            "id": "441723",
                            "fullname": "广东省阳江市阳东县"
                        },
                        {
                            "name": "阳春市",
                            "pId": "4417",
                            "id": "441781",
                            "fullname": "广东省阳江市阳春市"
                        }
                    ]
                },
                {
                    "name": "清远市",
                    "pId": "44",
                    "id": "4418",
                    "fullname": "广东省清远市",
                    "items": [
                        {
                            "name": "清城区",
                            "pId": "4418",
                            "id": "441802",
                            "fullname": "广东省清远市清城区"
                        },
                        {
                            "name": "清新区",
                            "pId": "4418",
                            "id": "441803",
                            "fullname": "广东省清远市清新区"
                        },
                        {
                            "name": "佛冈县",
                            "pId": "4418",
                            "id": "441821",
                            "fullname": "广东省清远市佛冈县"
                        },
                        {
                            "name": "阳山县",
                            "pId": "4418",
                            "id": "441823",
                            "fullname": "广东省清远市阳山县"
                        },
                        {
                            "name": "连山壮族瑶族自治县",
                            "pId": "4418",
                            "id": "441825",
                            "fullname": "广东省清远市连山壮族瑶族自治县"
                        },
                        {
                            "name": "连南瑶族自治县",
                            "pId": "4418",
                            "id": "441826",
                            "fullname": "广东省清远市连南瑶族自治县"
                        },
                        {
                            "name": "英德市",
                            "pId": "4418",
                            "id": "441881",
                            "fullname": "广东省清远市英德市"
                        },
                        {
                            "name": "连州市",
                            "pId": "4418",
                            "id": "441882",
                            "fullname": "广东省清远市连州市"
                        }
                    ]
                },
                {
                    "name": "东莞市",
                    "pId": "44",
                    "id": "4419",
                    "fullname": "广东省东莞市",
                    "items": []
                },
                {
                    "name": "中山市",
                    "pId": "44",
                    "id": "4420",
                    "fullname": "广东省中山市",
                    "items": []
                },
                {
                    "name": "潮州市",
                    "pId": "44",
                    "id": "4451",
                    "fullname": "广东省潮州市",
                    "items": [
                        {
                            "name": "湘桥区",
                            "pId": "4451",
                            "id": "445102",
                            "fullname": "广东省潮州市湘桥区"
                        },
                        {
                            "name": "潮安区",
                            "pId": "4451",
                            "id": "445103",
                            "fullname": "广东省潮州市潮安区"
                        },
                        {
                            "name": "饶平县",
                            "pId": "4451",
                            "id": "445122",
                            "fullname": "广东省潮州市饶平县"
                        }
                    ]
                },
                {
                    "name": "揭阳市",
                    "pId": "44",
                    "id": "4452",
                    "fullname": "广东省揭阳市",
                    "items": [
                        {
                            "name": "榕城区",
                            "pId": "4452",
                            "id": "445202",
                            "fullname": "广东省揭阳市榕城区"
                        },
                        {
                            "name": "揭东区",
                            "pId": "4452",
                            "id": "445203",
                            "fullname": "广东省揭阳市揭东区"
                        },
                        {
                            "name": "揭西县",
                            "pId": "4452",
                            "id": "445222",
                            "fullname": "广东省揭阳市揭西县"
                        },
                        {
                            "name": "惠来县",
                            "pId": "4452",
                            "id": "445224",
                            "fullname": "广东省揭阳市惠来县"
                        },
                        {
                            "name": "普宁市",
                            "pId": "4452",
                            "id": "445281",
                            "fullname": "广东省揭阳市普宁市"
                        }
                    ]
                },
                {
                    "name": "云浮市",
                    "pId": "44",
                    "id": "4453",
                    "fullname": "广东省云浮市",
                    "items": [
                        {
                            "name": "云城区",
                            "pId": "4453",
                            "id": "445302",
                            "fullname": "广东省云浮市云城区"
                        },
                        {
                            "name": "新兴县",
                            "pId": "4453",
                            "id": "445321",
                            "fullname": "广东省云浮市新兴县"
                        },
                        {
                            "name": "郁南县",
                            "pId": "4453",
                            "id": "445322",
                            "fullname": "广东省云浮市郁南县"
                        },
                        {
                            "name": "云安县",
                            "pId": "4453",
                            "id": "445323",
                            "fullname": "广东省云浮市云安县"
                        },
                        {
                            "name": "罗定市",
                            "pId": "4453",
                            "id": "445381",
                            "fullname": "广东省云浮市罗定市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "广西壮族自治区",
            "pId": "1",
            "id": "45",
            "fullname": "广西壮族自治区",
            "items": [
                {
                    "name": "南宁市",
                    "pId": "45",
                    "id": "4501",
                    "fullname": "广西壮族自治区南宁市",
                    "items": [
                        {
                            "name": "兴宁区",
                            "pId": "4501",
                            "id": "450102",
                            "fullname": "广西壮族自治区南宁市兴宁区"
                        },
                        {
                            "name": "青秀区",
                            "pId": "4501",
                            "id": "450103",
                            "fullname": "广西壮族自治区南宁市青秀区"
                        },
                        {
                            "name": "江南区",
                            "pId": "4501",
                            "id": "450105",
                            "fullname": "广西壮族自治区南宁市江南区"
                        },
                        {
                            "name": "西乡塘区",
                            "pId": "4501",
                            "id": "450107",
                            "fullname": "广西壮族自治区南宁市西乡塘区"
                        },
                        {
                            "name": "良庆区",
                            "pId": "4501",
                            "id": "450108",
                            "fullname": "广西壮族自治区南宁市良庆区"
                        },
                        {
                            "name": "邕宁区",
                            "pId": "4501",
                            "id": "450109",
                            "fullname": "广西壮族自治区南宁市邕宁区"
                        },
                        {
                            "name": "武鸣县",
                            "pId": "4501",
                            "id": "450122",
                            "fullname": "广西壮族自治区南宁市武鸣县"
                        },
                        {
                            "name": "隆安县",
                            "pId": "4501",
                            "id": "450123",
                            "fullname": "广西壮族自治区南宁市隆安县"
                        },
                        {
                            "name": "马山县",
                            "pId": "4501",
                            "id": "450124",
                            "fullname": "广西壮族自治区南宁市马山县"
                        },
                        {
                            "name": "上林县",
                            "pId": "4501",
                            "id": "450125",
                            "fullname": "广西壮族自治区南宁市上林县"
                        },
                        {
                            "name": "宾阳县",
                            "pId": "4501",
                            "id": "450126",
                            "fullname": "广西壮族自治区南宁市宾阳县"
                        },
                        {
                            "name": "横县",
                            "pId": "4501",
                            "id": "450127",
                            "fullname": "广西壮族自治区南宁市横县"
                        }
                    ]
                },
                {
                    "name": "柳州市",
                    "pId": "45",
                    "id": "4502",
                    "fullname": "广西壮族自治区柳州市",
                    "items": [
                        {
                            "name": "城中区",
                            "pId": "4502",
                            "id": "450202",
                            "fullname": "广西壮族自治区柳州市城中区"
                        },
                        {
                            "name": "鱼峰区",
                            "pId": "4502",
                            "id": "450203",
                            "fullname": "广西壮族自治区柳州市鱼峰区"
                        },
                        {
                            "name": "柳南区",
                            "pId": "4502",
                            "id": "450204",
                            "fullname": "广西壮族自治区柳州市柳南区"
                        },
                        {
                            "name": "柳北区",
                            "pId": "4502",
                            "id": "450205",
                            "fullname": "广西壮族自治区柳州市柳北区"
                        },
                        {
                            "name": "柳江县",
                            "pId": "4502",
                            "id": "450221",
                            "fullname": "广西壮族自治区柳州市柳江县"
                        },
                        {
                            "name": "柳城县",
                            "pId": "4502",
                            "id": "450222",
                            "fullname": "广西壮族自治区柳州市柳城县"
                        },
                        {
                            "name": "鹿寨县",
                            "pId": "4502",
                            "id": "450223",
                            "fullname": "广西壮族自治区柳州市鹿寨县"
                        },
                        {
                            "name": "融安县",
                            "pId": "4502",
                            "id": "450224",
                            "fullname": "广西壮族自治区柳州市融安县"
                        },
                        {
                            "name": "融水苗族自治县",
                            "pId": "4502",
                            "id": "450225",
                            "fullname": "广西壮族自治区柳州市融水苗族自治县"
                        },
                        {
                            "name": "三江侗族自治县",
                            "pId": "4502",
                            "id": "450226",
                            "fullname": "广西壮族自治区柳州市三江侗族自治县"
                        }
                    ]
                },
                {
                    "name": "桂林市",
                    "pId": "45",
                    "id": "4503",
                    "fullname": "广西壮族自治区桂林市",
                    "items": [
                        {
                            "name": "秀峰区",
                            "pId": "4503",
                            "id": "450302",
                            "fullname": "广西壮族自治区桂林市秀峰区"
                        },
                        {
                            "name": "叠彩区",
                            "pId": "4503",
                            "id": "450303",
                            "fullname": "广西壮族自治区桂林市叠彩区"
                        },
                        {
                            "name": "象山区",
                            "pId": "4503",
                            "id": "450304",
                            "fullname": "广西壮族自治区桂林市象山区"
                        },
                        {
                            "name": "七星区",
                            "pId": "4503",
                            "id": "450305",
                            "fullname": "广西壮族自治区桂林市七星区"
                        },
                        {
                            "name": "雁山区",
                            "pId": "4503",
                            "id": "450311",
                            "fullname": "广西壮族自治区桂林市雁山区"
                        },
                        {
                            "name": "临桂区",
                            "pId": "4503",
                            "id": "450312",
                            "fullname": "广西壮族自治区桂林市临桂区"
                        },
                        {
                            "name": "阳朔县",
                            "pId": "4503",
                            "id": "450321",
                            "fullname": "广西壮族自治区桂林市阳朔县"
                        },
                        {
                            "name": "灵川县",
                            "pId": "4503",
                            "id": "450323",
                            "fullname": "广西壮族自治区桂林市灵川县"
                        },
                        {
                            "name": "全州县",
                            "pId": "4503",
                            "id": "450324",
                            "fullname": "广西壮族自治区桂林市全州县"
                        },
                        {
                            "name": "兴安县",
                            "pId": "4503",
                            "id": "450325",
                            "fullname": "广西壮族自治区桂林市兴安县"
                        },
                        {
                            "name": "永福县",
                            "pId": "4503",
                            "id": "450326",
                            "fullname": "广西壮族自治区桂林市永福县"
                        },
                        {
                            "name": "灌阳县",
                            "pId": "4503",
                            "id": "450327",
                            "fullname": "广西壮族自治区桂林市灌阳县"
                        },
                        {
                            "name": "龙胜各族自治县",
                            "pId": "4503",
                            "id": "450328",
                            "fullname": "广西壮族自治区桂林市龙胜各族自治县"
                        },
                        {
                            "name": "资源县",
                            "pId": "4503",
                            "id": "450329",
                            "fullname": "广西壮族自治区桂林市资源县"
                        },
                        {
                            "name": "平乐县",
                            "pId": "4503",
                            "id": "450330",
                            "fullname": "广西壮族自治区桂林市平乐县"
                        },
                        {
                            "name": "荔浦县",
                            "pId": "4503",
                            "id": "450331",
                            "fullname": "广西壮族自治区桂林市荔浦县"
                        },
                        {
                            "name": "恭城瑶族自治县",
                            "pId": "4503",
                            "id": "450332",
                            "fullname": "广西壮族自治区桂林市恭城瑶族自治县"
                        }
                    ]
                },
                {
                    "name": "梧州市",
                    "pId": "45",
                    "id": "4504",
                    "fullname": "广西壮族自治区梧州市",
                    "items": [
                        {
                            "name": "万秀区",
                            "pId": "4504",
                            "id": "450403",
                            "fullname": "广西壮族自治区梧州市万秀区"
                        },
                        {
                            "name": "长洲区",
                            "pId": "4504",
                            "id": "450405",
                            "fullname": "广西壮族自治区梧州市长洲区"
                        },
                        {
                            "name": "龙圩区",
                            "pId": "4504",
                            "id": "450406",
                            "fullname": "广西壮族自治区梧州市龙圩区"
                        },
                        {
                            "name": "苍梧县",
                            "pId": "4504",
                            "id": "450421",
                            "fullname": "广西壮族自治区梧州市苍梧县"
                        },
                        {
                            "name": "藤县",
                            "pId": "4504",
                            "id": "450422",
                            "fullname": "广西壮族自治区梧州市藤县"
                        },
                        {
                            "name": "蒙山县",
                            "pId": "4504",
                            "id": "450423",
                            "fullname": "广西壮族自治区梧州市蒙山县"
                        },
                        {
                            "name": "岑溪市",
                            "pId": "4504",
                            "id": "450481",
                            "fullname": "广西壮族自治区梧州市岑溪市"
                        }
                    ]
                },
                {
                    "name": "北海市",
                    "pId": "45",
                    "id": "4505",
                    "fullname": "广西壮族自治区北海市",
                    "items": [
                        {
                            "name": "海城区",
                            "pId": "4505",
                            "id": "450502",
                            "fullname": "广西壮族自治区北海市海城区"
                        },
                        {
                            "name": "银海区",
                            "pId": "4505",
                            "id": "450503",
                            "fullname": "广西壮族自治区北海市银海区"
                        },
                        {
                            "name": "铁山港区",
                            "pId": "4505",
                            "id": "450512",
                            "fullname": "广西壮族自治区北海市铁山港区"
                        },
                        {
                            "name": "合浦县",
                            "pId": "4505",
                            "id": "450521",
                            "fullname": "广西壮族自治区北海市合浦县"
                        }
                    ]
                },
                {
                    "name": "防城港市",
                    "pId": "45",
                    "id": "4506",
                    "fullname": "广西壮族自治区防城港市",
                    "items": [
                        {
                            "name": "港口区",
                            "pId": "4506",
                            "id": "450602",
                            "fullname": "广西壮族自治区防城港市港口区"
                        },
                        {
                            "name": "防城区",
                            "pId": "4506",
                            "id": "450603",
                            "fullname": "广西壮族自治区防城港市防城区"
                        },
                        {
                            "name": "上思县",
                            "pId": "4506",
                            "id": "450621",
                            "fullname": "广西壮族自治区防城港市上思县"
                        },
                        {
                            "name": "东兴市",
                            "pId": "4506",
                            "id": "450681",
                            "fullname": "广西壮族自治区防城港市东兴市"
                        }
                    ]
                },
                {
                    "name": "钦州市",
                    "pId": "45",
                    "id": "4507",
                    "fullname": "广西壮族自治区钦州市",
                    "items": [
                        {
                            "name": "钦南区",
                            "pId": "4507",
                            "id": "450702",
                            "fullname": "广西壮族自治区钦州市钦南区"
                        },
                        {
                            "name": "钦北区",
                            "pId": "4507",
                            "id": "450703",
                            "fullname": "广西壮族自治区钦州市钦北区"
                        },
                        {
                            "name": "灵山县",
                            "pId": "4507",
                            "id": "450721",
                            "fullname": "广西壮族自治区钦州市灵山县"
                        },
                        {
                            "name": "浦北县",
                            "pId": "4507",
                            "id": "450722",
                            "fullname": "广西壮族自治区钦州市浦北县"
                        }
                    ]
                },
                {
                    "name": "贵港市",
                    "pId": "45",
                    "id": "4508",
                    "fullname": "广西壮族自治区贵港市",
                    "items": [
                        {
                            "name": "港北区",
                            "pId": "4508",
                            "id": "450802",
                            "fullname": "广西壮族自治区贵港市港北区"
                        },
                        {
                            "name": "港南区",
                            "pId": "4508",
                            "id": "450803",
                            "fullname": "广西壮族自治区贵港市港南区"
                        },
                        {
                            "name": "覃塘区",
                            "pId": "4508",
                            "id": "450804",
                            "fullname": "广西壮族自治区贵港市覃塘区"
                        },
                        {
                            "name": "平南县",
                            "pId": "4508",
                            "id": "450821",
                            "fullname": "广西壮族自治区贵港市平南县"
                        },
                        {
                            "name": "桂平市",
                            "pId": "4508",
                            "id": "450881",
                            "fullname": "广西壮族自治区贵港市桂平市"
                        }
                    ]
                },
                {
                    "name": "玉林市",
                    "pId": "45",
                    "id": "4509",
                    "fullname": "广西壮族自治区玉林市",
                    "items": [
                        {
                            "name": "玉州区",
                            "pId": "4509",
                            "id": "450902",
                            "fullname": "广西壮族自治区玉林市玉州区"
                        },
                        {
                            "name": "福绵区",
                            "pId": "4509",
                            "id": "450903",
                            "fullname": "广西壮族自治区玉林市福绵区"
                        },
                        {
                            "name": "容县",
                            "pId": "4509",
                            "id": "450921",
                            "fullname": "广西壮族自治区玉林市容县"
                        },
                        {
                            "name": "陆川县",
                            "pId": "4509",
                            "id": "450922",
                            "fullname": "广西壮族自治区玉林市陆川县"
                        },
                        {
                            "name": "博白县",
                            "pId": "4509",
                            "id": "450923",
                            "fullname": "广西壮族自治区玉林市博白县"
                        },
                        {
                            "name": "兴业县",
                            "pId": "4509",
                            "id": "450924",
                            "fullname": "广西壮族自治区玉林市兴业县"
                        },
                        {
                            "name": "北流市",
                            "pId": "4509",
                            "id": "450981",
                            "fullname": "广西壮族自治区玉林市北流市"
                        }
                    ]
                },
                {
                    "name": "百色市",
                    "pId": "45",
                    "id": "4510",
                    "fullname": "广西壮族自治区百色市",
                    "items": [
                        {
                            "name": "右江区",
                            "pId": "4510",
                            "id": "451002",
                            "fullname": "广西壮族自治区百色市右江区"
                        },
                        {
                            "name": "田阳县",
                            "pId": "4510",
                            "id": "451021",
                            "fullname": "广西壮族自治区百色市田阳县"
                        },
                        {
                            "name": "田东县",
                            "pId": "4510",
                            "id": "451022",
                            "fullname": "广西壮族自治区百色市田东县"
                        },
                        {
                            "name": "平果县",
                            "pId": "4510",
                            "id": "451023",
                            "fullname": "广西壮族自治区百色市平果县"
                        },
                        {
                            "name": "德保县",
                            "pId": "4510",
                            "id": "451024",
                            "fullname": "广西壮族自治区百色市德保县"
                        },
                        {
                            "name": "靖西县",
                            "pId": "4510",
                            "id": "451025",
                            "fullname": "广西壮族自治区百色市靖西县"
                        },
                        {
                            "name": "那坡县",
                            "pId": "4510",
                            "id": "451026",
                            "fullname": "广西壮族自治区百色市那坡县"
                        },
                        {
                            "name": "凌云县",
                            "pId": "4510",
                            "id": "451027",
                            "fullname": "广西壮族自治区百色市凌云县"
                        },
                        {
                            "name": "乐业县",
                            "pId": "4510",
                            "id": "451028",
                            "fullname": "广西壮族自治区百色市乐业县"
                        },
                        {
                            "name": "田林县",
                            "pId": "4510",
                            "id": "451029",
                            "fullname": "广西壮族自治区百色市田林县"
                        },
                        {
                            "name": "西林县",
                            "pId": "4510",
                            "id": "451030",
                            "fullname": "广西壮族自治区百色市西林县"
                        },
                        {
                            "name": "隆林各族自治县",
                            "pId": "4510",
                            "id": "451031",
                            "fullname": "广西壮族自治区百色市隆林各族自治县"
                        }
                    ]
                },
                {
                    "name": "贺州市",
                    "pId": "45",
                    "id": "4511",
                    "fullname": "广西壮族自治区贺州市",
                    "items": [
                        {
                            "name": "八步区",
                            "pId": "4511",
                            "id": "451102",
                            "fullname": "广西壮族自治区贺州市八步区"
                        },
                        {
                            "name": "昭平县",
                            "pId": "4511",
                            "id": "451121",
                            "fullname": "广西壮族自治区贺州市昭平县"
                        },
                        {
                            "name": "钟山县",
                            "pId": "4511",
                            "id": "451122",
                            "fullname": "广西壮族自治区贺州市钟山县"
                        },
                        {
                            "name": "富川瑶族自治县",
                            "pId": "4511",
                            "id": "451123",
                            "fullname": "广西壮族自治区贺州市富川瑶族自治县"
                        }
                    ]
                },
                {
                    "name": "河池市",
                    "pId": "45",
                    "id": "4512",
                    "fullname": "广西壮族自治区河池市",
                    "items": [
                        {
                            "name": "金城江区",
                            "pId": "4512",
                            "id": "451202",
                            "fullname": "广西壮族自治区河池市金城江区"
                        },
                        {
                            "name": "南丹县",
                            "pId": "4512",
                            "id": "451221",
                            "fullname": "广西壮族自治区河池市南丹县"
                        },
                        {
                            "name": "天峨县",
                            "pId": "4512",
                            "id": "451222",
                            "fullname": "广西壮族自治区河池市天峨县"
                        },
                        {
                            "name": "凤山县",
                            "pId": "4512",
                            "id": "451223",
                            "fullname": "广西壮族自治区河池市凤山县"
                        },
                        {
                            "name": "东兰县",
                            "pId": "4512",
                            "id": "451224",
                            "fullname": "广西壮族自治区河池市东兰县"
                        },
                        {
                            "name": "罗城仫佬族自治县",
                            "pId": "4512",
                            "id": "451225",
                            "fullname": "广西壮族自治区河池市罗城仫佬族自治县"
                        },
                        {
                            "name": "环江毛南族自治县",
                            "pId": "4512",
                            "id": "451226",
                            "fullname": "广西壮族自治区河池市环江毛南族自治县"
                        },
                        {
                            "name": "巴马瑶族自治县",
                            "pId": "4512",
                            "id": "451227",
                            "fullname": "广西壮族自治区河池市巴马瑶族自治县"
                        },
                        {
                            "name": "都安瑶族自治县",
                            "pId": "4512",
                            "id": "451228",
                            "fullname": "广西壮族自治区河池市都安瑶族自治县"
                        },
                        {
                            "name": "大化瑶族自治县",
                            "pId": "4512",
                            "id": "451229",
                            "fullname": "广西壮族自治区河池市大化瑶族自治县"
                        },
                        {
                            "name": "宜州市",
                            "pId": "4512",
                            "id": "451281",
                            "fullname": "广西壮族自治区河池市宜州市"
                        }
                    ]
                },
                {
                    "name": "来宾市",
                    "pId": "45",
                    "id": "4513",
                    "fullname": "广西壮族自治区来宾市",
                    "items": [
                        {
                            "name": "兴宾区",
                            "pId": "4513",
                            "id": "451302",
                            "fullname": "广西壮族自治区来宾市兴宾区"
                        },
                        {
                            "name": "忻城县",
                            "pId": "4513",
                            "id": "451321",
                            "fullname": "广西壮族自治区来宾市忻城县"
                        },
                        {
                            "name": "象州县",
                            "pId": "4513",
                            "id": "451322",
                            "fullname": "广西壮族自治区来宾市象州县"
                        },
                        {
                            "name": "武宣县",
                            "pId": "4513",
                            "id": "451323",
                            "fullname": "广西壮族自治区来宾市武宣县"
                        },
                        {
                            "name": "金秀瑶族自治县",
                            "pId": "4513",
                            "id": "451324",
                            "fullname": "广西壮族自治区来宾市金秀瑶族自治县"
                        },
                        {
                            "name": "合山市",
                            "pId": "4513",
                            "id": "451381",
                            "fullname": "广西壮族自治区来宾市合山市"
                        }
                    ]
                },
                {
                    "name": "崇左市",
                    "pId": "45",
                    "id": "4514",
                    "fullname": "广西壮族自治区崇左市",
                    "items": [
                        {
                            "name": "江州区",
                            "pId": "4514",
                            "id": "451402",
                            "fullname": "广西壮族自治区崇左市江州区"
                        },
                        {
                            "name": "扶绥县",
                            "pId": "4514",
                            "id": "451421",
                            "fullname": "广西壮族自治区崇左市扶绥县"
                        },
                        {
                            "name": "宁明县",
                            "pId": "4514",
                            "id": "451422",
                            "fullname": "广西壮族自治区崇左市宁明县"
                        },
                        {
                            "name": "龙州县",
                            "pId": "4514",
                            "id": "451423",
                            "fullname": "广西壮族自治区崇左市龙州县"
                        },
                        {
                            "name": "大新县",
                            "pId": "4514",
                            "id": "451424",
                            "fullname": "广西壮族自治区崇左市大新县"
                        },
                        {
                            "name": "天等县",
                            "pId": "4514",
                            "id": "451425",
                            "fullname": "广西壮族自治区崇左市天等县"
                        },
                        {
                            "name": "凭祥市",
                            "pId": "4514",
                            "id": "451481",
                            "fullname": "广西壮族自治区崇左市凭祥市"
                        }
                    ]
                }
            ]
        },
        {
            "name": "海南省",
            "pId": "1",
            "id": "46",
            "fullname": "海南省",
            "items": [
                {
                    "name": "海口市",
                    "pId": "46",
                    "id": "4601",
                    "fullname": "海南省海口市",
                    "items": [
                        {
                            "name": "秀英区",
                            "pId": "4601",
                            "id": "460105",
                            "fullname": "海南省海口市秀英区"
                        },
                        {
                            "name": "龙华区",
                            "pId": "4601",
                            "id": "460106",
                            "fullname": "海南省海口市龙华区"
                        },
                        {
                            "name": "琼山区",
                            "pId": "4601",
                            "id": "460107",
                            "fullname": "海南省海口市琼山区"
                        },
                        {
                            "name": "美兰区",
                            "pId": "4601",
                            "id": "460108",
                            "fullname": "海南省海口市美兰区"
                        }
                    ]
                },
                {
                    "name": "三亚市",
                    "pId": "46",
                    "id": "4602",
                    "fullname": "海南省三亚市",
                    "items": [
                        {
                            "name": "市辖区",
                            "pId": "4602",
                            "id": "460201",
                            "fullname": "海南省三亚市市辖区"
                        }
                    ]
                },
                {
                    "name": "三沙市",
                    "pId": "46",
                    "id": "4603",
                    "fullname": "海南省三沙市",
                    "items": [
                        {
                            "name": "西沙群岛",
                            "pId": "4603",
                            "id": "460321",
                            "fullname": "海南省三沙市西沙群岛"
                        },
                        {
                            "name": "南沙群岛",
                            "pId": "4603",
                            "id": "460322",
                            "fullname": "海南省三沙市南沙群岛"
                        },
                        {
                            "name": "中沙群岛的岛礁及其海域",
                            "pId": "4603",
                            "id": "460323",
                            "fullname": "海南省三沙市中沙群岛的岛礁及其海域"
                        }
                    ]
                },
                {
                    "name": "省直辖县级行政区划",
                    "pId": "46",
                    "id": "4690",
                    "fullname": "海南省省直辖县级行政区划",
                    "items": [
                        {
                            "name": "五指山市",
                            "pId": "4690",
                            "id": "469001",
                            "fullname": "海南省省直辖县级行政区划五指山市"
                        },
                        {
                            "name": "琼海市",
                            "pId": "4690",
                            "id": "469002",
                            "fullname": "海南省省直辖县级行政区划琼海市"
                        },
                        {
                            "name": "儋州市",
                            "pId": "4690",
                            "id": "469003",
                            "fullname": "海南省省直辖县级行政区划儋州市"
                        },
                        {
                            "name": "文昌市",
                            "pId": "4690",
                            "id": "469005",
                            "fullname": "海南省省直辖县级行政区划文昌市"
                        },
                        {
                            "name": "万宁市",
                            "pId": "4690",
                            "id": "469006",
                            "fullname": "海南省省直辖县级行政区划万宁市"
                        },
                        {
                            "name": "东方市",
                            "pId": "4690",
                            "id": "469007",
                            "fullname": "海南省省直辖县级行政区划东方市"
                        },
                        {
                            "name": "定安县",
                            "pId": "4690",
                            "id": "469021",
                            "fullname": "海南省省直辖县级行政区划定安县"
                        },
                        {
                            "name": "屯昌县",
                            "pId": "4690",
                            "id": "469022",
                            "fullname": "海南省省直辖县级行政区划屯昌县"
                        },
                        {
                            "name": "澄迈县",
                            "pId": "4690",
                            "id": "469023",
                            "fullname": "海南省省直辖县级行政区划澄迈县"
                        },
                        {
                            "name": "临高县",
                            "pId": "4690",
                            "id": "469024",
                            "fullname": "海南省省直辖县级行政区划临高县"
                        },
                        {
                            "name": "白沙黎族自治县",
                            "pId": "4690",
                            "id": "469025",
                            "fullname": "海南省省直辖县级行政区划白沙黎族自治县"
                        },
                        {
                            "name": "昌江黎族自治县",
                            "pId": "4690",
                            "id": "469026",
                            "fullname": "海南省省直辖县级行政区划昌江黎族自治县"
                        },
                        {
                            "name": "乐东黎族自治县",
                            "pId": "4690",
                            "id": "469027",
                            "fullname": "海南省省直辖县级行政区划乐东黎族自治县"
                        },
                        {
                            "name": "陵水黎族自治县",
                            "pId": "4690",
                            "id": "469028",
                            "fullname": "海南省省直辖县级行政区划陵水黎族自治县"
                        },
                        {
                            "name": "保亭黎族苗族自治县",
                            "pId": "4690",
                            "id": "469029",
                            "fullname": "海南省省直辖县级行政区划保亭黎族苗族自治县"
                        },
                        {
                            "name": "琼中黎族苗族自治县",
                            "pId": "4690",
                            "id": "469030",
                            "fullname": "海南省省直辖县级行政区划琼中黎族苗族自治县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "重庆市",
            "pId": "1",
            "id": "50",
            "fullname": "重庆市",
            "items": [
                {
                    "name": "市辖区",
                    "pId": "50",
                    "id": "5001",
                    "fullname": "重庆市市辖区",
                    "items": [
                        {
                            "name": "万州区",
                            "pId": "5001",
                            "id": "500101",
                            "fullname": "重庆市市辖区万州区"
                        },
                        {
                            "name": "涪陵区",
                            "pId": "5001",
                            "id": "500102",
                            "fullname": "重庆市市辖区涪陵区"
                        },
                        {
                            "name": "渝中区",
                            "pId": "5001",
                            "id": "500103",
                            "fullname": "重庆市市辖区渝中区"
                        },
                        {
                            "name": "大渡口区",
                            "pId": "5001",
                            "id": "500104",
                            "fullname": "重庆市市辖区大渡口区"
                        },
                        {
                            "name": "江北区",
                            "pId": "5001",
                            "id": "500105",
                            "fullname": "重庆市市辖区江北区"
                        },
                        {
                            "name": "沙坪坝区",
                            "pId": "5001",
                            "id": "500106",
                            "fullname": "重庆市市辖区沙坪坝区"
                        },
                        {
                            "name": "九龙坡区",
                            "pId": "5001",
                            "id": "500107",
                            "fullname": "重庆市市辖区九龙坡区"
                        },
                        {
                            "name": "南岸区",
                            "pId": "5001",
                            "id": "500108",
                            "fullname": "重庆市市辖区南岸区"
                        },
                        {
                            "name": "北碚区",
                            "pId": "5001",
                            "id": "500109",
                            "fullname": "重庆市市辖区北碚区"
                        },
                        {
                            "name": "綦江区",
                            "pId": "5001",
                            "id": "500110",
                            "fullname": "重庆市市辖区綦江区"
                        },
                        {
                            "name": "大足区",
                            "pId": "5001",
                            "id": "500111",
                            "fullname": "重庆市市辖区大足区"
                        },
                        {
                            "name": "渝北区",
                            "pId": "5001",
                            "id": "500112",
                            "fullname": "重庆市市辖区渝北区"
                        },
                        {
                            "name": "巴南区",
                            "pId": "5001",
                            "id": "500113",
                            "fullname": "重庆市市辖区巴南区"
                        },
                        {
                            "name": "黔江区",
                            "pId": "5001",
                            "id": "500114",
                            "fullname": "重庆市市辖区黔江区"
                        },
                        {
                            "name": "长寿区",
                            "pId": "5001",
                            "id": "500115",
                            "fullname": "重庆市市辖区长寿区"
                        },
                        {
                            "name": "江津区",
                            "pId": "5001",
                            "id": "500116",
                            "fullname": "重庆市市辖区江津区"
                        },
                        {
                            "name": "合川区",
                            "pId": "5001",
                            "id": "500117",
                            "fullname": "重庆市市辖区合川区"
                        },
                        {
                            "name": "永川区",
                            "pId": "5001",
                            "id": "500118",
                            "fullname": "重庆市市辖区永川区"
                        },
                        {
                            "name": "南川区",
                            "pId": "5001",
                            "id": "500119",
                            "fullname": "重庆市市辖区南川区"
                        }
                    ]
                },
                {
                    "name": "县",
                    "pId": "50",
                    "id": "5002",
                    "fullname": "重庆市县",
                    "items": [
                        {
                            "name": "潼南县",
                            "pId": "5002",
                            "id": "500223",
                            "fullname": "重庆市县潼南县"
                        },
                        {
                            "name": "铜梁县",
                            "pId": "5002",
                            "id": "500224",
                            "fullname": "重庆市县铜梁县"
                        },
                        {
                            "name": "荣昌县",
                            "pId": "5002",
                            "id": "500226",
                            "fullname": "重庆市县荣昌县"
                        },
                        {
                            "name": "璧山县",
                            "pId": "5002",
                            "id": "500227",
                            "fullname": "重庆市县璧山县"
                        },
                        {
                            "name": "梁平县",
                            "pId": "5002",
                            "id": "500228",
                            "fullname": "重庆市县梁平县"
                        },
                        {
                            "name": "城口县",
                            "pId": "5002",
                            "id": "500229",
                            "fullname": "重庆市县城口县"
                        },
                        {
                            "name": "丰都县",
                            "pId": "5002",
                            "id": "500230",
                            "fullname": "重庆市县丰都县"
                        },
                        {
                            "name": "垫江县",
                            "pId": "5002",
                            "id": "500231",
                            "fullname": "重庆市县垫江县"
                        },
                        {
                            "name": "武隆县",
                            "pId": "5002",
                            "id": "500232",
                            "fullname": "重庆市县武隆县"
                        },
                        {
                            "name": "忠县",
                            "pId": "5002",
                            "id": "500233",
                            "fullname": "重庆市县忠县"
                        },
                        {
                            "name": "开县",
                            "pId": "5002",
                            "id": "500234",
                            "fullname": "重庆市县开县"
                        },
                        {
                            "name": "云阳县",
                            "pId": "5002",
                            "id": "500235",
                            "fullname": "重庆市县云阳县"
                        },
                        {
                            "name": "奉节县",
                            "pId": "5002",
                            "id": "500236",
                            "fullname": "重庆市县奉节县"
                        },
                        {
                            "name": "巫山县",
                            "pId": "5002",
                            "id": "500237",
                            "fullname": "重庆市县巫山县"
                        },
                        {
                            "name": "巫溪县",
                            "pId": "5002",
                            "id": "500238",
                            "fullname": "重庆市县巫溪县"
                        },
                        {
                            "name": "石柱土家族自治县",
                            "pId": "5002",
                            "id": "500240",
                            "fullname": "重庆市县石柱土家族自治县"
                        },
                        {
                            "name": "秀山土家族苗族自治县",
                            "pId": "5002",
                            "id": "500241",
                            "fullname": "重庆市县秀山土家族苗族自治县"
                        },
                        {
                            "name": "酉阳土家族苗族自治县",
                            "pId": "5002",
                            "id": "500242",
                            "fullname": "重庆市县酉阳土家族苗族自治县"
                        },
                        {
                            "name": "彭水苗族土家族自治县",
                            "pId": "5002",
                            "id": "500243",
                            "fullname": "重庆市县彭水苗族土家族自治县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "四川省",
            "pId": "1",
            "id": "51",
            "fullname": "四川省",
            "items": [
                {
                    "name": "成都市",
                    "pId": "51",
                    "id": "5101",
                    "fullname": "四川省成都市",
                    "items": [
                        {
                            "name": "锦江区",
                            "pId": "5101",
                            "id": "510104",
                            "fullname": "四川省成都市锦江区"
                        },
                        {
                            "name": "青羊区",
                            "pId": "5101",
                            "id": "510105",
                            "fullname": "四川省成都市青羊区"
                        },
                        {
                            "name": "金牛区",
                            "pId": "5101",
                            "id": "510106",
                            "fullname": "四川省成都市金牛区"
                        },
                        {
                            "name": "武侯区",
                            "pId": "5101",
                            "id": "510107",
                            "fullname": "四川省成都市武侯区"
                        },
                        {
                            "name": "成华区",
                            "pId": "5101",
                            "id": "510108",
                            "fullname": "四川省成都市成华区"
                        },
                        {
                            "name": "龙泉驿区",
                            "pId": "5101",
                            "id": "510112",
                            "fullname": "四川省成都市龙泉驿区"
                        },
                        {
                            "name": "青白江区",
                            "pId": "5101",
                            "id": "510113",
                            "fullname": "四川省成都市青白江区"
                        },
                        {
                            "name": "新都区",
                            "pId": "5101",
                            "id": "510114",
                            "fullname": "四川省成都市新都区"
                        },
                        {
                            "name": "温江区",
                            "pId": "5101",
                            "id": "510115",
                            "fullname": "四川省成都市温江区"
                        },
                        {
                            "name": "金堂县",
                            "pId": "5101",
                            "id": "510121",
                            "fullname": "四川省成都市金堂县"
                        },
                        {
                            "name": "双流县",
                            "pId": "5101",
                            "id": "510122",
                            "fullname": "四川省成都市双流县"
                        },
                        {
                            "name": "郫县",
                            "pId": "5101",
                            "id": "510124",
                            "fullname": "四川省成都市郫县"
                        },
                        {
                            "name": "大邑县",
                            "pId": "5101",
                            "id": "510129",
                            "fullname": "四川省成都市大邑县"
                        },
                        {
                            "name": "蒲江县",
                            "pId": "5101",
                            "id": "510131",
                            "fullname": "四川省成都市蒲江县"
                        },
                        {
                            "name": "新津县",
                            "pId": "5101",
                            "id": "510132",
                            "fullname": "四川省成都市新津县"
                        },
                        {
                            "name": "都江堰市",
                            "pId": "5101",
                            "id": "510181",
                            "fullname": "四川省成都市都江堰市"
                        },
                        {
                            "name": "彭州市",
                            "pId": "5101",
                            "id": "510182",
                            "fullname": "四川省成都市彭州市"
                        },
                        {
                            "name": "邛崃市",
                            "pId": "5101",
                            "id": "510183",
                            "fullname": "四川省成都市邛崃市"
                        },
                        {
                            "name": "崇州市",
                            "pId": "5101",
                            "id": "510184",
                            "fullname": "四川省成都市崇州市"
                        }
                    ]
                },
                {
                    "name": "自贡市",
                    "pId": "51",
                    "id": "5103",
                    "fullname": "四川省自贡市",
                    "items": [
                        {
                            "name": "自流井区",
                            "pId": "5103",
                            "id": "510302",
                            "fullname": "四川省自贡市自流井区"
                        },
                        {
                            "name": "贡井区",
                            "pId": "5103",
                            "id": "510303",
                            "fullname": "四川省自贡市贡井区"
                        },
                        {
                            "name": "大安区",
                            "pId": "5103",
                            "id": "510304",
                            "fullname": "四川省自贡市大安区"
                        },
                        {
                            "name": "沿滩区",
                            "pId": "5103",
                            "id": "510311",
                            "fullname": "四川省自贡市沿滩区"
                        },
                        {
                            "name": "荣县",
                            "pId": "5103",
                            "id": "510321",
                            "fullname": "四川省自贡市荣县"
                        },
                        {
                            "name": "富顺县",
                            "pId": "5103",
                            "id": "510322",
                            "fullname": "四川省自贡市富顺县"
                        }
                    ]
                },
                {
                    "name": "攀枝花市",
                    "pId": "51",
                    "id": "5104",
                    "fullname": "四川省攀枝花市",
                    "items": [
                        {
                            "name": "东区",
                            "pId": "5104",
                            "id": "510402",
                            "fullname": "四川省攀枝花市东区"
                        },
                        {
                            "name": "西区",
                            "pId": "5104",
                            "id": "510403",
                            "fullname": "四川省攀枝花市西区"
                        },
                        {
                            "name": "仁和区",
                            "pId": "5104",
                            "id": "510411",
                            "fullname": "四川省攀枝花市仁和区"
                        },
                        {
                            "name": "米易县",
                            "pId": "5104",
                            "id": "510421",
                            "fullname": "四川省攀枝花市米易县"
                        },
                        {
                            "name": "盐边县",
                            "pId": "5104",
                            "id": "510422",
                            "fullname": "四川省攀枝花市盐边县"
                        }
                    ]
                },
                {
                    "name": "泸州市",
                    "pId": "51",
                    "id": "5105",
                    "fullname": "四川省泸州市",
                    "items": [
                        {
                            "name": "江阳区",
                            "pId": "5105",
                            "id": "510502",
                            "fullname": "四川省泸州市江阳区"
                        },
                        {
                            "name": "纳溪区",
                            "pId": "5105",
                            "id": "510503",
                            "fullname": "四川省泸州市纳溪区"
                        },
                        {
                            "name": "龙马潭区",
                            "pId": "5105",
                            "id": "510504",
                            "fullname": "四川省泸州市龙马潭区"
                        },
                        {
                            "name": "泸县",
                            "pId": "5105",
                            "id": "510521",
                            "fullname": "四川省泸州市泸县"
                        },
                        {
                            "name": "合江县",
                            "pId": "5105",
                            "id": "510522",
                            "fullname": "四川省泸州市合江县"
                        },
                        {
                            "name": "叙永县",
                            "pId": "5105",
                            "id": "510524",
                            "fullname": "四川省泸州市叙永县"
                        },
                        {
                            "name": "古蔺县",
                            "pId": "5105",
                            "id": "510525",
                            "fullname": "四川省泸州市古蔺县"
                        }
                    ]
                },
                {
                    "name": "德阳市",
                    "pId": "51",
                    "id": "5106",
                    "fullname": "四川省德阳市",
                    "items": [
                        {
                            "name": "旌阳区",
                            "pId": "5106",
                            "id": "510603",
                            "fullname": "四川省德阳市旌阳区"
                        },
                        {
                            "name": "中江县",
                            "pId": "5106",
                            "id": "510623",
                            "fullname": "四川省德阳市中江县"
                        },
                        {
                            "name": "罗江县",
                            "pId": "5106",
                            "id": "510626",
                            "fullname": "四川省德阳市罗江县"
                        },
                        {
                            "name": "广汉市",
                            "pId": "5106",
                            "id": "510681",
                            "fullname": "四川省德阳市广汉市"
                        },
                        {
                            "name": "什邡市",
                            "pId": "5106",
                            "id": "510682",
                            "fullname": "四川省德阳市什邡市"
                        },
                        {
                            "name": "绵竹市",
                            "pId": "5106",
                            "id": "510683",
                            "fullname": "四川省德阳市绵竹市"
                        }
                    ]
                },
                {
                    "name": "绵阳市",
                    "pId": "51",
                    "id": "5107",
                    "fullname": "四川省绵阳市",
                    "items": [
                        {
                            "name": "涪城区",
                            "pId": "5107",
                            "id": "510703",
                            "fullname": "四川省绵阳市涪城区"
                        },
                        {
                            "name": "游仙区",
                            "pId": "5107",
                            "id": "510704",
                            "fullname": "四川省绵阳市游仙区"
                        },
                        {
                            "name": "三台县",
                            "pId": "5107",
                            "id": "510722",
                            "fullname": "四川省绵阳市三台县"
                        },
                        {
                            "name": "盐亭县",
                            "pId": "5107",
                            "id": "510723",
                            "fullname": "四川省绵阳市盐亭县"
                        },
                        {
                            "name": "安县",
                            "pId": "5107",
                            "id": "510724",
                            "fullname": "四川省绵阳市安县"
                        },
                        {
                            "name": "梓潼县",
                            "pId": "5107",
                            "id": "510725",
                            "fullname": "四川省绵阳市梓潼县"
                        },
                        {
                            "name": "北川羌族自治县",
                            "pId": "5107",
                            "id": "510726",
                            "fullname": "四川省绵阳市北川羌族自治县"
                        },
                        {
                            "name": "平武县",
                            "pId": "5107",
                            "id": "510727",
                            "fullname": "四川省绵阳市平武县"
                        },
                        {
                            "name": "江油市",
                            "pId": "5107",
                            "id": "510781",
                            "fullname": "四川省绵阳市江油市"
                        }
                    ]
                },
                {
                    "name": "广元市",
                    "pId": "51",
                    "id": "5108",
                    "fullname": "四川省广元市",
                    "items": [
                        {
                            "name": "利州区",
                            "pId": "5108",
                            "id": "510802",
                            "fullname": "四川省广元市利州区"
                        },
                        {
                            "name": "元坝区",
                            "pId": "5108",
                            "id": "510811",
                            "fullname": "四川省广元市元坝区"
                        },
                        {
                            "name": "朝天区",
                            "pId": "5108",
                            "id": "510812",
                            "fullname": "四川省广元市朝天区"
                        },
                        {
                            "name": "旺苍县",
                            "pId": "5108",
                            "id": "510821",
                            "fullname": "四川省广元市旺苍县"
                        },
                        {
                            "name": "青川县",
                            "pId": "5108",
                            "id": "510822",
                            "fullname": "四川省广元市青川县"
                        },
                        {
                            "name": "剑阁县",
                            "pId": "5108",
                            "id": "510823",
                            "fullname": "四川省广元市剑阁县"
                        },
                        {
                            "name": "苍溪县",
                            "pId": "5108",
                            "id": "510824",
                            "fullname": "四川省广元市苍溪县"
                        }
                    ]
                },
                {
                    "name": "遂宁市",
                    "pId": "51",
                    "id": "5109",
                    "fullname": "四川省遂宁市",
                    "items": [
                        {
                            "name": "船山区",
                            "pId": "5109",
                            "id": "510903",
                            "fullname": "四川省遂宁市船山区"
                        },
                        {
                            "name": "安居区",
                            "pId": "5109",
                            "id": "510904",
                            "fullname": "四川省遂宁市安居区"
                        },
                        {
                            "name": "蓬溪县",
                            "pId": "5109",
                            "id": "510921",
                            "fullname": "四川省遂宁市蓬溪县"
                        },
                        {
                            "name": "射洪县",
                            "pId": "5109",
                            "id": "510922",
                            "fullname": "四川省遂宁市射洪县"
                        },
                        {
                            "name": "大英县",
                            "pId": "5109",
                            "id": "510923",
                            "fullname": "四川省遂宁市大英县"
                        }
                    ]
                },
                {
                    "name": "内江市",
                    "pId": "51",
                    "id": "5110",
                    "fullname": "四川省内江市",
                    "items": [
                        {
                            "name": "市中区",
                            "pId": "5110",
                            "id": "511002",
                            "fullname": "四川省内江市市中区"
                        },
                        {
                            "name": "东兴区",
                            "pId": "5110",
                            "id": "511011",
                            "fullname": "四川省内江市东兴区"
                        },
                        {
                            "name": "威远县",
                            "pId": "5110",
                            "id": "511024",
                            "fullname": "四川省内江市威远县"
                        },
                        {
                            "name": "资中县",
                            "pId": "5110",
                            "id": "511025",
                            "fullname": "四川省内江市资中县"
                        },
                        {
                            "name": "隆昌县",
                            "pId": "5110",
                            "id": "511028",
                            "fullname": "四川省内江市隆昌县"
                        }
                    ]
                },
                {
                    "name": "乐山市",
                    "pId": "51",
                    "id": "5111",
                    "fullname": "四川省乐山市",
                    "items": [
                        {
                            "name": "市中区",
                            "pId": "5111",
                            "id": "511102",
                            "fullname": "四川省乐山市市中区"
                        },
                        {
                            "name": "沙湾区",
                            "pId": "5111",
                            "id": "511111",
                            "fullname": "四川省乐山市沙湾区"
                        },
                        {
                            "name": "五通桥区",
                            "pId": "5111",
                            "id": "511112",
                            "fullname": "四川省乐山市五通桥区"
                        },
                        {
                            "name": "金口河区",
                            "pId": "5111",
                            "id": "511113",
                            "fullname": "四川省乐山市金口河区"
                        },
                        {
                            "name": "犍为县",
                            "pId": "5111",
                            "id": "511123",
                            "fullname": "四川省乐山市犍为县"
                        },
                        {
                            "name": "井研县",
                            "pId": "5111",
                            "id": "511124",
                            "fullname": "四川省乐山市井研县"
                        },
                        {
                            "name": "夹江县",
                            "pId": "5111",
                            "id": "511126",
                            "fullname": "四川省乐山市夹江县"
                        },
                        {
                            "name": "沐川县",
                            "pId": "5111",
                            "id": "511129",
                            "fullname": "四川省乐山市沐川县"
                        },
                        {
                            "name": "峨边彝族自治县",
                            "pId": "5111",
                            "id": "511132",
                            "fullname": "四川省乐山市峨边彝族自治县"
                        },
                        {
                            "name": "马边彝族自治县",
                            "pId": "5111",
                            "id": "511133",
                            "fullname": "四川省乐山市马边彝族自治县"
                        },
                        {
                            "name": "峨眉山市",
                            "pId": "5111",
                            "id": "511181",
                            "fullname": "四川省乐山市峨眉山市"
                        }
                    ]
                },
                {
                    "name": "南充市",
                    "pId": "51",
                    "id": "5113",
                    "fullname": "四川省南充市",
                    "items": [
                        {
                            "name": "顺庆区",
                            "pId": "5113",
                            "id": "511302",
                            "fullname": "四川省南充市顺庆区"
                        },
                        {
                            "name": "高坪区",
                            "pId": "5113",
                            "id": "511303",
                            "fullname": "四川省南充市高坪区"
                        },
                        {
                            "name": "嘉陵区",
                            "pId": "5113",
                            "id": "511304",
                            "fullname": "四川省南充市嘉陵区"
                        },
                        {
                            "name": "南部县",
                            "pId": "5113",
                            "id": "511321",
                            "fullname": "四川省南充市南部县"
                        },
                        {
                            "name": "营山县",
                            "pId": "5113",
                            "id": "511322",
                            "fullname": "四川省南充市营山县"
                        },
                        {
                            "name": "蓬安县",
                            "pId": "5113",
                            "id": "511323",
                            "fullname": "四川省南充市蓬安县"
                        },
                        {
                            "name": "仪陇县",
                            "pId": "5113",
                            "id": "511324",
                            "fullname": "四川省南充市仪陇县"
                        },
                        {
                            "name": "西充县",
                            "pId": "5113",
                            "id": "511325",
                            "fullname": "四川省南充市西充县"
                        },
                        {
                            "name": "阆中市",
                            "pId": "5113",
                            "id": "511381",
                            "fullname": "四川省南充市阆中市"
                        }
                    ]
                },
                {
                    "name": "眉山市",
                    "pId": "51",
                    "id": "5114",
                    "fullname": "四川省眉山市",
                    "items": [
                        {
                            "name": "东坡区",
                            "pId": "5114",
                            "id": "511402",
                            "fullname": "四川省眉山市东坡区"
                        },
                        {
                            "name": "仁寿县",
                            "pId": "5114",
                            "id": "511421",
                            "fullname": "四川省眉山市仁寿县"
                        },
                        {
                            "name": "彭山县",
                            "pId": "5114",
                            "id": "511422",
                            "fullname": "四川省眉山市彭山县"
                        },
                        {
                            "name": "洪雅县",
                            "pId": "5114",
                            "id": "511423",
                            "fullname": "四川省眉山市洪雅县"
                        },
                        {
                            "name": "丹棱县",
                            "pId": "5114",
                            "id": "511424",
                            "fullname": "四川省眉山市丹棱县"
                        },
                        {
                            "name": "青神县",
                            "pId": "5114",
                            "id": "511425",
                            "fullname": "四川省眉山市青神县"
                        }
                    ]
                },
                {
                    "name": "宜宾市",
                    "pId": "51",
                    "id": "5115",
                    "fullname": "四川省宜宾市",
                    "items": [
                        {
                            "name": "翠屏区",
                            "pId": "5115",
                            "id": "511502",
                            "fullname": "四川省宜宾市翠屏区"
                        },
                        {
                            "name": "南溪区",
                            "pId": "5115",
                            "id": "511503",
                            "fullname": "四川省宜宾市南溪区"
                        },
                        {
                            "name": "宜宾县",
                            "pId": "5115",
                            "id": "511521",
                            "fullname": "四川省宜宾市宜宾县"
                        },
                        {
                            "name": "江安县",
                            "pId": "5115",
                            "id": "511523",
                            "fullname": "四川省宜宾市江安县"
                        },
                        {
                            "name": "长宁县",
                            "pId": "5115",
                            "id": "511524",
                            "fullname": "四川省宜宾市长宁县"
                        },
                        {
                            "name": "高县",
                            "pId": "5115",
                            "id": "511525",
                            "fullname": "四川省宜宾市高县"
                        },
                        {
                            "name": "珙县",
                            "pId": "5115",
                            "id": "511526",
                            "fullname": "四川省宜宾市珙县"
                        },
                        {
                            "name": "筠连县",
                            "pId": "5115",
                            "id": "511527",
                            "fullname": "四川省宜宾市筠连县"
                        },
                        {
                            "name": "兴文县",
                            "pId": "5115",
                            "id": "511528",
                            "fullname": "四川省宜宾市兴文县"
                        },
                        {
                            "name": "屏山县",
                            "pId": "5115",
                            "id": "511529",
                            "fullname": "四川省宜宾市屏山县"
                        }
                    ]
                },
                {
                    "name": "广安市",
                    "pId": "51",
                    "id": "5116",
                    "fullname": "四川省广安市",
                    "items": [
                        {
                            "name": "广安区",
                            "pId": "5116",
                            "id": "511602",
                            "fullname": "四川省广安市广安区"
                        },
                        {
                            "name": "前锋区",
                            "pId": "5116",
                            "id": "511603",
                            "fullname": "四川省广安市前锋区"
                        },
                        {
                            "name": "岳池县",
                            "pId": "5116",
                            "id": "511621",
                            "fullname": "四川省广安市岳池县"
                        },
                        {
                            "name": "武胜县",
                            "pId": "5116",
                            "id": "511622",
                            "fullname": "四川省广安市武胜县"
                        },
                        {
                            "name": "邻水县",
                            "pId": "5116",
                            "id": "511623",
                            "fullname": "四川省广安市邻水县"
                        },
                        {
                            "name": "华蓥市",
                            "pId": "5116",
                            "id": "511681",
                            "fullname": "四川省广安市华蓥市"
                        }
                    ]
                },
                {
                    "name": "达州市",
                    "pId": "51",
                    "id": "5117",
                    "fullname": "四川省达州市",
                    "items": [
                        {
                            "name": "通川区",
                            "pId": "5117",
                            "id": "511702",
                            "fullname": "四川省达州市通川区"
                        },
                        {
                            "name": "达川区",
                            "pId": "5117",
                            "id": "511703",
                            "fullname": "四川省达州市达川区"
                        },
                        {
                            "name": "宣汉县",
                            "pId": "5117",
                            "id": "511722",
                            "fullname": "四川省达州市宣汉县"
                        },
                        {
                            "name": "开江县",
                            "pId": "5117",
                            "id": "511723",
                            "fullname": "四川省达州市开江县"
                        },
                        {
                            "name": "大竹县",
                            "pId": "5117",
                            "id": "511724",
                            "fullname": "四川省达州市大竹县"
                        },
                        {
                            "name": "渠县",
                            "pId": "5117",
                            "id": "511725",
                            "fullname": "四川省达州市渠县"
                        },
                        {
                            "name": "万源市",
                            "pId": "5117",
                            "id": "511781",
                            "fullname": "四川省达州市万源市"
                        }
                    ]
                },
                {
                    "name": "雅安市",
                    "pId": "51",
                    "id": "5118",
                    "fullname": "四川省雅安市",
                    "items": [
                        {
                            "name": "雨城区",
                            "pId": "5118",
                            "id": "511802",
                            "fullname": "四川省雅安市雨城区"
                        },
                        {
                            "name": "名山区",
                            "pId": "5118",
                            "id": "511803",
                            "fullname": "四川省雅安市名山区"
                        },
                        {
                            "name": "荥经县",
                            "pId": "5118",
                            "id": "511822",
                            "fullname": "四川省雅安市荥经县"
                        },
                        {
                            "name": "汉源县",
                            "pId": "5118",
                            "id": "511823",
                            "fullname": "四川省雅安市汉源县"
                        },
                        {
                            "name": "石棉县",
                            "pId": "5118",
                            "id": "511824",
                            "fullname": "四川省雅安市石棉县"
                        },
                        {
                            "name": "天全县",
                            "pId": "5118",
                            "id": "511825",
                            "fullname": "四川省雅安市天全县"
                        },
                        {
                            "name": "芦山县",
                            "pId": "5118",
                            "id": "511826",
                            "fullname": "四川省雅安市芦山县"
                        },
                        {
                            "name": "宝兴县",
                            "pId": "5118",
                            "id": "511827",
                            "fullname": "四川省雅安市宝兴县"
                        }
                    ]
                },
                {
                    "name": "巴中市",
                    "pId": "51",
                    "id": "5119",
                    "fullname": "四川省巴中市",
                    "items": [
                        {
                            "name": "巴州区",
                            "pId": "5119",
                            "id": "511902",
                            "fullname": "四川省巴中市巴州区"
                        },
                        {
                            "name": "恩阳区",
                            "pId": "5119",
                            "id": "511903",
                            "fullname": "四川省巴中市恩阳区"
                        },
                        {
                            "name": "通江县",
                            "pId": "5119",
                            "id": "511921",
                            "fullname": "四川省巴中市通江县"
                        },
                        {
                            "name": "南江县",
                            "pId": "5119",
                            "id": "511922",
                            "fullname": "四川省巴中市南江县"
                        },
                        {
                            "name": "平昌县",
                            "pId": "5119",
                            "id": "511923",
                            "fullname": "四川省巴中市平昌县"
                        }
                    ]
                },
                {
                    "name": "资阳市",
                    "pId": "51",
                    "id": "5120",
                    "fullname": "四川省资阳市",
                    "items": [
                        {
                            "name": "雁江区",
                            "pId": "5120",
                            "id": "512002",
                            "fullname": "四川省资阳市雁江区"
                        },
                        {
                            "name": "安岳县",
                            "pId": "5120",
                            "id": "512021",
                            "fullname": "四川省资阳市安岳县"
                        },
                        {
                            "name": "乐至县",
                            "pId": "5120",
                            "id": "512022",
                            "fullname": "四川省资阳市乐至县"
                        },
                        {
                            "name": "简阳市",
                            "pId": "5120",
                            "id": "512081",
                            "fullname": "四川省资阳市简阳市"
                        }
                    ]
                },
                {
                    "name": "阿坝藏族羌族自治州",
                    "pId": "51",
                    "id": "5132",
                    "fullname": "四川省阿坝藏族羌族自治州",
                    "items": [
                        {
                            "name": "汶川县",
                            "pId": "5132",
                            "id": "513221",
                            "fullname": "四川省阿坝藏族羌族自治州汶川县"
                        },
                        {
                            "name": "理县",
                            "pId": "5132",
                            "id": "513222",
                            "fullname": "四川省阿坝藏族羌族自治州理县"
                        },
                        {
                            "name": "茂县",
                            "pId": "5132",
                            "id": "513223",
                            "fullname": "四川省阿坝藏族羌族自治州茂县"
                        },
                        {
                            "name": "松潘县",
                            "pId": "5132",
                            "id": "513224",
                            "fullname": "四川省阿坝藏族羌族自治州松潘县"
                        },
                        {
                            "name": "九寨沟县",
                            "pId": "5132",
                            "id": "513225",
                            "fullname": "四川省阿坝藏族羌族自治州九寨沟县"
                        },
                        {
                            "name": "金川县",
                            "pId": "5132",
                            "id": "513226",
                            "fullname": "四川省阿坝藏族羌族自治州金川县"
                        },
                        {
                            "name": "小金县",
                            "pId": "5132",
                            "id": "513227",
                            "fullname": "四川省阿坝藏族羌族自治州小金县"
                        },
                        {
                            "name": "黑水县",
                            "pId": "5132",
                            "id": "513228",
                            "fullname": "四川省阿坝藏族羌族自治州黑水县"
                        },
                        {
                            "name": "马尔康县",
                            "pId": "5132",
                            "id": "513229",
                            "fullname": "四川省阿坝藏族羌族自治州马尔康县"
                        },
                        {
                            "name": "壤塘县",
                            "pId": "5132",
                            "id": "513230",
                            "fullname": "四川省阿坝藏族羌族自治州壤塘县"
                        },
                        {
                            "name": "阿坝县",
                            "pId": "5132",
                            "id": "513231",
                            "fullname": "四川省阿坝藏族羌族自治州阿坝县"
                        },
                        {
                            "name": "若尔盖县",
                            "pId": "5132",
                            "id": "513232",
                            "fullname": "四川省阿坝藏族羌族自治州若尔盖县"
                        },
                        {
                            "name": "红原县",
                            "pId": "5132",
                            "id": "513233",
                            "fullname": "四川省阿坝藏族羌族自治州红原县"
                        }
                    ]
                },
                {
                    "name": "甘孜藏族自治州",
                    "pId": "51",
                    "id": "5133",
                    "fullname": "四川省甘孜藏族自治州",
                    "items": [
                        {
                            "name": "康定县",
                            "pId": "5133",
                            "id": "513321",
                            "fullname": "四川省甘孜藏族自治州康定县"
                        },
                        {
                            "name": "泸定县",
                            "pId": "5133",
                            "id": "513322",
                            "fullname": "四川省甘孜藏族自治州泸定县"
                        },
                        {
                            "name": "丹巴县",
                            "pId": "5133",
                            "id": "513323",
                            "fullname": "四川省甘孜藏族自治州丹巴县"
                        },
                        {
                            "name": "九龙县",
                            "pId": "5133",
                            "id": "513324",
                            "fullname": "四川省甘孜藏族自治州九龙县"
                        },
                        {
                            "name": "雅江县",
                            "pId": "5133",
                            "id": "513325",
                            "fullname": "四川省甘孜藏族自治州雅江县"
                        },
                        {
                            "name": "道孚县",
                            "pId": "5133",
                            "id": "513326",
                            "fullname": "四川省甘孜藏族自治州道孚县"
                        },
                        {
                            "name": "炉霍县",
                            "pId": "5133",
                            "id": "513327",
                            "fullname": "四川省甘孜藏族自治州炉霍县"
                        },
                        {
                            "name": "甘孜县",
                            "pId": "5133",
                            "id": "513328",
                            "fullname": "四川省甘孜藏族自治州甘孜县"
                        },
                        {
                            "name": "新龙县",
                            "pId": "5133",
                            "id": "513329",
                            "fullname": "四川省甘孜藏族自治州新龙县"
                        },
                        {
                            "name": "德格县",
                            "pId": "5133",
                            "id": "513330",
                            "fullname": "四川省甘孜藏族自治州德格县"
                        },
                        {
                            "name": "白玉县",
                            "pId": "5133",
                            "id": "513331",
                            "fullname": "四川省甘孜藏族自治州白玉县"
                        },
                        {
                            "name": "石渠县",
                            "pId": "5133",
                            "id": "513332",
                            "fullname": "四川省甘孜藏族自治州石渠县"
                        },
                        {
                            "name": "色达县",
                            "pId": "5133",
                            "id": "513333",
                            "fullname": "四川省甘孜藏族自治州色达县"
                        },
                        {
                            "name": "理塘县",
                            "pId": "5133",
                            "id": "513334",
                            "fullname": "四川省甘孜藏族自治州理塘县"
                        },
                        {
                            "name": "巴塘县",
                            "pId": "5133",
                            "id": "513335",
                            "fullname": "四川省甘孜藏族自治州巴塘县"
                        },
                        {
                            "name": "乡城县",
                            "pId": "5133",
                            "id": "513336",
                            "fullname": "四川省甘孜藏族自治州乡城县"
                        },
                        {
                            "name": "稻城县",
                            "pId": "5133",
                            "id": "513337",
                            "fullname": "四川省甘孜藏族自治州稻城县"
                        },
                        {
                            "name": "得荣县",
                            "pId": "5133",
                            "id": "513338",
                            "fullname": "四川省甘孜藏族自治州得荣县"
                        }
                    ]
                },
                {
                    "name": "凉山彝族自治州",
                    "pId": "51",
                    "id": "5134",
                    "fullname": "四川省凉山彝族自治州",
                    "items": [
                        {
                            "name": "西昌市",
                            "pId": "5134",
                            "id": "513401",
                            "fullname": "四川省凉山彝族自治州西昌市"
                        },
                        {
                            "name": "木里藏族自治县",
                            "pId": "5134",
                            "id": "513422",
                            "fullname": "四川省凉山彝族自治州木里藏族自治县"
                        },
                        {
                            "name": "盐源县",
                            "pId": "5134",
                            "id": "513423",
                            "fullname": "四川省凉山彝族自治州盐源县"
                        },
                        {
                            "name": "德昌县",
                            "pId": "5134",
                            "id": "513424",
                            "fullname": "四川省凉山彝族自治州德昌县"
                        },
                        {
                            "name": "会理县",
                            "pId": "5134",
                            "id": "513425",
                            "fullname": "四川省凉山彝族自治州会理县"
                        },
                        {
                            "name": "会东县",
                            "pId": "5134",
                            "id": "513426",
                            "fullname": "四川省凉山彝族自治州会东县"
                        },
                        {
                            "name": "宁南县",
                            "pId": "5134",
                            "id": "513427",
                            "fullname": "四川省凉山彝族自治州宁南县"
                        },
                        {
                            "name": "普格县",
                            "pId": "5134",
                            "id": "513428",
                            "fullname": "四川省凉山彝族自治州普格县"
                        },
                        {
                            "name": "布拖县",
                            "pId": "5134",
                            "id": "513429",
                            "fullname": "四川省凉山彝族自治州布拖县"
                        },
                        {
                            "name": "金阳县",
                            "pId": "5134",
                            "id": "513430",
                            "fullname": "四川省凉山彝族自治州金阳县"
                        },
                        {
                            "name": "昭觉县",
                            "pId": "5134",
                            "id": "513431",
                            "fullname": "四川省凉山彝族自治州昭觉县"
                        },
                        {
                            "name": "喜德县",
                            "pId": "5134",
                            "id": "513432",
                            "fullname": "四川省凉山彝族自治州喜德县"
                        },
                        {
                            "name": "冕宁县",
                            "pId": "5134",
                            "id": "513433",
                            "fullname": "四川省凉山彝族自治州冕宁县"
                        },
                        {
                            "name": "越西县",
                            "pId": "5134",
                            "id": "513434",
                            "fullname": "四川省凉山彝族自治州越西县"
                        },
                        {
                            "name": "甘洛县",
                            "pId": "5134",
                            "id": "513435",
                            "fullname": "四川省凉山彝族自治州甘洛县"
                        },
                        {
                            "name": "美姑县",
                            "pId": "5134",
                            "id": "513436",
                            "fullname": "四川省凉山彝族自治州美姑县"
                        },
                        {
                            "name": "雷波县",
                            "pId": "5134",
                            "id": "513437",
                            "fullname": "四川省凉山彝族自治州雷波县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "贵州省",
            "pId": "1",
            "id": "52",
            "fullname": "贵州省",
            "items": [
                {
                    "name": "贵阳市",
                    "pId": "52",
                    "id": "5201",
                    "fullname": "贵州省贵阳市",
                    "items": [
                        {
                            "name": "南明区",
                            "pId": "5201",
                            "id": "520102",
                            "fullname": "贵州省贵阳市南明区"
                        },
                        {
                            "name": "云岩区",
                            "pId": "5201",
                            "id": "520103",
                            "fullname": "贵州省贵阳市云岩区"
                        },
                        {
                            "name": "花溪区",
                            "pId": "5201",
                            "id": "520111",
                            "fullname": "贵州省贵阳市花溪区"
                        },
                        {
                            "name": "乌当区",
                            "pId": "5201",
                            "id": "520112",
                            "fullname": "贵州省贵阳市乌当区"
                        },
                        {
                            "name": "白云区",
                            "pId": "5201",
                            "id": "520113",
                            "fullname": "贵州省贵阳市白云区"
                        },
                        {
                            "name": "观山湖区",
                            "pId": "5201",
                            "id": "520115",
                            "fullname": "贵州省贵阳市观山湖区"
                        },
                        {
                            "name": "开阳县",
                            "pId": "5201",
                            "id": "520121",
                            "fullname": "贵州省贵阳市开阳县"
                        },
                        {
                            "name": "息烽县",
                            "pId": "5201",
                            "id": "520122",
                            "fullname": "贵州省贵阳市息烽县"
                        },
                        {
                            "name": "修文县",
                            "pId": "5201",
                            "id": "520123",
                            "fullname": "贵州省贵阳市修文县"
                        },
                        {
                            "name": "清镇市",
                            "pId": "5201",
                            "id": "520181",
                            "fullname": "贵州省贵阳市清镇市"
                        }
                    ]
                },
                {
                    "name": "六盘水市",
                    "pId": "52",
                    "id": "5202",
                    "fullname": "贵州省六盘水市",
                    "items": [
                        {
                            "name": "钟山区",
                            "pId": "5202",
                            "id": "520201",
                            "fullname": "贵州省六盘水市钟山区"
                        },
                        {
                            "name": "六枝特区",
                            "pId": "5202",
                            "id": "520203",
                            "fullname": "贵州省六盘水市六枝特区"
                        },
                        {
                            "name": "水城县",
                            "pId": "5202",
                            "id": "520221",
                            "fullname": "贵州省六盘水市水城县"
                        },
                        {
                            "name": "盘县",
                            "pId": "5202",
                            "id": "520222",
                            "fullname": "贵州省六盘水市盘县"
                        }
                    ]
                },
                {
                    "name": "遵义市",
                    "pId": "52",
                    "id": "5203",
                    "fullname": "贵州省遵义市",
                    "items": [
                        {
                            "name": "红花岗区",
                            "pId": "5203",
                            "id": "520302",
                            "fullname": "贵州省遵义市红花岗区"
                        },
                        {
                            "name": "汇川区",
                            "pId": "5203",
                            "id": "520303",
                            "fullname": "贵州省遵义市汇川区"
                        },
                        {
                            "name": "遵义县",
                            "pId": "5203",
                            "id": "520321",
                            "fullname": "贵州省遵义市遵义县"
                        },
                        {
                            "name": "桐梓县",
                            "pId": "5203",
                            "id": "520322",
                            "fullname": "贵州省遵义市桐梓县"
                        },
                        {
                            "name": "绥阳县",
                            "pId": "5203",
                            "id": "520323",
                            "fullname": "贵州省遵义市绥阳县"
                        },
                        {
                            "name": "正安县",
                            "pId": "5203",
                            "id": "520324",
                            "fullname": "贵州省遵义市正安县"
                        },
                        {
                            "name": "道真仡佬族苗族自治县",
                            "pId": "5203",
                            "id": "520325",
                            "fullname": "贵州省遵义市道真仡佬族苗族自治县"
                        },
                        {
                            "name": "务川仡佬族苗族自治县",
                            "pId": "5203",
                            "id": "520326",
                            "fullname": "贵州省遵义市务川仡佬族苗族自治县"
                        },
                        {
                            "name": "凤冈县",
                            "pId": "5203",
                            "id": "520327",
                            "fullname": "贵州省遵义市凤冈县"
                        },
                        {
                            "name": "湄潭县",
                            "pId": "5203",
                            "id": "520328",
                            "fullname": "贵州省遵义市湄潭县"
                        },
                        {
                            "name": "余庆县",
                            "pId": "5203",
                            "id": "520329",
                            "fullname": "贵州省遵义市余庆县"
                        },
                        {
                            "name": "习水县",
                            "pId": "5203",
                            "id": "520330",
                            "fullname": "贵州省遵义市习水县"
                        },
                        {
                            "name": "赤水市",
                            "pId": "5203",
                            "id": "520381",
                            "fullname": "贵州省遵义市赤水市"
                        },
                        {
                            "name": "仁怀市",
                            "pId": "5203",
                            "id": "520382",
                            "fullname": "贵州省遵义市仁怀市"
                        }
                    ]
                },
                {
                    "name": "安顺市",
                    "pId": "52",
                    "id": "5204",
                    "fullname": "贵州省安顺市",
                    "items": [
                        {
                            "name": "西秀区",
                            "pId": "5204",
                            "id": "520402",
                            "fullname": "贵州省安顺市西秀区"
                        },
                        {
                            "name": "平坝县",
                            "pId": "5204",
                            "id": "520421",
                            "fullname": "贵州省安顺市平坝县"
                        },
                        {
                            "name": "普定县",
                            "pId": "5204",
                            "id": "520422",
                            "fullname": "贵州省安顺市普定县"
                        },
                        {
                            "name": "镇宁布依族苗族自治县",
                            "pId": "5204",
                            "id": "520423",
                            "fullname": "贵州省安顺市镇宁布依族苗族自治县"
                        },
                        {
                            "name": "关岭布依族苗族自治县",
                            "pId": "5204",
                            "id": "520424",
                            "fullname": "贵州省安顺市关岭布依族苗族自治县"
                        },
                        {
                            "name": "紫云苗族布依族自治县",
                            "pId": "5204",
                            "id": "520425",
                            "fullname": "贵州省安顺市紫云苗族布依族自治县"
                        }
                    ]
                },
                {
                    "name": "毕节市",
                    "pId": "52",
                    "id": "5205",
                    "fullname": "贵州省毕节市",
                    "items": [
                        {
                            "name": "七星关区",
                            "pId": "5205",
                            "id": "520502",
                            "fullname": "贵州省毕节市七星关区"
                        },
                        {
                            "name": "大方县",
                            "pId": "5205",
                            "id": "520521",
                            "fullname": "贵州省毕节市大方县"
                        },
                        {
                            "name": "黔西县",
                            "pId": "5205",
                            "id": "520522",
                            "fullname": "贵州省毕节市黔西县"
                        },
                        {
                            "name": "金沙县",
                            "pId": "5205",
                            "id": "520523",
                            "fullname": "贵州省毕节市金沙县"
                        },
                        {
                            "name": "织金县",
                            "pId": "5205",
                            "id": "520524",
                            "fullname": "贵州省毕节市织金县"
                        },
                        {
                            "name": "纳雍县",
                            "pId": "5205",
                            "id": "520525",
                            "fullname": "贵州省毕节市纳雍县"
                        },
                        {
                            "name": "威宁彝族回族苗族自治县",
                            "pId": "5205",
                            "id": "520526",
                            "fullname": "贵州省毕节市威宁彝族回族苗族自治县"
                        },
                        {
                            "name": "赫章县",
                            "pId": "5205",
                            "id": "520527",
                            "fullname": "贵州省毕节市赫章县"
                        }
                    ]
                },
                {
                    "name": "铜仁市",
                    "pId": "52",
                    "id": "5206",
                    "fullname": "贵州省铜仁市",
                    "items": [
                        {
                            "name": "碧江区",
                            "pId": "5206",
                            "id": "520602",
                            "fullname": "贵州省铜仁市碧江区"
                        },
                        {
                            "name": "万山区",
                            "pId": "5206",
                            "id": "520603",
                            "fullname": "贵州省铜仁市万山区"
                        },
                        {
                            "name": "江口县",
                            "pId": "5206",
                            "id": "520621",
                            "fullname": "贵州省铜仁市江口县"
                        },
                        {
                            "name": "玉屏侗族自治县",
                            "pId": "5206",
                            "id": "520622",
                            "fullname": "贵州省铜仁市玉屏侗族自治县"
                        },
                        {
                            "name": "石阡县",
                            "pId": "5206",
                            "id": "520623",
                            "fullname": "贵州省铜仁市石阡县"
                        },
                        {
                            "name": "思南县",
                            "pId": "5206",
                            "id": "520624",
                            "fullname": "贵州省铜仁市思南县"
                        },
                        {
                            "name": "印江土家族苗族自治县",
                            "pId": "5206",
                            "id": "520625",
                            "fullname": "贵州省铜仁市印江土家族苗族自治县"
                        },
                        {
                            "name": "德江县",
                            "pId": "5206",
                            "id": "520626",
                            "fullname": "贵州省铜仁市德江县"
                        },
                        {
                            "name": "沿河土家族自治县",
                            "pId": "5206",
                            "id": "520627",
                            "fullname": "贵州省铜仁市沿河土家族自治县"
                        },
                        {
                            "name": "松桃苗族自治县",
                            "pId": "5206",
                            "id": "520628",
                            "fullname": "贵州省铜仁市松桃苗族自治县"
                        }
                    ]
                },
                {
                    "name": "黔西南布依族苗族自治州",
                    "pId": "52",
                    "id": "5223",
                    "fullname": "贵州省黔西南布依族苗族自治州",
                    "items": [
                        {
                            "name": "兴义市",
                            "pId": "5223",
                            "id": "522301",
                            "fullname": "贵州省黔西南布依族苗族自治州兴义市"
                        },
                        {
                            "name": "兴仁县",
                            "pId": "5223",
                            "id": "522322",
                            "fullname": "贵州省黔西南布依族苗族自治州兴仁县"
                        },
                        {
                            "name": "普安县",
                            "pId": "5223",
                            "id": "522323",
                            "fullname": "贵州省黔西南布依族苗族自治州普安县"
                        },
                        {
                            "name": "晴隆县",
                            "pId": "5223",
                            "id": "522324",
                            "fullname": "贵州省黔西南布依族苗族自治州晴隆县"
                        },
                        {
                            "name": "贞丰县",
                            "pId": "5223",
                            "id": "522325",
                            "fullname": "贵州省黔西南布依族苗族自治州贞丰县"
                        },
                        {
                            "name": "望谟县",
                            "pId": "5223",
                            "id": "522326",
                            "fullname": "贵州省黔西南布依族苗族自治州望谟县"
                        },
                        {
                            "name": "册亨县",
                            "pId": "5223",
                            "id": "522327",
                            "fullname": "贵州省黔西南布依族苗族自治州册亨县"
                        },
                        {
                            "name": "安龙县",
                            "pId": "5223",
                            "id": "522328",
                            "fullname": "贵州省黔西南布依族苗族自治州安龙县"
                        }
                    ]
                },
                {
                    "name": "黔东南苗族侗族自治州",
                    "pId": "52",
                    "id": "5226",
                    "fullname": "贵州省黔东南苗族侗族自治州",
                    "items": [
                        {
                            "name": "凯里市",
                            "pId": "5226",
                            "id": "522601",
                            "fullname": "贵州省黔东南苗族侗族自治州凯里市"
                        },
                        {
                            "name": "黄平县",
                            "pId": "5226",
                            "id": "522622",
                            "fullname": "贵州省黔东南苗族侗族自治州黄平县"
                        },
                        {
                            "name": "施秉县",
                            "pId": "5226",
                            "id": "522623",
                            "fullname": "贵州省黔东南苗族侗族自治州施秉县"
                        },
                        {
                            "name": "三穗县",
                            "pId": "5226",
                            "id": "522624",
                            "fullname": "贵州省黔东南苗族侗族自治州三穗县"
                        },
                        {
                            "name": "镇远县",
                            "pId": "5226",
                            "id": "522625",
                            "fullname": "贵州省黔东南苗族侗族自治州镇远县"
                        },
                        {
                            "name": "岑巩县",
                            "pId": "5226",
                            "id": "522626",
                            "fullname": "贵州省黔东南苗族侗族自治州岑巩县"
                        },
                        {
                            "name": "天柱县",
                            "pId": "5226",
                            "id": "522627",
                            "fullname": "贵州省黔东南苗族侗族自治州天柱县"
                        },
                        {
                            "name": "锦屏县",
                            "pId": "5226",
                            "id": "522628",
                            "fullname": "贵州省黔东南苗族侗族自治州锦屏县"
                        },
                        {
                            "name": "剑河县",
                            "pId": "5226",
                            "id": "522629",
                            "fullname": "贵州省黔东南苗族侗族自治州剑河县"
                        },
                        {
                            "name": "台江县",
                            "pId": "5226",
                            "id": "522630",
                            "fullname": "贵州省黔东南苗族侗族自治州台江县"
                        },
                        {
                            "name": "黎平县",
                            "pId": "5226",
                            "id": "522631",
                            "fullname": "贵州省黔东南苗族侗族自治州黎平县"
                        },
                        {
                            "name": "榕江县",
                            "pId": "5226",
                            "id": "522632",
                            "fullname": "贵州省黔东南苗族侗族自治州榕江县"
                        },
                        {
                            "name": "从江县",
                            "pId": "5226",
                            "id": "522633",
                            "fullname": "贵州省黔东南苗族侗族自治州从江县"
                        },
                        {
                            "name": "雷山县",
                            "pId": "5226",
                            "id": "522634",
                            "fullname": "贵州省黔东南苗族侗族自治州雷山县"
                        },
                        {
                            "name": "麻江县",
                            "pId": "5226",
                            "id": "522635",
                            "fullname": "贵州省黔东南苗族侗族自治州麻江县"
                        },
                        {
                            "name": "丹寨县",
                            "pId": "5226",
                            "id": "522636",
                            "fullname": "贵州省黔东南苗族侗族自治州丹寨县"
                        }
                    ]
                },
                {
                    "name": "黔南布依族苗族自治州",
                    "pId": "52",
                    "id": "5227",
                    "fullname": "贵州省黔南布依族苗族自治州",
                    "items": [
                        {
                            "name": "都匀市",
                            "pId": "5227",
                            "id": "522701",
                            "fullname": "贵州省黔南布依族苗族自治州都匀市"
                        },
                        {
                            "name": "福泉市",
                            "pId": "5227",
                            "id": "522702",
                            "fullname": "贵州省黔南布依族苗族自治州福泉市"
                        },
                        {
                            "name": "荔波县",
                            "pId": "5227",
                            "id": "522722",
                            "fullname": "贵州省黔南布依族苗族自治州荔波县"
                        },
                        {
                            "name": "贵定县",
                            "pId": "5227",
                            "id": "522723",
                            "fullname": "贵州省黔南布依族苗族自治州贵定县"
                        },
                        {
                            "name": "瓮安县",
                            "pId": "5227",
                            "id": "522725",
                            "fullname": "贵州省黔南布依族苗族自治州瓮安县"
                        },
                        {
                            "name": "独山县",
                            "pId": "5227",
                            "id": "522726",
                            "fullname": "贵州省黔南布依族苗族自治州独山县"
                        },
                        {
                            "name": "平塘县",
                            "pId": "5227",
                            "id": "522727",
                            "fullname": "贵州省黔南布依族苗族自治州平塘县"
                        },
                        {
                            "name": "罗甸县",
                            "pId": "5227",
                            "id": "522728",
                            "fullname": "贵州省黔南布依族苗族自治州罗甸县"
                        },
                        {
                            "name": "长顺县",
                            "pId": "5227",
                            "id": "522729",
                            "fullname": "贵州省黔南布依族苗族自治州长顺县"
                        },
                        {
                            "name": "龙里县",
                            "pId": "5227",
                            "id": "522730",
                            "fullname": "贵州省黔南布依族苗族自治州龙里县"
                        },
                        {
                            "name": "惠水县",
                            "pId": "5227",
                            "id": "522731",
                            "fullname": "贵州省黔南布依族苗族自治州惠水县"
                        },
                        {
                            "name": "三都水族自治县",
                            "pId": "5227",
                            "id": "522732",
                            "fullname": "贵州省黔南布依族苗族自治州三都水族自治县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "云南省",
            "pId": "1",
            "id": "53",
            "fullname": "云南省",
            "items": [
                {
                    "name": "昆明市",
                    "pId": "53",
                    "id": "5301",
                    "fullname": "云南省昆明市",
                    "items": [
                        {
                            "name": "五华区",
                            "pId": "5301",
                            "id": "530102",
                            "fullname": "云南省昆明市五华区"
                        },
                        {
                            "name": "盘龙区",
                            "pId": "5301",
                            "id": "530103",
                            "fullname": "云南省昆明市盘龙区"
                        },
                        {
                            "name": "官渡区",
                            "pId": "5301",
                            "id": "530111",
                            "fullname": "云南省昆明市官渡区"
                        },
                        {
                            "name": "西山区",
                            "pId": "5301",
                            "id": "530112",
                            "fullname": "云南省昆明市西山区"
                        },
                        {
                            "name": "东川区",
                            "pId": "5301",
                            "id": "530113",
                            "fullname": "云南省昆明市东川区"
                        },
                        {
                            "name": "呈贡区",
                            "pId": "5301",
                            "id": "530114",
                            "fullname": "云南省昆明市呈贡区"
                        },
                        {
                            "name": "晋宁县",
                            "pId": "5301",
                            "id": "530122",
                            "fullname": "云南省昆明市晋宁县"
                        },
                        {
                            "name": "富民县",
                            "pId": "5301",
                            "id": "530124",
                            "fullname": "云南省昆明市富民县"
                        },
                        {
                            "name": "宜良县",
                            "pId": "5301",
                            "id": "530125",
                            "fullname": "云南省昆明市宜良县"
                        },
                        {
                            "name": "石林彝族自治县",
                            "pId": "5301",
                            "id": "530126",
                            "fullname": "云南省昆明市石林彝族自治县"
                        },
                        {
                            "name": "嵩明县",
                            "pId": "5301",
                            "id": "530127",
                            "fullname": "云南省昆明市嵩明县"
                        },
                        {
                            "name": "禄劝彝族苗族自治县",
                            "pId": "5301",
                            "id": "530128",
                            "fullname": "云南省昆明市禄劝彝族苗族自治县"
                        },
                        {
                            "name": "寻甸回族彝族自治县",
                            "pId": "5301",
                            "id": "530129",
                            "fullname": "云南省昆明市寻甸回族彝族自治县"
                        },
                        {
                            "name": "安宁市",
                            "pId": "5301",
                            "id": "530181",
                            "fullname": "云南省昆明市安宁市"
                        }
                    ]
                },
                {
                    "name": "曲靖市",
                    "pId": "53",
                    "id": "5303",
                    "fullname": "云南省曲靖市",
                    "items": [
                        {
                            "name": "麒麟区",
                            "pId": "5303",
                            "id": "530302",
                            "fullname": "云南省曲靖市麒麟区"
                        },
                        {
                            "name": "马龙县",
                            "pId": "5303",
                            "id": "530321",
                            "fullname": "云南省曲靖市马龙县"
                        },
                        {
                            "name": "陆良县",
                            "pId": "5303",
                            "id": "530322",
                            "fullname": "云南省曲靖市陆良县"
                        },
                        {
                            "name": "师宗县",
                            "pId": "5303",
                            "id": "530323",
                            "fullname": "云南省曲靖市师宗县"
                        },
                        {
                            "name": "罗平县",
                            "pId": "5303",
                            "id": "530324",
                            "fullname": "云南省曲靖市罗平县"
                        },
                        {
                            "name": "富源县",
                            "pId": "5303",
                            "id": "530325",
                            "fullname": "云南省曲靖市富源县"
                        },
                        {
                            "name": "会泽县",
                            "pId": "5303",
                            "id": "530326",
                            "fullname": "云南省曲靖市会泽县"
                        },
                        {
                            "name": "沾益县",
                            "pId": "5303",
                            "id": "530328",
                            "fullname": "云南省曲靖市沾益县"
                        },
                        {
                            "name": "宣威市",
                            "pId": "5303",
                            "id": "530381",
                            "fullname": "云南省曲靖市宣威市"
                        }
                    ]
                },
                {
                    "name": "玉溪市",
                    "pId": "53",
                    "id": "5304",
                    "fullname": "云南省玉溪市",
                    "items": [
                        {
                            "name": "红塔区",
                            "pId": "5304",
                            "id": "530402",
                            "fullname": "云南省玉溪市红塔区"
                        },
                        {
                            "name": "江川县",
                            "pId": "5304",
                            "id": "530421",
                            "fullname": "云南省玉溪市江川县"
                        },
                        {
                            "name": "澄江县",
                            "pId": "5304",
                            "id": "530422",
                            "fullname": "云南省玉溪市澄江县"
                        },
                        {
                            "name": "通海县",
                            "pId": "5304",
                            "id": "530423",
                            "fullname": "云南省玉溪市通海县"
                        },
                        {
                            "name": "华宁县",
                            "pId": "5304",
                            "id": "530424",
                            "fullname": "云南省玉溪市华宁县"
                        },
                        {
                            "name": "易门县",
                            "pId": "5304",
                            "id": "530425",
                            "fullname": "云南省玉溪市易门县"
                        },
                        {
                            "name": "峨山彝族自治县",
                            "pId": "5304",
                            "id": "530426",
                            "fullname": "云南省玉溪市峨山彝族自治县"
                        },
                        {
                            "name": "新平彝族傣族自治县",
                            "pId": "5304",
                            "id": "530427",
                            "fullname": "云南省玉溪市新平彝族傣族自治县"
                        },
                        {
                            "name": "元江哈尼族彝族傣族自治县",
                            "pId": "5304",
                            "id": "530428",
                            "fullname": "云南省玉溪市元江哈尼族彝族傣族自治县"
                        }
                    ]
                },
                {
                    "name": "保山市",
                    "pId": "53",
                    "id": "5305",
                    "fullname": "云南省保山市",
                    "items": [
                        {
                            "name": "隆阳区",
                            "pId": "5305",
                            "id": "530502",
                            "fullname": "云南省保山市隆阳区"
                        },
                        {
                            "name": "施甸县",
                            "pId": "5305",
                            "id": "530521",
                            "fullname": "云南省保山市施甸县"
                        },
                        {
                            "name": "腾冲县",
                            "pId": "5305",
                            "id": "530522",
                            "fullname": "云南省保山市腾冲县"
                        },
                        {
                            "name": "龙陵县",
                            "pId": "5305",
                            "id": "530523",
                            "fullname": "云南省保山市龙陵县"
                        },
                        {
                            "name": "昌宁县",
                            "pId": "5305",
                            "id": "530524",
                            "fullname": "云南省保山市昌宁县"
                        }
                    ]
                },
                {
                    "name": "昭通市",
                    "pId": "53",
                    "id": "5306",
                    "fullname": "云南省昭通市",
                    "items": [
                        {
                            "name": "昭阳区",
                            "pId": "5306",
                            "id": "530602",
                            "fullname": "云南省昭通市昭阳区"
                        },
                        {
                            "name": "鲁甸县",
                            "pId": "5306",
                            "id": "530621",
                            "fullname": "云南省昭通市鲁甸县"
                        },
                        {
                            "name": "巧家县",
                            "pId": "5306",
                            "id": "530622",
                            "fullname": "云南省昭通市巧家县"
                        },
                        {
                            "name": "盐津县",
                            "pId": "5306",
                            "id": "530623",
                            "fullname": "云南省昭通市盐津县"
                        },
                        {
                            "name": "大关县",
                            "pId": "5306",
                            "id": "530624",
                            "fullname": "云南省昭通市大关县"
                        },
                        {
                            "name": "永善县",
                            "pId": "5306",
                            "id": "530625",
                            "fullname": "云南省昭通市永善县"
                        },
                        {
                            "name": "绥江县",
                            "pId": "5306",
                            "id": "530626",
                            "fullname": "云南省昭通市绥江县"
                        },
                        {
                            "name": "镇雄县",
                            "pId": "5306",
                            "id": "530627",
                            "fullname": "云南省昭通市镇雄县"
                        },
                        {
                            "name": "彝良县",
                            "pId": "5306",
                            "id": "530628",
                            "fullname": "云南省昭通市彝良县"
                        },
                        {
                            "name": "威信县",
                            "pId": "5306",
                            "id": "530629",
                            "fullname": "云南省昭通市威信县"
                        },
                        {
                            "name": "水富县",
                            "pId": "5306",
                            "id": "530630",
                            "fullname": "云南省昭通市水富县"
                        }
                    ]
                },
                {
                    "name": "丽江市",
                    "pId": "53",
                    "id": "5307",
                    "fullname": "云南省丽江市",
                    "items": [
                        {
                            "name": "古城区",
                            "pId": "5307",
                            "id": "530702",
                            "fullname": "云南省丽江市古城区"
                        },
                        {
                            "name": "玉龙纳西族自治县",
                            "pId": "5307",
                            "id": "530721",
                            "fullname": "云南省丽江市玉龙纳西族自治县"
                        },
                        {
                            "name": "永胜县",
                            "pId": "5307",
                            "id": "530722",
                            "fullname": "云南省丽江市永胜县"
                        },
                        {
                            "name": "华坪县",
                            "pId": "5307",
                            "id": "530723",
                            "fullname": "云南省丽江市华坪县"
                        },
                        {
                            "name": "宁蒗彝族自治县",
                            "pId": "5307",
                            "id": "530724",
                            "fullname": "云南省丽江市宁蒗彝族自治县"
                        }
                    ]
                },
                {
                    "name": "普洱市",
                    "pId": "53",
                    "id": "5308",
                    "fullname": "云南省普洱市",
                    "items": [
                        {
                            "name": "思茅区",
                            "pId": "5308",
                            "id": "530802",
                            "fullname": "云南省普洱市思茅区"
                        },
                        {
                            "name": "宁洱哈尼族彝族自治县",
                            "pId": "5308",
                            "id": "530821",
                            "fullname": "云南省普洱市宁洱哈尼族彝族自治县"
                        },
                        {
                            "name": "墨江哈尼族自治县",
                            "pId": "5308",
                            "id": "530822",
                            "fullname": "云南省普洱市墨江哈尼族自治县"
                        },
                        {
                            "name": "景东彝族自治县",
                            "pId": "5308",
                            "id": "530823",
                            "fullname": "云南省普洱市景东彝族自治县"
                        },
                        {
                            "name": "景谷傣族彝族自治县",
                            "pId": "5308",
                            "id": "530824",
                            "fullname": "云南省普洱市景谷傣族彝族自治县"
                        },
                        {
                            "name": "镇沅彝族哈尼族拉祜族自治县",
                            "pId": "5308",
                            "id": "530825",
                            "fullname": "云南省普洱市镇沅彝族哈尼族拉祜族自治县"
                        },
                        {
                            "name": "江城哈尼族彝族自治县",
                            "pId": "5308",
                            "id": "530826",
                            "fullname": "云南省普洱市江城哈尼族彝族自治县"
                        },
                        {
                            "name": "孟连傣族拉祜族佤族自治县",
                            "pId": "5308",
                            "id": "530827",
                            "fullname": "云南省普洱市孟连傣族拉祜族佤族自治县"
                        },
                        {
                            "name": "澜沧拉祜族自治县",
                            "pId": "5308",
                            "id": "530828",
                            "fullname": "云南省普洱市澜沧拉祜族自治县"
                        },
                        {
                            "name": "西盟佤族自治县",
                            "pId": "5308",
                            "id": "530829",
                            "fullname": "云南省普洱市西盟佤族自治县"
                        }
                    ]
                },
                {
                    "name": "临沧市",
                    "pId": "53",
                    "id": "5309",
                    "fullname": "云南省临沧市",
                    "items": [
                        {
                            "name": "临翔区",
                            "pId": "5309",
                            "id": "530902",
                            "fullname": "云南省临沧市临翔区"
                        },
                        {
                            "name": "凤庆县",
                            "pId": "5309",
                            "id": "530921",
                            "fullname": "云南省临沧市凤庆县"
                        },
                        {
                            "name": "云县",
                            "pId": "5309",
                            "id": "530922",
                            "fullname": "云南省临沧市云县"
                        },
                        {
                            "name": "永德县",
                            "pId": "5309",
                            "id": "530923",
                            "fullname": "云南省临沧市永德县"
                        },
                        {
                            "name": "镇康县",
                            "pId": "5309",
                            "id": "530924",
                            "fullname": "云南省临沧市镇康县"
                        },
                        {
                            "name": "双江拉祜族佤族布朗族傣族自治县",
                            "pId": "5309",
                            "id": "530925",
                            "fullname": "云南省临沧市双江拉祜族佤族布朗族傣族自治县"
                        },
                        {
                            "name": "耿马傣族佤族自治县",
                            "pId": "5309",
                            "id": "530926",
                            "fullname": "云南省临沧市耿马傣族佤族自治县"
                        },
                        {
                            "name": "沧源佤族自治县",
                            "pId": "5309",
                            "id": "530927",
                            "fullname": "云南省临沧市沧源佤族自治县"
                        }
                    ]
                },
                {
                    "name": "楚雄彝族自治州",
                    "pId": "53",
                    "id": "5323",
                    "fullname": "云南省楚雄彝族自治州",
                    "items": [
                        {
                            "name": "楚雄市",
                            "pId": "5323",
                            "id": "532301",
                            "fullname": "云南省楚雄彝族自治州楚雄市"
                        },
                        {
                            "name": "双柏县",
                            "pId": "5323",
                            "id": "532322",
                            "fullname": "云南省楚雄彝族自治州双柏县"
                        },
                        {
                            "name": "牟定县",
                            "pId": "5323",
                            "id": "532323",
                            "fullname": "云南省楚雄彝族自治州牟定县"
                        },
                        {
                            "name": "南华县",
                            "pId": "5323",
                            "id": "532324",
                            "fullname": "云南省楚雄彝族自治州南华县"
                        },
                        {
                            "name": "姚安县",
                            "pId": "5323",
                            "id": "532325",
                            "fullname": "云南省楚雄彝族自治州姚安县"
                        },
                        {
                            "name": "大姚县",
                            "pId": "5323",
                            "id": "532326",
                            "fullname": "云南省楚雄彝族自治州大姚县"
                        },
                        {
                            "name": "永仁县",
                            "pId": "5323",
                            "id": "532327",
                            "fullname": "云南省楚雄彝族自治州永仁县"
                        },
                        {
                            "name": "元谋县",
                            "pId": "5323",
                            "id": "532328",
                            "fullname": "云南省楚雄彝族自治州元谋县"
                        },
                        {
                            "name": "武定县",
                            "pId": "5323",
                            "id": "532329",
                            "fullname": "云南省楚雄彝族自治州武定县"
                        },
                        {
                            "name": "禄丰县",
                            "pId": "5323",
                            "id": "532331",
                            "fullname": "云南省楚雄彝族自治州禄丰县"
                        }
                    ]
                },
                {
                    "name": "红河哈尼族彝族自治州",
                    "pId": "53",
                    "id": "5325",
                    "fullname": "云南省红河哈尼族彝族自治州",
                    "items": [
                        {
                            "name": "个旧市",
                            "pId": "5325",
                            "id": "532501",
                            "fullname": "云南省红河哈尼族彝族自治州个旧市"
                        },
                        {
                            "name": "开远市",
                            "pId": "5325",
                            "id": "532502",
                            "fullname": "云南省红河哈尼族彝族自治州开远市"
                        },
                        {
                            "name": "蒙自市",
                            "pId": "5325",
                            "id": "532503",
                            "fullname": "云南省红河哈尼族彝族自治州蒙自市"
                        },
                        {
                            "name": "弥勒市",
                            "pId": "5325",
                            "id": "532504",
                            "fullname": "云南省红河哈尼族彝族自治州弥勒市"
                        },
                        {
                            "name": "屏边苗族自治县",
                            "pId": "5325",
                            "id": "532523",
                            "fullname": "云南省红河哈尼族彝族自治州屏边苗族自治县"
                        },
                        {
                            "name": "建水县",
                            "pId": "5325",
                            "id": "532524",
                            "fullname": "云南省红河哈尼族彝族自治州建水县"
                        },
                        {
                            "name": "石屏县",
                            "pId": "5325",
                            "id": "532525",
                            "fullname": "云南省红河哈尼族彝族自治州石屏县"
                        },
                        {
                            "name": "泸西县",
                            "pId": "5325",
                            "id": "532527",
                            "fullname": "云南省红河哈尼族彝族自治州泸西县"
                        },
                        {
                            "name": "元阳县",
                            "pId": "5325",
                            "id": "532528",
                            "fullname": "云南省红河哈尼族彝族自治州元阳县"
                        },
                        {
                            "name": "红河县",
                            "pId": "5325",
                            "id": "532529",
                            "fullname": "云南省红河哈尼族彝族自治州红河县"
                        },
                        {
                            "name": "金平苗族瑶族傣族自治县",
                            "pId": "5325",
                            "id": "532530",
                            "fullname": "云南省红河哈尼族彝族自治州金平苗族瑶族傣族自治县"
                        },
                        {
                            "name": "绿春县",
                            "pId": "5325",
                            "id": "532531",
                            "fullname": "云南省红河哈尼族彝族自治州绿春县"
                        },
                        {
                            "name": "河口瑶族自治县",
                            "pId": "5325",
                            "id": "532532",
                            "fullname": "云南省红河哈尼族彝族自治州河口瑶族自治县"
                        }
                    ]
                },
                {
                    "name": "文山壮族苗族自治州",
                    "pId": "53",
                    "id": "5326",
                    "fullname": "云南省文山壮族苗族自治州",
                    "items": [
                        {
                            "name": "文山市",
                            "pId": "5326",
                            "id": "532601",
                            "fullname": "云南省文山壮族苗族自治州文山市"
                        },
                        {
                            "name": "砚山县",
                            "pId": "5326",
                            "id": "532622",
                            "fullname": "云南省文山壮族苗族自治州砚山县"
                        },
                        {
                            "name": "西畴县",
                            "pId": "5326",
                            "id": "532623",
                            "fullname": "云南省文山壮族苗族自治州西畴县"
                        },
                        {
                            "name": "麻栗坡县",
                            "pId": "5326",
                            "id": "532624",
                            "fullname": "云南省文山壮族苗族自治州麻栗坡县"
                        },
                        {
                            "name": "马关县",
                            "pId": "5326",
                            "id": "532625",
                            "fullname": "云南省文山壮族苗族自治州马关县"
                        },
                        {
                            "name": "丘北县",
                            "pId": "5326",
                            "id": "532626",
                            "fullname": "云南省文山壮族苗族自治州丘北县"
                        },
                        {
                            "name": "广南县",
                            "pId": "5326",
                            "id": "532627",
                            "fullname": "云南省文山壮族苗族自治州广南县"
                        },
                        {
                            "name": "富宁县",
                            "pId": "5326",
                            "id": "532628",
                            "fullname": "云南省文山壮族苗族自治州富宁县"
                        }
                    ]
                },
                {
                    "name": "西双版纳傣族自治州",
                    "pId": "53",
                    "id": "5328",
                    "fullname": "云南省西双版纳傣族自治州",
                    "items": [
                        {
                            "name": "景洪市",
                            "pId": "5328",
                            "id": "532801",
                            "fullname": "云南省西双版纳傣族自治州景洪市"
                        },
                        {
                            "name": "勐海县",
                            "pId": "5328",
                            "id": "532822",
                            "fullname": "云南省西双版纳傣族自治州勐海县"
                        },
                        {
                            "name": "勐腊县",
                            "pId": "5328",
                            "id": "532823",
                            "fullname": "云南省西双版纳傣族自治州勐腊县"
                        }
                    ]
                },
                {
                    "name": "大理白族自治州",
                    "pId": "53",
                    "id": "5329",
                    "fullname": "云南省大理白族自治州",
                    "items": [
                        {
                            "name": "大理市",
                            "pId": "5329",
                            "id": "532901",
                            "fullname": "云南省大理白族自治州大理市"
                        },
                        {
                            "name": "漾濞彝族自治县",
                            "pId": "5329",
                            "id": "532922",
                            "fullname": "云南省大理白族自治州漾濞彝族自治县"
                        },
                        {
                            "name": "祥云县",
                            "pId": "5329",
                            "id": "532923",
                            "fullname": "云南省大理白族自治州祥云县"
                        },
                        {
                            "name": "宾川县",
                            "pId": "5329",
                            "id": "532924",
                            "fullname": "云南省大理白族自治州宾川县"
                        },
                        {
                            "name": "弥渡县",
                            "pId": "5329",
                            "id": "532925",
                            "fullname": "云南省大理白族自治州弥渡县"
                        },
                        {
                            "name": "南涧彝族自治县",
                            "pId": "5329",
                            "id": "532926",
                            "fullname": "云南省大理白族自治州南涧彝族自治县"
                        },
                        {
                            "name": "巍山彝族回族自治县",
                            "pId": "5329",
                            "id": "532927",
                            "fullname": "云南省大理白族自治州巍山彝族回族自治县"
                        },
                        {
                            "name": "永平县",
                            "pId": "5329",
                            "id": "532928",
                            "fullname": "云南省大理白族自治州永平县"
                        },
                        {
                            "name": "云龙县",
                            "pId": "5329",
                            "id": "532929",
                            "fullname": "云南省大理白族自治州云龙县"
                        },
                        {
                            "name": "洱源县",
                            "pId": "5329",
                            "id": "532930",
                            "fullname": "云南省大理白族自治州洱源县"
                        },
                        {
                            "name": "剑川县",
                            "pId": "5329",
                            "id": "532931",
                            "fullname": "云南省大理白族自治州剑川县"
                        },
                        {
                            "name": "鹤庆县",
                            "pId": "5329",
                            "id": "532932",
                            "fullname": "云南省大理白族自治州鹤庆县"
                        }
                    ]
                },
                {
                    "name": "德宏傣族景颇族自治州",
                    "pId": "53",
                    "id": "5331",
                    "fullname": "云南省德宏傣族景颇族自治州",
                    "items": [
                        {
                            "name": "瑞丽市",
                            "pId": "5331",
                            "id": "533102",
                            "fullname": "云南省德宏傣族景颇族自治州瑞丽市"
                        },
                        {
                            "name": "芒市",
                            "pId": "5331",
                            "id": "533103",
                            "fullname": "云南省德宏傣族景颇族自治州芒市"
                        },
                        {
                            "name": "梁河县",
                            "pId": "5331",
                            "id": "533122",
                            "fullname": "云南省德宏傣族景颇族自治州梁河县"
                        },
                        {
                            "name": "盈江县",
                            "pId": "5331",
                            "id": "533123",
                            "fullname": "云南省德宏傣族景颇族自治州盈江县"
                        },
                        {
                            "name": "陇川县",
                            "pId": "5331",
                            "id": "533124",
                            "fullname": "云南省德宏傣族景颇族自治州陇川县"
                        }
                    ]
                },
                {
                    "name": "怒江傈僳族自治州",
                    "pId": "53",
                    "id": "5333",
                    "fullname": "云南省怒江傈僳族自治州",
                    "items": [
                        {
                            "name": "泸水县",
                            "pId": "5333",
                            "id": "533321",
                            "fullname": "云南省怒江傈僳族自治州泸水县"
                        },
                        {
                            "name": "福贡县",
                            "pId": "5333",
                            "id": "533323",
                            "fullname": "云南省怒江傈僳族自治州福贡县"
                        },
                        {
                            "name": "贡山独龙族怒族自治县",
                            "pId": "5333",
                            "id": "533324",
                            "fullname": "云南省怒江傈僳族自治州贡山独龙族怒族自治县"
                        },
                        {
                            "name": "兰坪白族普米族自治县",
                            "pId": "5333",
                            "id": "533325",
                            "fullname": "云南省怒江傈僳族自治州兰坪白族普米族自治县"
                        }
                    ]
                },
                {
                    "name": "迪庆藏族自治州",
                    "pId": "53",
                    "id": "5334",
                    "fullname": "云南省迪庆藏族自治州",
                    "items": [
                        {
                            "name": "香格里拉县",
                            "pId": "5334",
                            "id": "533421",
                            "fullname": "云南省迪庆藏族自治州香格里拉县"
                        },
                        {
                            "name": "德钦县",
                            "pId": "5334",
                            "id": "533422",
                            "fullname": "云南省迪庆藏族自治州德钦县"
                        },
                        {
                            "name": "维西傈僳族自治县",
                            "pId": "5334",
                            "id": "533423",
                            "fullname": "云南省迪庆藏族自治州维西傈僳族自治县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "西藏自治区",
            "pId": "1",
            "id": "54",
            "fullname": "西藏自治区",
            "items": [
                {
                    "name": "拉萨市",
                    "pId": "54",
                    "id": "5401",
                    "fullname": "西藏自治区拉萨市",
                    "items": [
                        {
                            "name": "城关区",
                            "pId": "5401",
                            "id": "540102",
                            "fullname": "西藏自治区拉萨市城关区"
                        },
                        {
                            "name": "林周县",
                            "pId": "5401",
                            "id": "540121",
                            "fullname": "西藏自治区拉萨市林周县"
                        },
                        {
                            "name": "当雄县",
                            "pId": "5401",
                            "id": "540122",
                            "fullname": "西藏自治区拉萨市当雄县"
                        },
                        {
                            "name": "尼木县",
                            "pId": "5401",
                            "id": "540123",
                            "fullname": "西藏自治区拉萨市尼木县"
                        },
                        {
                            "name": "曲水县",
                            "pId": "5401",
                            "id": "540124",
                            "fullname": "西藏自治区拉萨市曲水县"
                        },
                        {
                            "name": "堆龙德庆县",
                            "pId": "5401",
                            "id": "540125",
                            "fullname": "西藏自治区拉萨市堆龙德庆县"
                        },
                        {
                            "name": "达孜县",
                            "pId": "5401",
                            "id": "540126",
                            "fullname": "西藏自治区拉萨市达孜县"
                        },
                        {
                            "name": "墨竹工卡县",
                            "pId": "5401",
                            "id": "540127",
                            "fullname": "西藏自治区拉萨市墨竹工卡县"
                        }
                    ]
                },
                {
                    "name": "昌都地区",
                    "pId": "54",
                    "id": "5421",
                    "fullname": "西藏自治区昌都地区",
                    "items": [
                        {
                            "name": "昌都县",
                            "pId": "5421",
                            "id": "542121",
                            "fullname": "西藏自治区昌都地区昌都县"
                        },
                        {
                            "name": "江达县",
                            "pId": "5421",
                            "id": "542122",
                            "fullname": "西藏自治区昌都地区江达县"
                        },
                        {
                            "name": "贡觉县",
                            "pId": "5421",
                            "id": "542123",
                            "fullname": "西藏自治区昌都地区贡觉县"
                        },
                        {
                            "name": "类乌齐县",
                            "pId": "5421",
                            "id": "542124",
                            "fullname": "西藏自治区昌都地区类乌齐县"
                        },
                        {
                            "name": "丁青县",
                            "pId": "5421",
                            "id": "542125",
                            "fullname": "西藏自治区昌都地区丁青县"
                        },
                        {
                            "name": "察雅县",
                            "pId": "5421",
                            "id": "542126",
                            "fullname": "西藏自治区昌都地区察雅县"
                        },
                        {
                            "name": "八宿县",
                            "pId": "5421",
                            "id": "542127",
                            "fullname": "西藏自治区昌都地区八宿县"
                        },
                        {
                            "name": "左贡县",
                            "pId": "5421",
                            "id": "542128",
                            "fullname": "西藏自治区昌都地区左贡县"
                        },
                        {
                            "name": "芒康县",
                            "pId": "5421",
                            "id": "542129",
                            "fullname": "西藏自治区昌都地区芒康县"
                        },
                        {
                            "name": "洛隆县",
                            "pId": "5421",
                            "id": "542132",
                            "fullname": "西藏自治区昌都地区洛隆县"
                        },
                        {
                            "name": "边坝县",
                            "pId": "5421",
                            "id": "542133",
                            "fullname": "西藏自治区昌都地区边坝县"
                        }
                    ]
                },
                {
                    "name": "山南地区",
                    "pId": "54",
                    "id": "5422",
                    "fullname": "西藏自治区山南地区",
                    "items": [
                        {
                            "name": "乃东县",
                            "pId": "5422",
                            "id": "542221",
                            "fullname": "西藏自治区山南地区乃东县"
                        },
                        {
                            "name": "扎囊县",
                            "pId": "5422",
                            "id": "542222",
                            "fullname": "西藏自治区山南地区扎囊县"
                        },
                        {
                            "name": "贡嘎县",
                            "pId": "5422",
                            "id": "542223",
                            "fullname": "西藏自治区山南地区贡嘎县"
                        },
                        {
                            "name": "桑日县",
                            "pId": "5422",
                            "id": "542224",
                            "fullname": "西藏自治区山南地区桑日县"
                        },
                        {
                            "name": "琼结县",
                            "pId": "5422",
                            "id": "542225",
                            "fullname": "西藏自治区山南地区琼结县"
                        },
                        {
                            "name": "曲松县",
                            "pId": "5422",
                            "id": "542226",
                            "fullname": "西藏自治区山南地区曲松县"
                        },
                        {
                            "name": "措美县",
                            "pId": "5422",
                            "id": "542227",
                            "fullname": "西藏自治区山南地区措美县"
                        },
                        {
                            "name": "洛扎县",
                            "pId": "5422",
                            "id": "542228",
                            "fullname": "西藏自治区山南地区洛扎县"
                        },
                        {
                            "name": "加查县",
                            "pId": "5422",
                            "id": "542229",
                            "fullname": "西藏自治区山南地区加查县"
                        },
                        {
                            "name": "隆子县",
                            "pId": "5422",
                            "id": "542231",
                            "fullname": "西藏自治区山南地区隆子县"
                        },
                        {
                            "name": "错那县",
                            "pId": "5422",
                            "id": "542232",
                            "fullname": "西藏自治区山南地区错那县"
                        },
                        {
                            "name": "浪卡子县",
                            "pId": "5422",
                            "id": "542233",
                            "fullname": "西藏自治区山南地区浪卡子县"
                        }
                    ]
                },
                {
                    "name": "日喀则地区",
                    "pId": "54",
                    "id": "5423",
                    "fullname": "西藏自治区日喀则地区",
                    "items": [
                        {
                            "name": "日喀则市",
                            "pId": "5423",
                            "id": "542301",
                            "fullname": "西藏自治区日喀则地区日喀则市"
                        },
                        {
                            "name": "南木林县",
                            "pId": "5423",
                            "id": "542322",
                            "fullname": "西藏自治区日喀则地区南木林县"
                        },
                        {
                            "name": "江孜县",
                            "pId": "5423",
                            "id": "542323",
                            "fullname": "西藏自治区日喀则地区江孜县"
                        },
                        {
                            "name": "定日县",
                            "pId": "5423",
                            "id": "542324",
                            "fullname": "西藏自治区日喀则地区定日县"
                        },
                        {
                            "name": "萨迦县",
                            "pId": "5423",
                            "id": "542325",
                            "fullname": "西藏自治区日喀则地区萨迦县"
                        },
                        {
                            "name": "拉孜县",
                            "pId": "5423",
                            "id": "542326",
                            "fullname": "西藏自治区日喀则地区拉孜县"
                        },
                        {
                            "name": "昂仁县",
                            "pId": "5423",
                            "id": "542327",
                            "fullname": "西藏自治区日喀则地区昂仁县"
                        },
                        {
                            "name": "谢通门县",
                            "pId": "5423",
                            "id": "542328",
                            "fullname": "西藏自治区日喀则地区谢通门县"
                        },
                        {
                            "name": "白朗县",
                            "pId": "5423",
                            "id": "542329",
                            "fullname": "西藏自治区日喀则地区白朗县"
                        },
                        {
                            "name": "仁布县",
                            "pId": "5423",
                            "id": "542330",
                            "fullname": "西藏自治区日喀则地区仁布县"
                        },
                        {
                            "name": "康马县",
                            "pId": "5423",
                            "id": "542331",
                            "fullname": "西藏自治区日喀则地区康马县"
                        },
                        {
                            "name": "定结县",
                            "pId": "5423",
                            "id": "542332",
                            "fullname": "西藏自治区日喀则地区定结县"
                        },
                        {
                            "name": "仲巴县",
                            "pId": "5423",
                            "id": "542333",
                            "fullname": "西藏自治区日喀则地区仲巴县"
                        },
                        {
                            "name": "亚东县",
                            "pId": "5423",
                            "id": "542334",
                            "fullname": "西藏自治区日喀则地区亚东县"
                        },
                        {
                            "name": "吉隆县",
                            "pId": "5423",
                            "id": "542335",
                            "fullname": "西藏自治区日喀则地区吉隆县"
                        },
                        {
                            "name": "聂拉木县",
                            "pId": "5423",
                            "id": "542336",
                            "fullname": "西藏自治区日喀则地区聂拉木县"
                        },
                        {
                            "name": "萨嘎县",
                            "pId": "5423",
                            "id": "542337",
                            "fullname": "西藏自治区日喀则地区萨嘎县"
                        },
                        {
                            "name": "岗巴县",
                            "pId": "5423",
                            "id": "542338",
                            "fullname": "西藏自治区日喀则地区岗巴县"
                        }
                    ]
                },
                {
                    "name": "那曲地区",
                    "pId": "54",
                    "id": "5424",
                    "fullname": "西藏自治区那曲地区",
                    "items": [
                        {
                            "name": "那曲县",
                            "pId": "5424",
                            "id": "542421",
                            "fullname": "西藏自治区那曲地区那曲县"
                        },
                        {
                            "name": "嘉黎县",
                            "pId": "5424",
                            "id": "542422",
                            "fullname": "西藏自治区那曲地区嘉黎县"
                        },
                        {
                            "name": "比如县",
                            "pId": "5424",
                            "id": "542423",
                            "fullname": "西藏自治区那曲地区比如县"
                        },
                        {
                            "name": "聂荣县",
                            "pId": "5424",
                            "id": "542424",
                            "fullname": "西藏自治区那曲地区聂荣县"
                        },
                        {
                            "name": "安多县",
                            "pId": "5424",
                            "id": "542425",
                            "fullname": "西藏自治区那曲地区安多县"
                        },
                        {
                            "name": "申扎县",
                            "pId": "5424",
                            "id": "542426",
                            "fullname": "西藏自治区那曲地区申扎县"
                        },
                        {
                            "name": "索县",
                            "pId": "5424",
                            "id": "542427",
                            "fullname": "西藏自治区那曲地区索县"
                        },
                        {
                            "name": "班戈县",
                            "pId": "5424",
                            "id": "542428",
                            "fullname": "西藏自治区那曲地区班戈县"
                        },
                        {
                            "name": "巴青县",
                            "pId": "5424",
                            "id": "542429",
                            "fullname": "西藏自治区那曲地区巴青县"
                        },
                        {
                            "name": "尼玛县",
                            "pId": "5424",
                            "id": "542430",
                            "fullname": "西藏自治区那曲地区尼玛县"
                        },
                        {
                            "name": "双湖县",
                            "pId": "5424",
                            "id": "542431",
                            "fullname": "西藏自治区那曲地区双湖县"
                        }
                    ]
                },
                {
                    "name": "阿里地区",
                    "pId": "54",
                    "id": "5425",
                    "fullname": "西藏自治区阿里地区",
                    "items": [
                        {
                            "name": "普兰县",
                            "pId": "5425",
                            "id": "542521",
                            "fullname": "西藏自治区阿里地区普兰县"
                        },
                        {
                            "name": "札达县",
                            "pId": "5425",
                            "id": "542522",
                            "fullname": "西藏自治区阿里地区札达县"
                        },
                        {
                            "name": "噶尔县",
                            "pId": "5425",
                            "id": "542523",
                            "fullname": "西藏自治区阿里地区噶尔县"
                        },
                        {
                            "name": "日土县",
                            "pId": "5425",
                            "id": "542524",
                            "fullname": "西藏自治区阿里地区日土县"
                        },
                        {
                            "name": "革吉县",
                            "pId": "5425",
                            "id": "542525",
                            "fullname": "西藏自治区阿里地区革吉县"
                        },
                        {
                            "name": "改则县",
                            "pId": "5425",
                            "id": "542526",
                            "fullname": "西藏自治区阿里地区改则县"
                        },
                        {
                            "name": "措勤县",
                            "pId": "5425",
                            "id": "542527",
                            "fullname": "西藏自治区阿里地区措勤县"
                        }
                    ]
                },
                {
                    "name": "林芝地区",
                    "pId": "54",
                    "id": "5426",
                    "fullname": "西藏自治区林芝地区",
                    "items": [
                        {
                            "name": "林芝县",
                            "pId": "5426",
                            "id": "542621",
                            "fullname": "西藏自治区林芝地区林芝县"
                        },
                        {
                            "name": "工布江达县",
                            "pId": "5426",
                            "id": "542622",
                            "fullname": "西藏自治区林芝地区工布江达县"
                        },
                        {
                            "name": "米林县",
                            "pId": "5426",
                            "id": "542623",
                            "fullname": "西藏自治区林芝地区米林县"
                        },
                        {
                            "name": "墨脱县",
                            "pId": "5426",
                            "id": "542624",
                            "fullname": "西藏自治区林芝地区墨脱县"
                        },
                        {
                            "name": "波密县",
                            "pId": "5426",
                            "id": "542625",
                            "fullname": "西藏自治区林芝地区波密县"
                        },
                        {
                            "name": "察隅县",
                            "pId": "5426",
                            "id": "542626",
                            "fullname": "西藏自治区林芝地区察隅县"
                        },
                        {
                            "name": "朗县",
                            "pId": "5426",
                            "id": "542627",
                            "fullname": "西藏自治区林芝地区朗县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "陕西省",
            "pId": "1",
            "id": "61",
            "fullname": "陕西省",
            "items": [
                {
                    "name": "西安市",
                    "pId": "61",
                    "id": "6101",
                    "fullname": "陕西省西安市",
                    "items": [
                        {
                            "name": "新城区",
                            "pId": "6101",
                            "id": "610102",
                            "fullname": "陕西省西安市新城区"
                        },
                        {
                            "name": "碑林区",
                            "pId": "6101",
                            "id": "610103",
                            "fullname": "陕西省西安市碑林区"
                        },
                        {
                            "name": "莲湖区",
                            "pId": "6101",
                            "id": "610104",
                            "fullname": "陕西省西安市莲湖区"
                        },
                        {
                            "name": "灞桥区",
                            "pId": "6101",
                            "id": "610111",
                            "fullname": "陕西省西安市灞桥区"
                        },
                        {
                            "name": "未央区",
                            "pId": "6101",
                            "id": "610112",
                            "fullname": "陕西省西安市未央区"
                        },
                        {
                            "name": "雁塔区",
                            "pId": "6101",
                            "id": "610113",
                            "fullname": "陕西省西安市雁塔区"
                        },
                        {
                            "name": "阎良区",
                            "pId": "6101",
                            "id": "610114",
                            "fullname": "陕西省西安市阎良区"
                        },
                        {
                            "name": "临潼区",
                            "pId": "6101",
                            "id": "610115",
                            "fullname": "陕西省西安市临潼区"
                        },
                        {
                            "name": "长安区",
                            "pId": "6101",
                            "id": "610116",
                            "fullname": "陕西省西安市长安区"
                        },
                        {
                            "name": "蓝田县",
                            "pId": "6101",
                            "id": "610122",
                            "fullname": "陕西省西安市蓝田县"
                        },
                        {
                            "name": "周至县",
                            "pId": "6101",
                            "id": "610124",
                            "fullname": "陕西省西安市周至县"
                        },
                        {
                            "name": "户县",
                            "pId": "6101",
                            "id": "610125",
                            "fullname": "陕西省西安市户县"
                        },
                        {
                            "name": "高陵县",
                            "pId": "6101",
                            "id": "610126",
                            "fullname": "陕西省西安市高陵县"
                        }
                    ]
                },
                {
                    "name": "铜川市",
                    "pId": "61",
                    "id": "6102",
                    "fullname": "陕西省铜川市",
                    "items": [
                        {
                            "name": "王益区",
                            "pId": "6102",
                            "id": "610202",
                            "fullname": "陕西省铜川市王益区"
                        },
                        {
                            "name": "印台区",
                            "pId": "6102",
                            "id": "610203",
                            "fullname": "陕西省铜川市印台区"
                        },
                        {
                            "name": "耀州区",
                            "pId": "6102",
                            "id": "610204",
                            "fullname": "陕西省铜川市耀州区"
                        },
                        {
                            "name": "宜君县",
                            "pId": "6102",
                            "id": "610222",
                            "fullname": "陕西省铜川市宜君县"
                        }
                    ]
                },
                {
                    "name": "宝鸡市",
                    "pId": "61",
                    "id": "6103",
                    "fullname": "陕西省宝鸡市",
                    "items": [
                        {
                            "name": "渭滨区",
                            "pId": "6103",
                            "id": "610302",
                            "fullname": "陕西省宝鸡市渭滨区"
                        },
                        {
                            "name": "金台区",
                            "pId": "6103",
                            "id": "610303",
                            "fullname": "陕西省宝鸡市金台区"
                        },
                        {
                            "name": "陈仓区",
                            "pId": "6103",
                            "id": "610304",
                            "fullname": "陕西省宝鸡市陈仓区"
                        },
                        {
                            "name": "凤翔县",
                            "pId": "6103",
                            "id": "610322",
                            "fullname": "陕西省宝鸡市凤翔县"
                        },
                        {
                            "name": "岐山县",
                            "pId": "6103",
                            "id": "610323",
                            "fullname": "陕西省宝鸡市岐山县"
                        },
                        {
                            "name": "扶风县",
                            "pId": "6103",
                            "id": "610324",
                            "fullname": "陕西省宝鸡市扶风县"
                        },
                        {
                            "name": "眉县",
                            "pId": "6103",
                            "id": "610326",
                            "fullname": "陕西省宝鸡市眉县"
                        },
                        {
                            "name": "陇县",
                            "pId": "6103",
                            "id": "610327",
                            "fullname": "陕西省宝鸡市陇县"
                        },
                        {
                            "name": "千阳县",
                            "pId": "6103",
                            "id": "610328",
                            "fullname": "陕西省宝鸡市千阳县"
                        },
                        {
                            "name": "麟游县",
                            "pId": "6103",
                            "id": "610329",
                            "fullname": "陕西省宝鸡市麟游县"
                        },
                        {
                            "name": "凤县",
                            "pId": "6103",
                            "id": "610330",
                            "fullname": "陕西省宝鸡市凤县"
                        },
                        {
                            "name": "太白县",
                            "pId": "6103",
                            "id": "610331",
                            "fullname": "陕西省宝鸡市太白县"
                        }
                    ]
                },
                {
                    "name": "咸阳市",
                    "pId": "61",
                    "id": "6104",
                    "fullname": "陕西省咸阳市",
                    "items": [
                        {
                            "name": "秦都区",
                            "pId": "6104",
                            "id": "610402",
                            "fullname": "陕西省咸阳市秦都区"
                        },
                        {
                            "name": "杨陵区",
                            "pId": "6104",
                            "id": "610403",
                            "fullname": "陕西省咸阳市杨陵区"
                        },
                        {
                            "name": "渭城区",
                            "pId": "6104",
                            "id": "610404",
                            "fullname": "陕西省咸阳市渭城区"
                        },
                        {
                            "name": "三原县",
                            "pId": "6104",
                            "id": "610422",
                            "fullname": "陕西省咸阳市三原县"
                        },
                        {
                            "name": "泾阳县",
                            "pId": "6104",
                            "id": "610423",
                            "fullname": "陕西省咸阳市泾阳县"
                        },
                        {
                            "name": "乾县",
                            "pId": "6104",
                            "id": "610424",
                            "fullname": "陕西省咸阳市乾县"
                        },
                        {
                            "name": "礼泉县",
                            "pId": "6104",
                            "id": "610425",
                            "fullname": "陕西省咸阳市礼泉县"
                        },
                        {
                            "name": "永寿县",
                            "pId": "6104",
                            "id": "610426",
                            "fullname": "陕西省咸阳市永寿县"
                        },
                        {
                            "name": "彬县",
                            "pId": "6104",
                            "id": "610427",
                            "fullname": "陕西省咸阳市彬县"
                        },
                        {
                            "name": "长武县",
                            "pId": "6104",
                            "id": "610428",
                            "fullname": "陕西省咸阳市长武县"
                        },
                        {
                            "name": "旬邑县",
                            "pId": "6104",
                            "id": "610429",
                            "fullname": "陕西省咸阳市旬邑县"
                        },
                        {
                            "name": "淳化县",
                            "pId": "6104",
                            "id": "610430",
                            "fullname": "陕西省咸阳市淳化县"
                        },
                        {
                            "name": "武功县",
                            "pId": "6104",
                            "id": "610431",
                            "fullname": "陕西省咸阳市武功县"
                        },
                        {
                            "name": "兴平市",
                            "pId": "6104",
                            "id": "610481",
                            "fullname": "陕西省咸阳市兴平市"
                        }
                    ]
                },
                {
                    "name": "渭南市",
                    "pId": "61",
                    "id": "6105",
                    "fullname": "陕西省渭南市",
                    "items": [
                        {
                            "name": "临渭区",
                            "pId": "6105",
                            "id": "610502",
                            "fullname": "陕西省渭南市临渭区"
                        },
                        {
                            "name": "华县",
                            "pId": "6105",
                            "id": "610521",
                            "fullname": "陕西省渭南市华县"
                        },
                        {
                            "name": "潼关县",
                            "pId": "6105",
                            "id": "610522",
                            "fullname": "陕西省渭南市潼关县"
                        },
                        {
                            "name": "大荔县",
                            "pId": "6105",
                            "id": "610523",
                            "fullname": "陕西省渭南市大荔县"
                        },
                        {
                            "name": "合阳县",
                            "pId": "6105",
                            "id": "610524",
                            "fullname": "陕西省渭南市合阳县"
                        },
                        {
                            "name": "澄城县",
                            "pId": "6105",
                            "id": "610525",
                            "fullname": "陕西省渭南市澄城县"
                        },
                        {
                            "name": "蒲城县",
                            "pId": "6105",
                            "id": "610526",
                            "fullname": "陕西省渭南市蒲城县"
                        },
                        {
                            "name": "白水县",
                            "pId": "6105",
                            "id": "610527",
                            "fullname": "陕西省渭南市白水县"
                        },
                        {
                            "name": "富平县",
                            "pId": "6105",
                            "id": "610528",
                            "fullname": "陕西省渭南市富平县"
                        },
                        {
                            "name": "韩城市",
                            "pId": "6105",
                            "id": "610581",
                            "fullname": "陕西省渭南市韩城市"
                        },
                        {
                            "name": "华阴市",
                            "pId": "6105",
                            "id": "610582",
                            "fullname": "陕西省渭南市华阴市"
                        }
                    ]
                },
                {
                    "name": "延安市",
                    "pId": "61",
                    "id": "6106",
                    "fullname": "陕西省延安市",
                    "items": [
                        {
                            "name": "宝塔区",
                            "pId": "6106",
                            "id": "610602",
                            "fullname": "陕西省延安市宝塔区"
                        },
                        {
                            "name": "延长县",
                            "pId": "6106",
                            "id": "610621",
                            "fullname": "陕西省延安市延长县"
                        },
                        {
                            "name": "延川县",
                            "pId": "6106",
                            "id": "610622",
                            "fullname": "陕西省延安市延川县"
                        },
                        {
                            "name": "子长县",
                            "pId": "6106",
                            "id": "610623",
                            "fullname": "陕西省延安市子长县"
                        },
                        {
                            "name": "安塞县",
                            "pId": "6106",
                            "id": "610624",
                            "fullname": "陕西省延安市安塞县"
                        },
                        {
                            "name": "志丹县",
                            "pId": "6106",
                            "id": "610625",
                            "fullname": "陕西省延安市志丹县"
                        },
                        {
                            "name": "吴起县",
                            "pId": "6106",
                            "id": "610626",
                            "fullname": "陕西省延安市吴起县"
                        },
                        {
                            "name": "甘泉县",
                            "pId": "6106",
                            "id": "610627",
                            "fullname": "陕西省延安市甘泉县"
                        },
                        {
                            "name": "富县",
                            "pId": "6106",
                            "id": "610628",
                            "fullname": "陕西省延安市富县"
                        },
                        {
                            "name": "洛川县",
                            "pId": "6106",
                            "id": "610629",
                            "fullname": "陕西省延安市洛川县"
                        },
                        {
                            "name": "宜川县",
                            "pId": "6106",
                            "id": "610630",
                            "fullname": "陕西省延安市宜川县"
                        },
                        {
                            "name": "黄龙县",
                            "pId": "6106",
                            "id": "610631",
                            "fullname": "陕西省延安市黄龙县"
                        },
                        {
                            "name": "黄陵县",
                            "pId": "6106",
                            "id": "610632",
                            "fullname": "陕西省延安市黄陵县"
                        }
                    ]
                },
                {
                    "name": "汉中市",
                    "pId": "61",
                    "id": "6107",
                    "fullname": "陕西省汉中市",
                    "items": [
                        {
                            "name": "汉台区",
                            "pId": "6107",
                            "id": "610702",
                            "fullname": "陕西省汉中市汉台区"
                        },
                        {
                            "name": "南郑县",
                            "pId": "6107",
                            "id": "610721",
                            "fullname": "陕西省汉中市南郑县"
                        },
                        {
                            "name": "城固县",
                            "pId": "6107",
                            "id": "610722",
                            "fullname": "陕西省汉中市城固县"
                        },
                        {
                            "name": "洋县",
                            "pId": "6107",
                            "id": "610723",
                            "fullname": "陕西省汉中市洋县"
                        },
                        {
                            "name": "西乡县",
                            "pId": "6107",
                            "id": "610724",
                            "fullname": "陕西省汉中市西乡县"
                        },
                        {
                            "name": "勉县",
                            "pId": "6107",
                            "id": "610725",
                            "fullname": "陕西省汉中市勉县"
                        },
                        {
                            "name": "宁强县",
                            "pId": "6107",
                            "id": "610726",
                            "fullname": "陕西省汉中市宁强县"
                        },
                        {
                            "name": "略阳县",
                            "pId": "6107",
                            "id": "610727",
                            "fullname": "陕西省汉中市略阳县"
                        },
                        {
                            "name": "镇巴县",
                            "pId": "6107",
                            "id": "610728",
                            "fullname": "陕西省汉中市镇巴县"
                        },
                        {
                            "name": "留坝县",
                            "pId": "6107",
                            "id": "610729",
                            "fullname": "陕西省汉中市留坝县"
                        },
                        {
                            "name": "佛坪县",
                            "pId": "6107",
                            "id": "610730",
                            "fullname": "陕西省汉中市佛坪县"
                        }
                    ]
                },
                {
                    "name": "榆林市",
                    "pId": "61",
                    "id": "6108",
                    "fullname": "陕西省榆林市",
                    "items": [
                        {
                            "name": "榆阳区",
                            "pId": "6108",
                            "id": "610802",
                            "fullname": "陕西省榆林市榆阳区"
                        },
                        {
                            "name": "神木县",
                            "pId": "6108",
                            "id": "610821",
                            "fullname": "陕西省榆林市神木县"
                        },
                        {
                            "name": "府谷县",
                            "pId": "6108",
                            "id": "610822",
                            "fullname": "陕西省榆林市府谷县"
                        },
                        {
                            "name": "横山县",
                            "pId": "6108",
                            "id": "610823",
                            "fullname": "陕西省榆林市横山县"
                        },
                        {
                            "name": "靖边县",
                            "pId": "6108",
                            "id": "610824",
                            "fullname": "陕西省榆林市靖边县"
                        },
                        {
                            "name": "定边县",
                            "pId": "6108",
                            "id": "610825",
                            "fullname": "陕西省榆林市定边县"
                        },
                        {
                            "name": "绥德县",
                            "pId": "6108",
                            "id": "610826",
                            "fullname": "陕西省榆林市绥德县"
                        },
                        {
                            "name": "米脂县",
                            "pId": "6108",
                            "id": "610827",
                            "fullname": "陕西省榆林市米脂县"
                        },
                        {
                            "name": "佳县",
                            "pId": "6108",
                            "id": "610828",
                            "fullname": "陕西省榆林市佳县"
                        },
                        {
                            "name": "吴堡县",
                            "pId": "6108",
                            "id": "610829",
                            "fullname": "陕西省榆林市吴堡县"
                        },
                        {
                            "name": "清涧县",
                            "pId": "6108",
                            "id": "610830",
                            "fullname": "陕西省榆林市清涧县"
                        },
                        {
                            "name": "子洲县",
                            "pId": "6108",
                            "id": "610831",
                            "fullname": "陕西省榆林市子洲县"
                        }
                    ]
                },
                {
                    "name": "安康市",
                    "pId": "61",
                    "id": "6109",
                    "fullname": "陕西省安康市",
                    "items": [
                        {
                            "name": "汉滨区",
                            "pId": "6109",
                            "id": "610902",
                            "fullname": "陕西省安康市汉滨区"
                        },
                        {
                            "name": "汉阴县",
                            "pId": "6109",
                            "id": "610921",
                            "fullname": "陕西省安康市汉阴县"
                        },
                        {
                            "name": "石泉县",
                            "pId": "6109",
                            "id": "610922",
                            "fullname": "陕西省安康市石泉县"
                        },
                        {
                            "name": "宁陕县",
                            "pId": "6109",
                            "id": "610923",
                            "fullname": "陕西省安康市宁陕县"
                        },
                        {
                            "name": "紫阳县",
                            "pId": "6109",
                            "id": "610924",
                            "fullname": "陕西省安康市紫阳县"
                        },
                        {
                            "name": "岚皋县",
                            "pId": "6109",
                            "id": "610925",
                            "fullname": "陕西省安康市岚皋县"
                        },
                        {
                            "name": "平利县",
                            "pId": "6109",
                            "id": "610926",
                            "fullname": "陕西省安康市平利县"
                        },
                        {
                            "name": "镇坪县",
                            "pId": "6109",
                            "id": "610927",
                            "fullname": "陕西省安康市镇坪县"
                        },
                        {
                            "name": "旬阳县",
                            "pId": "6109",
                            "id": "610928",
                            "fullname": "陕西省安康市旬阳县"
                        },
                        {
                            "name": "白河县",
                            "pId": "6109",
                            "id": "610929",
                            "fullname": "陕西省安康市白河县"
                        }
                    ]
                },
                {
                    "name": "商洛市",
                    "pId": "61",
                    "id": "6110",
                    "fullname": "陕西省商洛市",
                    "items": [
                        {
                            "name": "商州区",
                            "pId": "6110",
                            "id": "611002",
                            "fullname": "陕西省商洛市商州区"
                        },
                        {
                            "name": "洛南县",
                            "pId": "6110",
                            "id": "611021",
                            "fullname": "陕西省商洛市洛南县"
                        },
                        {
                            "name": "丹凤县",
                            "pId": "6110",
                            "id": "611022",
                            "fullname": "陕西省商洛市丹凤县"
                        },
                        {
                            "name": "商南县",
                            "pId": "6110",
                            "id": "611023",
                            "fullname": "陕西省商洛市商南县"
                        },
                        {
                            "name": "山阳县",
                            "pId": "6110",
                            "id": "611024",
                            "fullname": "陕西省商洛市山阳县"
                        },
                        {
                            "name": "镇安县",
                            "pId": "6110",
                            "id": "611025",
                            "fullname": "陕西省商洛市镇安县"
                        },
                        {
                            "name": "柞水县",
                            "pId": "6110",
                            "id": "611026",
                            "fullname": "陕西省商洛市柞水县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "甘肃省",
            "pId": "1",
            "id": "62",
            "fullname": "甘肃省",
            "items": [
                {
                    "name": "兰州市",
                    "pId": "62",
                    "id": "6201",
                    "fullname": "甘肃省兰州市",
                    "items": [
                        {
                            "name": "城关区",
                            "pId": "6201",
                            "id": "620102",
                            "fullname": "甘肃省兰州市城关区"
                        },
                        {
                            "name": "七里河区",
                            "pId": "6201",
                            "id": "620103",
                            "fullname": "甘肃省兰州市七里河区"
                        },
                        {
                            "name": "西固区",
                            "pId": "6201",
                            "id": "620104",
                            "fullname": "甘肃省兰州市西固区"
                        },
                        {
                            "name": "安宁区",
                            "pId": "6201",
                            "id": "620105",
                            "fullname": "甘肃省兰州市安宁区"
                        },
                        {
                            "name": "红古区",
                            "pId": "6201",
                            "id": "620111",
                            "fullname": "甘肃省兰州市红古区"
                        },
                        {
                            "name": "永登县",
                            "pId": "6201",
                            "id": "620121",
                            "fullname": "甘肃省兰州市永登县"
                        },
                        {
                            "name": "皋兰县",
                            "pId": "6201",
                            "id": "620122",
                            "fullname": "甘肃省兰州市皋兰县"
                        },
                        {
                            "name": "榆中县",
                            "pId": "6201",
                            "id": "620123",
                            "fullname": "甘肃省兰州市榆中县"
                        }
                    ]
                },
                {
                    "name": "嘉峪关市",
                    "pId": "62",
                    "id": "6202",
                    "fullname": "甘肃省嘉峪关市",
                    "items": [
                        {
                            "name": "市辖区",
                            "pId": "6202",
                            "id": "620201",
                            "fullname": "甘肃省嘉峪关市市辖区"
                        }
                    ]
                },
                {
                    "name": "金昌市",
                    "pId": "62",
                    "id": "6203",
                    "fullname": "甘肃省金昌市",
                    "items": [
                        {
                            "name": "金川区",
                            "pId": "6203",
                            "id": "620302",
                            "fullname": "甘肃省金昌市金川区"
                        },
                        {
                            "name": "永昌县",
                            "pId": "6203",
                            "id": "620321",
                            "fullname": "甘肃省金昌市永昌县"
                        }
                    ]
                },
                {
                    "name": "白银市",
                    "pId": "62",
                    "id": "6204",
                    "fullname": "甘肃省白银市",
                    "items": [
                        {
                            "name": "白银区",
                            "pId": "6204",
                            "id": "620402",
                            "fullname": "甘肃省白银市白银区"
                        },
                        {
                            "name": "平川区",
                            "pId": "6204",
                            "id": "620403",
                            "fullname": "甘肃省白银市平川区"
                        },
                        {
                            "name": "靖远县",
                            "pId": "6204",
                            "id": "620421",
                            "fullname": "甘肃省白银市靖远县"
                        },
                        {
                            "name": "会宁县",
                            "pId": "6204",
                            "id": "620422",
                            "fullname": "甘肃省白银市会宁县"
                        },
                        {
                            "name": "景泰县",
                            "pId": "6204",
                            "id": "620423",
                            "fullname": "甘肃省白银市景泰县"
                        }
                    ]
                },
                {
                    "name": "天水市",
                    "pId": "62",
                    "id": "6205",
                    "fullname": "甘肃省天水市",
                    "items": [
                        {
                            "name": "秦州区",
                            "pId": "6205",
                            "id": "620502",
                            "fullname": "甘肃省天水市秦州区"
                        },
                        {
                            "name": "麦积区",
                            "pId": "6205",
                            "id": "620503",
                            "fullname": "甘肃省天水市麦积区"
                        },
                        {
                            "name": "清水县",
                            "pId": "6205",
                            "id": "620521",
                            "fullname": "甘肃省天水市清水县"
                        },
                        {
                            "name": "秦安县",
                            "pId": "6205",
                            "id": "620522",
                            "fullname": "甘肃省天水市秦安县"
                        },
                        {
                            "name": "甘谷县",
                            "pId": "6205",
                            "id": "620523",
                            "fullname": "甘肃省天水市甘谷县"
                        },
                        {
                            "name": "武山县",
                            "pId": "6205",
                            "id": "620524",
                            "fullname": "甘肃省天水市武山县"
                        },
                        {
                            "name": "张家川回族自治县",
                            "pId": "6205",
                            "id": "620525",
                            "fullname": "甘肃省天水市张家川回族自治县"
                        }
                    ]
                },
                {
                    "name": "武威市",
                    "pId": "62",
                    "id": "6206",
                    "fullname": "甘肃省武威市",
                    "items": [
                        {
                            "name": "凉州区",
                            "pId": "6206",
                            "id": "620602",
                            "fullname": "甘肃省武威市凉州区"
                        },
                        {
                            "name": "民勤县",
                            "pId": "6206",
                            "id": "620621",
                            "fullname": "甘肃省武威市民勤县"
                        },
                        {
                            "name": "古浪县",
                            "pId": "6206",
                            "id": "620622",
                            "fullname": "甘肃省武威市古浪县"
                        },
                        {
                            "name": "天祝藏族自治县",
                            "pId": "6206",
                            "id": "620623",
                            "fullname": "甘肃省武威市天祝藏族自治县"
                        }
                    ]
                },
                {
                    "name": "张掖市",
                    "pId": "62",
                    "id": "6207",
                    "fullname": "甘肃省张掖市",
                    "items": [
                        {
                            "name": "甘州区",
                            "pId": "6207",
                            "id": "620702",
                            "fullname": "甘肃省张掖市甘州区"
                        },
                        {
                            "name": "肃南裕固族自治县",
                            "pId": "6207",
                            "id": "620721",
                            "fullname": "甘肃省张掖市肃南裕固族自治县"
                        },
                        {
                            "name": "民乐县",
                            "pId": "6207",
                            "id": "620722",
                            "fullname": "甘肃省张掖市民乐县"
                        },
                        {
                            "name": "临泽县",
                            "pId": "6207",
                            "id": "620723",
                            "fullname": "甘肃省张掖市临泽县"
                        },
                        {
                            "name": "高台县",
                            "pId": "6207",
                            "id": "620724",
                            "fullname": "甘肃省张掖市高台县"
                        },
                        {
                            "name": "山丹县",
                            "pId": "6207",
                            "id": "620725",
                            "fullname": "甘肃省张掖市山丹县"
                        }
                    ]
                },
                {
                    "name": "平凉市",
                    "pId": "62",
                    "id": "6208",
                    "fullname": "甘肃省平凉市",
                    "items": [
                        {
                            "name": "崆峒区",
                            "pId": "6208",
                            "id": "620802",
                            "fullname": "甘肃省平凉市崆峒区"
                        },
                        {
                            "name": "泾川县",
                            "pId": "6208",
                            "id": "620821",
                            "fullname": "甘肃省平凉市泾川县"
                        },
                        {
                            "name": "灵台县",
                            "pId": "6208",
                            "id": "620822",
                            "fullname": "甘肃省平凉市灵台县"
                        },
                        {
                            "name": "崇信县",
                            "pId": "6208",
                            "id": "620823",
                            "fullname": "甘肃省平凉市崇信县"
                        },
                        {
                            "name": "华亭县",
                            "pId": "6208",
                            "id": "620824",
                            "fullname": "甘肃省平凉市华亭县"
                        },
                        {
                            "name": "庄浪县",
                            "pId": "6208",
                            "id": "620825",
                            "fullname": "甘肃省平凉市庄浪县"
                        },
                        {
                            "name": "静宁县",
                            "pId": "6208",
                            "id": "620826",
                            "fullname": "甘肃省平凉市静宁县"
                        }
                    ]
                },
                {
                    "name": "酒泉市",
                    "pId": "62",
                    "id": "6209",
                    "fullname": "甘肃省酒泉市",
                    "items": [
                        {
                            "name": "肃州区",
                            "pId": "6209",
                            "id": "620902",
                            "fullname": "甘肃省酒泉市肃州区"
                        },
                        {
                            "name": "金塔县",
                            "pId": "6209",
                            "id": "620921",
                            "fullname": "甘肃省酒泉市金塔县"
                        },
                        {
                            "name": "瓜州县",
                            "pId": "6209",
                            "id": "620922",
                            "fullname": "甘肃省酒泉市瓜州县"
                        },
                        {
                            "name": "肃北蒙古族自治县",
                            "pId": "6209",
                            "id": "620923",
                            "fullname": "甘肃省酒泉市肃北蒙古族自治县"
                        },
                        {
                            "name": "阿克塞哈萨克族自治县",
                            "pId": "6209",
                            "id": "620924",
                            "fullname": "甘肃省酒泉市阿克塞哈萨克族自治县"
                        },
                        {
                            "name": "玉门市",
                            "pId": "6209",
                            "id": "620981",
                            "fullname": "甘肃省酒泉市玉门市"
                        },
                        {
                            "name": "敦煌市",
                            "pId": "6209",
                            "id": "620982",
                            "fullname": "甘肃省酒泉市敦煌市"
                        }
                    ]
                },
                {
                    "name": "庆阳市",
                    "pId": "62",
                    "id": "6210",
                    "fullname": "甘肃省庆阳市",
                    "items": [
                        {
                            "name": "西峰区",
                            "pId": "6210",
                            "id": "621002",
                            "fullname": "甘肃省庆阳市西峰区"
                        },
                        {
                            "name": "庆城县",
                            "pId": "6210",
                            "id": "621021",
                            "fullname": "甘肃省庆阳市庆城县"
                        },
                        {
                            "name": "环县",
                            "pId": "6210",
                            "id": "621022",
                            "fullname": "甘肃省庆阳市环县"
                        },
                        {
                            "name": "华池县",
                            "pId": "6210",
                            "id": "621023",
                            "fullname": "甘肃省庆阳市华池县"
                        },
                        {
                            "name": "合水县",
                            "pId": "6210",
                            "id": "621024",
                            "fullname": "甘肃省庆阳市合水县"
                        },
                        {
                            "name": "正宁县",
                            "pId": "6210",
                            "id": "621025",
                            "fullname": "甘肃省庆阳市正宁县"
                        },
                        {
                            "name": "宁县",
                            "pId": "6210",
                            "id": "621026",
                            "fullname": "甘肃省庆阳市宁县"
                        },
                        {
                            "name": "镇原县",
                            "pId": "6210",
                            "id": "621027",
                            "fullname": "甘肃省庆阳市镇原县"
                        }
                    ]
                },
                {
                    "name": "定西市",
                    "pId": "62",
                    "id": "6211",
                    "fullname": "甘肃省定西市",
                    "items": [
                        {
                            "name": "安定区",
                            "pId": "6211",
                            "id": "621102",
                            "fullname": "甘肃省定西市安定区"
                        },
                        {
                            "name": "通渭县",
                            "pId": "6211",
                            "id": "621121",
                            "fullname": "甘肃省定西市通渭县"
                        },
                        {
                            "name": "陇西县",
                            "pId": "6211",
                            "id": "621122",
                            "fullname": "甘肃省定西市陇西县"
                        },
                        {
                            "name": "渭源县",
                            "pId": "6211",
                            "id": "621123",
                            "fullname": "甘肃省定西市渭源县"
                        },
                        {
                            "name": "临洮县",
                            "pId": "6211",
                            "id": "621124",
                            "fullname": "甘肃省定西市临洮县"
                        },
                        {
                            "name": "漳县",
                            "pId": "6211",
                            "id": "621125",
                            "fullname": "甘肃省定西市漳县"
                        },
                        {
                            "name": "岷县",
                            "pId": "6211",
                            "id": "621126",
                            "fullname": "甘肃省定西市岷县"
                        }
                    ]
                },
                {
                    "name": "陇南市",
                    "pId": "62",
                    "id": "6212",
                    "fullname": "甘肃省陇南市",
                    "items": [
                        {
                            "name": "武都区",
                            "pId": "6212",
                            "id": "621202",
                            "fullname": "甘肃省陇南市武都区"
                        },
                        {
                            "name": "成县",
                            "pId": "6212",
                            "id": "621221",
                            "fullname": "甘肃省陇南市成县"
                        },
                        {
                            "name": "文县",
                            "pId": "6212",
                            "id": "621222",
                            "fullname": "甘肃省陇南市文县"
                        },
                        {
                            "name": "宕昌县",
                            "pId": "6212",
                            "id": "621223",
                            "fullname": "甘肃省陇南市宕昌县"
                        },
                        {
                            "name": "康县",
                            "pId": "6212",
                            "id": "621224",
                            "fullname": "甘肃省陇南市康县"
                        },
                        {
                            "name": "西和县",
                            "pId": "6212",
                            "id": "621225",
                            "fullname": "甘肃省陇南市西和县"
                        },
                        {
                            "name": "礼县",
                            "pId": "6212",
                            "id": "621226",
                            "fullname": "甘肃省陇南市礼县"
                        },
                        {
                            "name": "徽县",
                            "pId": "6212",
                            "id": "621227",
                            "fullname": "甘肃省陇南市徽县"
                        },
                        {
                            "name": "两当县",
                            "pId": "6212",
                            "id": "621228",
                            "fullname": "甘肃省陇南市两当县"
                        }
                    ]
                },
                {
                    "name": "临夏回族自治州",
                    "pId": "62",
                    "id": "6229",
                    "fullname": "甘肃省临夏回族自治州",
                    "items": [
                        {
                            "name": "临夏市",
                            "pId": "6229",
                            "id": "622901",
                            "fullname": "甘肃省临夏回族自治州临夏市"
                        },
                        {
                            "name": "临夏县",
                            "pId": "6229",
                            "id": "622921",
                            "fullname": "甘肃省临夏回族自治州临夏县"
                        },
                        {
                            "name": "康乐县",
                            "pId": "6229",
                            "id": "622922",
                            "fullname": "甘肃省临夏回族自治州康乐县"
                        },
                        {
                            "name": "永靖县",
                            "pId": "6229",
                            "id": "622923",
                            "fullname": "甘肃省临夏回族自治州永靖县"
                        },
                        {
                            "name": "广河县",
                            "pId": "6229",
                            "id": "622924",
                            "fullname": "甘肃省临夏回族自治州广河县"
                        },
                        {
                            "name": "和政县",
                            "pId": "6229",
                            "id": "622925",
                            "fullname": "甘肃省临夏回族自治州和政县"
                        },
                        {
                            "name": "东乡族自治县",
                            "pId": "6229",
                            "id": "622926",
                            "fullname": "甘肃省临夏回族自治州东乡族自治县"
                        },
                        {
                            "name": "积石山保安族东乡族撒拉族自治县",
                            "pId": "6229",
                            "id": "622927",
                            "fullname": "甘肃省临夏回族自治州积石山保安族东乡族撒拉族自治县"
                        }
                    ]
                },
                {
                    "name": "甘南藏族自治州",
                    "pId": "62",
                    "id": "6230",
                    "fullname": "甘肃省甘南藏族自治州",
                    "items": [
                        {
                            "name": "合作市",
                            "pId": "6230",
                            "id": "623001",
                            "fullname": "甘肃省甘南藏族自治州合作市"
                        },
                        {
                            "name": "临潭县",
                            "pId": "6230",
                            "id": "623021",
                            "fullname": "甘肃省甘南藏族自治州临潭县"
                        },
                        {
                            "name": "卓尼县",
                            "pId": "6230",
                            "id": "623022",
                            "fullname": "甘肃省甘南藏族自治州卓尼县"
                        },
                        {
                            "name": "舟曲县",
                            "pId": "6230",
                            "id": "623023",
                            "fullname": "甘肃省甘南藏族自治州舟曲县"
                        },
                        {
                            "name": "迭部县",
                            "pId": "6230",
                            "id": "623024",
                            "fullname": "甘肃省甘南藏族自治州迭部县"
                        },
                        {
                            "name": "玛曲县",
                            "pId": "6230",
                            "id": "623025",
                            "fullname": "甘肃省甘南藏族自治州玛曲县"
                        },
                        {
                            "name": "碌曲县",
                            "pId": "6230",
                            "id": "623026",
                            "fullname": "甘肃省甘南藏族自治州碌曲县"
                        },
                        {
                            "name": "夏河县",
                            "pId": "6230",
                            "id": "623027",
                            "fullname": "甘肃省甘南藏族自治州夏河县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "青海省",
            "pId": "1",
            "id": "63",
            "fullname": "青海省",
            "items": [
                {
                    "name": "西宁市",
                    "pId": "63",
                    "id": "6301",
                    "fullname": "青海省西宁市",
                    "items": [
                        {
                            "name": "城东区",
                            "pId": "6301",
                            "id": "630102",
                            "fullname": "青海省西宁市城东区"
                        },
                        {
                            "name": "城中区",
                            "pId": "6301",
                            "id": "630103",
                            "fullname": "青海省西宁市城中区"
                        },
                        {
                            "name": "城西区",
                            "pId": "6301",
                            "id": "630104",
                            "fullname": "青海省西宁市城西区"
                        },
                        {
                            "name": "城北区",
                            "pId": "6301",
                            "id": "630105",
                            "fullname": "青海省西宁市城北区"
                        },
                        {
                            "name": "大通回族土族自治县",
                            "pId": "6301",
                            "id": "630121",
                            "fullname": "青海省西宁市大通回族土族自治县"
                        },
                        {
                            "name": "湟中县",
                            "pId": "6301",
                            "id": "630122",
                            "fullname": "青海省西宁市湟中县"
                        },
                        {
                            "name": "湟源县",
                            "pId": "6301",
                            "id": "630123",
                            "fullname": "青海省西宁市湟源县"
                        }
                    ]
                },
                {
                    "name": "海东市",
                    "pId": "63",
                    "id": "6302",
                    "fullname": "青海省海东市",
                    "items": [
                        {
                            "name": "乐都区",
                            "pId": "6302",
                            "id": "630202",
                            "fullname": "青海省海东市乐都区"
                        },
                        {
                            "name": "平安县",
                            "pId": "6302",
                            "id": "630221",
                            "fullname": "青海省海东市平安县"
                        },
                        {
                            "name": "民和回族土族自治县",
                            "pId": "6302",
                            "id": "630222",
                            "fullname": "青海省海东市民和回族土族自治县"
                        },
                        {
                            "name": "互助土族自治县",
                            "pId": "6302",
                            "id": "630223",
                            "fullname": "青海省海东市互助土族自治县"
                        },
                        {
                            "name": "化隆回族自治县",
                            "pId": "6302",
                            "id": "630224",
                            "fullname": "青海省海东市化隆回族自治县"
                        },
                        {
                            "name": "循化撒拉族自治县",
                            "pId": "6302",
                            "id": "630225",
                            "fullname": "青海省海东市循化撒拉族自治县"
                        }
                    ]
                },
                {
                    "name": "海北藏族自治州",
                    "pId": "63",
                    "id": "6322",
                    "fullname": "青海省海北藏族自治州",
                    "items": [
                        {
                            "name": "门源回族自治县",
                            "pId": "6322",
                            "id": "632221",
                            "fullname": "青海省海北藏族自治州门源回族自治县"
                        },
                        {
                            "name": "祁连县",
                            "pId": "6322",
                            "id": "632222",
                            "fullname": "青海省海北藏族自治州祁连县"
                        },
                        {
                            "name": "海晏县",
                            "pId": "6322",
                            "id": "632223",
                            "fullname": "青海省海北藏族自治州海晏县"
                        },
                        {
                            "name": "刚察县",
                            "pId": "6322",
                            "id": "632224",
                            "fullname": "青海省海北藏族自治州刚察县"
                        }
                    ]
                },
                {
                    "name": "黄南藏族自治州",
                    "pId": "63",
                    "id": "6323",
                    "fullname": "青海省黄南藏族自治州",
                    "items": [
                        {
                            "name": "同仁县",
                            "pId": "6323",
                            "id": "632321",
                            "fullname": "青海省黄南藏族自治州同仁县"
                        },
                        {
                            "name": "尖扎县",
                            "pId": "6323",
                            "id": "632322",
                            "fullname": "青海省黄南藏族自治州尖扎县"
                        },
                        {
                            "name": "泽库县",
                            "pId": "6323",
                            "id": "632323",
                            "fullname": "青海省黄南藏族自治州泽库县"
                        },
                        {
                            "name": "河南蒙古族自治县",
                            "pId": "6323",
                            "id": "632324",
                            "fullname": "青海省黄南藏族自治州河南蒙古族自治县"
                        }
                    ]
                },
                {
                    "name": "海南藏族自治州",
                    "pId": "63",
                    "id": "6325",
                    "fullname": "青海省海南藏族自治州",
                    "items": [
                        {
                            "name": "共和县",
                            "pId": "6325",
                            "id": "632521",
                            "fullname": "青海省海南藏族自治州共和县"
                        },
                        {
                            "name": "同德县",
                            "pId": "6325",
                            "id": "632522",
                            "fullname": "青海省海南藏族自治州同德县"
                        },
                        {
                            "name": "贵德县",
                            "pId": "6325",
                            "id": "632523",
                            "fullname": "青海省海南藏族自治州贵德县"
                        },
                        {
                            "name": "兴海县",
                            "pId": "6325",
                            "id": "632524",
                            "fullname": "青海省海南藏族自治州兴海县"
                        },
                        {
                            "name": "贵南县",
                            "pId": "6325",
                            "id": "632525",
                            "fullname": "青海省海南藏族自治州贵南县"
                        }
                    ]
                },
                {
                    "name": "果洛藏族自治州",
                    "pId": "63",
                    "id": "6326",
                    "fullname": "青海省果洛藏族自治州",
                    "items": [
                        {
                            "name": "玛沁县",
                            "pId": "6326",
                            "id": "632621",
                            "fullname": "青海省果洛藏族自治州玛沁县"
                        },
                        {
                            "name": "班玛县",
                            "pId": "6326",
                            "id": "632622",
                            "fullname": "青海省果洛藏族自治州班玛县"
                        },
                        {
                            "name": "甘德县",
                            "pId": "6326",
                            "id": "632623",
                            "fullname": "青海省果洛藏族自治州甘德县"
                        },
                        {
                            "name": "达日县",
                            "pId": "6326",
                            "id": "632624",
                            "fullname": "青海省果洛藏族自治州达日县"
                        },
                        {
                            "name": "久治县",
                            "pId": "6326",
                            "id": "632625",
                            "fullname": "青海省果洛藏族自治州久治县"
                        },
                        {
                            "name": "玛多县",
                            "pId": "6326",
                            "id": "632626",
                            "fullname": "青海省果洛藏族自治州玛多县"
                        }
                    ]
                },
                {
                    "name": "玉树藏族自治州",
                    "pId": "63",
                    "id": "6327",
                    "fullname": "青海省玉树藏族自治州",
                    "items": [
                        {
                            "name": "玉树市",
                            "pId": "6327",
                            "id": "632701",
                            "fullname": "青海省玉树藏族自治州玉树市"
                        },
                        {
                            "name": "杂多县",
                            "pId": "6327",
                            "id": "632722",
                            "fullname": "青海省玉树藏族自治州杂多县"
                        },
                        {
                            "name": "称多县",
                            "pId": "6327",
                            "id": "632723",
                            "fullname": "青海省玉树藏族自治州称多县"
                        },
                        {
                            "name": "治多县",
                            "pId": "6327",
                            "id": "632724",
                            "fullname": "青海省玉树藏族自治州治多县"
                        },
                        {
                            "name": "囊谦县",
                            "pId": "6327",
                            "id": "632725",
                            "fullname": "青海省玉树藏族自治州囊谦县"
                        },
                        {
                            "name": "曲麻莱县",
                            "pId": "6327",
                            "id": "632726",
                            "fullname": "青海省玉树藏族自治州曲麻莱县"
                        }
                    ]
                },
                {
                    "name": "海西蒙古族藏族自治州",
                    "pId": "63",
                    "id": "6328",
                    "fullname": "青海省海西蒙古族藏族自治州",
                    "items": [
                        {
                            "name": "格尔木市",
                            "pId": "6328",
                            "id": "632801",
                            "fullname": "青海省海西蒙古族藏族自治州格尔木市"
                        },
                        {
                            "name": "德令哈市",
                            "pId": "6328",
                            "id": "632802",
                            "fullname": "青海省海西蒙古族藏族自治州德令哈市"
                        },
                        {
                            "name": "乌兰县",
                            "pId": "6328",
                            "id": "632821",
                            "fullname": "青海省海西蒙古族藏族自治州乌兰县"
                        },
                        {
                            "name": "都兰县",
                            "pId": "6328",
                            "id": "632822",
                            "fullname": "青海省海西蒙古族藏族自治州都兰县"
                        },
                        {
                            "name": "天峻县",
                            "pId": "6328",
                            "id": "632823",
                            "fullname": "青海省海西蒙古族藏族自治州天峻县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "宁夏回族自治区",
            "pId": "1",
            "id": "64",
            "fullname": "宁夏回族自治区",
            "items": [
                {
                    "name": "银川市",
                    "pId": "64",
                    "id": "6401",
                    "fullname": "宁夏回族自治区银川市",
                    "items": [
                        {
                            "name": "兴庆区",
                            "pId": "6401",
                            "id": "640104",
                            "fullname": "宁夏回族自治区银川市兴庆区"
                        },
                        {
                            "name": "西夏区",
                            "pId": "6401",
                            "id": "640105",
                            "fullname": "宁夏回族自治区银川市西夏区"
                        },
                        {
                            "name": "金凤区",
                            "pId": "6401",
                            "id": "640106",
                            "fullname": "宁夏回族自治区银川市金凤区"
                        },
                        {
                            "name": "永宁县",
                            "pId": "6401",
                            "id": "640121",
                            "fullname": "宁夏回族自治区银川市永宁县"
                        },
                        {
                            "name": "贺兰县",
                            "pId": "6401",
                            "id": "640122",
                            "fullname": "宁夏回族自治区银川市贺兰县"
                        },
                        {
                            "name": "灵武市",
                            "pId": "6401",
                            "id": "640181",
                            "fullname": "宁夏回族自治区银川市灵武市"
                        }
                    ]
                },
                {
                    "name": "石嘴山市",
                    "pId": "64",
                    "id": "6402",
                    "fullname": "宁夏回族自治区石嘴山市",
                    "items": [
                        {
                            "name": "大武口区",
                            "pId": "6402",
                            "id": "640202",
                            "fullname": "宁夏回族自治区石嘴山市大武口区"
                        },
                        {
                            "name": "惠农区",
                            "pId": "6402",
                            "id": "640205",
                            "fullname": "宁夏回族自治区石嘴山市惠农区"
                        },
                        {
                            "name": "平罗县",
                            "pId": "6402",
                            "id": "640221",
                            "fullname": "宁夏回族自治区石嘴山市平罗县"
                        }
                    ]
                },
                {
                    "name": "吴忠市",
                    "pId": "64",
                    "id": "6403",
                    "fullname": "宁夏回族自治区吴忠市",
                    "items": [
                        {
                            "name": "利通区",
                            "pId": "6403",
                            "id": "640302",
                            "fullname": "宁夏回族自治区吴忠市利通区"
                        },
                        {
                            "name": "红寺堡区",
                            "pId": "6403",
                            "id": "640303",
                            "fullname": "宁夏回族自治区吴忠市红寺堡区"
                        },
                        {
                            "name": "盐池县",
                            "pId": "6403",
                            "id": "640323",
                            "fullname": "宁夏回族自治区吴忠市盐池县"
                        },
                        {
                            "name": "同心县",
                            "pId": "6403",
                            "id": "640324",
                            "fullname": "宁夏回族自治区吴忠市同心县"
                        },
                        {
                            "name": "青铜峡市",
                            "pId": "6403",
                            "id": "640381",
                            "fullname": "宁夏回族自治区吴忠市青铜峡市"
                        }
                    ]
                },
                {
                    "name": "固原市",
                    "pId": "64",
                    "id": "6404",
                    "fullname": "宁夏回族自治区固原市",
                    "items": [
                        {
                            "name": "原州区",
                            "pId": "6404",
                            "id": "640402",
                            "fullname": "宁夏回族自治区固原市原州区"
                        },
                        {
                            "name": "西吉县",
                            "pId": "6404",
                            "id": "640422",
                            "fullname": "宁夏回族自治区固原市西吉县"
                        },
                        {
                            "name": "隆德县",
                            "pId": "6404",
                            "id": "640423",
                            "fullname": "宁夏回族自治区固原市隆德县"
                        },
                        {
                            "name": "泾源县",
                            "pId": "6404",
                            "id": "640424",
                            "fullname": "宁夏回族自治区固原市泾源县"
                        },
                        {
                            "name": "彭阳县",
                            "pId": "6404",
                            "id": "640425",
                            "fullname": "宁夏回族自治区固原市彭阳县"
                        }
                    ]
                },
                {
                    "name": "中卫市",
                    "pId": "64",
                    "id": "6405",
                    "fullname": "宁夏回族自治区中卫市",
                    "items": [
                        {
                            "name": "沙坡头区",
                            "pId": "6405",
                            "id": "640502",
                            "fullname": "宁夏回族自治区中卫市沙坡头区"
                        },
                        {
                            "name": "中宁县",
                            "pId": "6405",
                            "id": "640521",
                            "fullname": "宁夏回族自治区中卫市中宁县"
                        },
                        {
                            "name": "海原县",
                            "pId": "6405",
                            "id": "640522",
                            "fullname": "宁夏回族自治区中卫市海原县"
                        }
                    ]
                }
            ]
        },
        {
            "name": "新疆维吾尔自治区",
            "pId": "1",
            "id": "65",
            "fullname": "新疆维吾尔自治区",
            "items": [
                {
                    "name": "乌鲁木齐市",
                    "pId": "65",
                    "id": "6501",
                    "fullname": "新疆维吾尔自治区乌鲁木齐市",
                    "items": [
                        {
                            "name": "天山区",
                            "pId": "6501",
                            "id": "650102",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市天山区"
                        },
                        {
                            "name": "沙依巴克区",
                            "pId": "6501",
                            "id": "650103",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市沙依巴克区"
                        },
                        {
                            "name": "新市区",
                            "pId": "6501",
                            "id": "650104",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市新市区"
                        },
                        {
                            "name": "水磨沟区",
                            "pId": "6501",
                            "id": "650105",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市水磨沟区"
                        },
                        {
                            "name": "头屯河区",
                            "pId": "6501",
                            "id": "650106",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市头屯河区"
                        },
                        {
                            "name": "达坂城区",
                            "pId": "6501",
                            "id": "650107",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市达坂城区"
                        },
                        {
                            "name": "米东区",
                            "pId": "6501",
                            "id": "650109",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市米东区"
                        },
                        {
                            "name": "乌鲁木齐县",
                            "pId": "6501",
                            "id": "650121",
                            "fullname": "新疆维吾尔自治区乌鲁木齐市乌鲁木齐县"
                        }
                    ]
                },
                {
                    "name": "克拉玛依市",
                    "pId": "65",
                    "id": "6502",
                    "fullname": "新疆维吾尔自治区克拉玛依市",
                    "items": [
                        {
                            "name": "独山子区",
                            "pId": "6502",
                            "id": "650202",
                            "fullname": "新疆维吾尔自治区克拉玛依市独山子区"
                        },
                        {
                            "name": "克拉玛依区",
                            "pId": "6502",
                            "id": "650203",
                            "fullname": "新疆维吾尔自治区克拉玛依市克拉玛依区"
                        },
                        {
                            "name": "白碱滩区",
                            "pId": "6502",
                            "id": "650204",
                            "fullname": "新疆维吾尔自治区克拉玛依市白碱滩区"
                        },
                        {
                            "name": "乌尔禾区",
                            "pId": "6502",
                            "id": "650205",
                            "fullname": "新疆维吾尔自治区克拉玛依市乌尔禾区"
                        }
                    ]
                },
                {
                    "name": "吐鲁番地区",
                    "pId": "65",
                    "id": "6521",
                    "fullname": "新疆维吾尔自治区吐鲁番地区",
                    "items": [
                        {
                            "name": "吐鲁番市",
                            "pId": "6521",
                            "id": "652101",
                            "fullname": "新疆维吾尔自治区吐鲁番地区吐鲁番市"
                        },
                        {
                            "name": "鄯善县",
                            "pId": "6521",
                            "id": "652122",
                            "fullname": "新疆维吾尔自治区吐鲁番地区鄯善县"
                        },
                        {
                            "name": "托克逊县",
                            "pId": "6521",
                            "id": "652123",
                            "fullname": "新疆维吾尔自治区吐鲁番地区托克逊县"
                        }
                    ]
                },
                {
                    "name": "哈密地区",
                    "pId": "65",
                    "id": "6522",
                    "fullname": "新疆维吾尔自治区哈密地区",
                    "items": [
                        {
                            "name": "哈密市",
                            "pId": "6522",
                            "id": "652201",
                            "fullname": "新疆维吾尔自治区哈密地区哈密市"
                        },
                        {
                            "name": "巴里坤哈萨克自治县",
                            "pId": "6522",
                            "id": "652222",
                            "fullname": "新疆维吾尔自治区哈密地区巴里坤哈萨克自治县"
                        },
                        {
                            "name": "伊吾县",
                            "pId": "6522",
                            "id": "652223",
                            "fullname": "新疆维吾尔自治区哈密地区伊吾县"
                        }
                    ]
                },
                {
                    "name": "昌吉回族自治州",
                    "pId": "65",
                    "id": "6523",
                    "fullname": "新疆维吾尔自治区昌吉回族自治州",
                    "items": [
                        {
                            "name": "昌吉市",
                            "pId": "6523",
                            "id": "652301",
                            "fullname": "新疆维吾尔自治区昌吉回族自治州昌吉市"
                        },
                        {
                            "name": "阜康市",
                            "pId": "6523",
                            "id": "652302",
                            "fullname": "新疆维吾尔自治区昌吉回族自治州阜康市"
                        },
                        {
                            "name": "呼图壁县",
                            "pId": "6523",
                            "id": "652323",
                            "fullname": "新疆维吾尔自治区昌吉回族自治州呼图壁县"
                        },
                        {
                            "name": "玛纳斯县",
                            "pId": "6523",
                            "id": "652324",
                            "fullname": "新疆维吾尔自治区昌吉回族自治州玛纳斯县"
                        },
                        {
                            "name": "奇台县",
                            "pId": "6523",
                            "id": "652325",
                            "fullname": "新疆维吾尔自治区昌吉回族自治州奇台县"
                        },
                        {
                            "name": "吉木萨尔县",
                            "pId": "6523",
                            "id": "652327",
                            "fullname": "新疆维吾尔自治区昌吉回族自治州吉木萨尔县"
                        },
                        {
                            "name": "木垒哈萨克自治县",
                            "pId": "6523",
                            "id": "652328",
                            "fullname": "新疆维吾尔自治区昌吉回族自治州木垒哈萨克自治县"
                        }
                    ]
                },
                {
                    "name": "博尔塔拉蒙古自治州",
                    "pId": "65",
                    "id": "6527",
                    "fullname": "新疆维吾尔自治区博尔塔拉蒙古自治州",
                    "items": [
                        {
                            "name": "博乐市",
                            "pId": "6527",
                            "id": "652701",
                            "fullname": "新疆维吾尔自治区博尔塔拉蒙古自治州博乐市"
                        },
                        {
                            "name": "阿拉山口市",
                            "pId": "6527",
                            "id": "652702",
                            "fullname": "新疆维吾尔自治区博尔塔拉蒙古自治州阿拉山口市"
                        },
                        {
                            "name": "精河县",
                            "pId": "6527",
                            "id": "652722",
                            "fullname": "新疆维吾尔自治区博尔塔拉蒙古自治州精河县"
                        },
                        {
                            "name": "温泉县",
                            "pId": "6527",
                            "id": "652723",
                            "fullname": "新疆维吾尔自治区博尔塔拉蒙古自治州温泉县"
                        }
                    ]
                },
                {
                    "name": "巴音郭楞蒙古自治州",
                    "pId": "65",
                    "id": "6528",
                    "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州",
                    "items": [
                        {
                            "name": "库尔勒市",
                            "pId": "6528",
                            "id": "652801",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州库尔勒市"
                        },
                        {
                            "name": "轮台县",
                            "pId": "6528",
                            "id": "652822",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州轮台县"
                        },
                        {
                            "name": "尉犁县",
                            "pId": "6528",
                            "id": "652823",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州尉犁县"
                        },
                        {
                            "name": "若羌县",
                            "pId": "6528",
                            "id": "652824",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州若羌县"
                        },
                        {
                            "name": "且末县",
                            "pId": "6528",
                            "id": "652825",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州且末县"
                        },
                        {
                            "name": "焉耆回族自治县",
                            "pId": "6528",
                            "id": "652826",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州焉耆回族自治县"
                        },
                        {
                            "name": "和静县",
                            "pId": "6528",
                            "id": "652827",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州和静县"
                        },
                        {
                            "name": "和硕县",
                            "pId": "6528",
                            "id": "652828",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州和硕县"
                        },
                        {
                            "name": "博湖县",
                            "pId": "6528",
                            "id": "652829",
                            "fullname": "新疆维吾尔自治区巴音郭楞蒙古自治州博湖县"
                        }
                    ]
                },
                {
                    "name": "阿克苏地区",
                    "pId": "65",
                    "id": "6529",
                    "fullname": "新疆维吾尔自治区阿克苏地区",
                    "items": [
                        {
                            "name": "阿克苏市",
                            "pId": "6529",
                            "id": "652901",
                            "fullname": "新疆维吾尔自治区阿克苏地区阿克苏市"
                        },
                        {
                            "name": "温宿县",
                            "pId": "6529",
                            "id": "652922",
                            "fullname": "新疆维吾尔自治区阿克苏地区温宿县"
                        },
                        {
                            "name": "库车县",
                            "pId": "6529",
                            "id": "652923",
                            "fullname": "新疆维吾尔自治区阿克苏地区库车县"
                        },
                        {
                            "name": "沙雅县",
                            "pId": "6529",
                            "id": "652924",
                            "fullname": "新疆维吾尔自治区阿克苏地区沙雅县"
                        },
                        {
                            "name": "新和县",
                            "pId": "6529",
                            "id": "652925",
                            "fullname": "新疆维吾尔自治区阿克苏地区新和县"
                        },
                        {
                            "name": "拜城县",
                            "pId": "6529",
                            "id": "652926",
                            "fullname": "新疆维吾尔自治区阿克苏地区拜城县"
                        },
                        {
                            "name": "乌什县",
                            "pId": "6529",
                            "id": "652927",
                            "fullname": "新疆维吾尔自治区阿克苏地区乌什县"
                        },
                        {
                            "name": "阿瓦提县",
                            "pId": "6529",
                            "id": "652928",
                            "fullname": "新疆维吾尔自治区阿克苏地区阿瓦提县"
                        },
                        {
                            "name": "柯坪县",
                            "pId": "6529",
                            "id": "652929",
                            "fullname": "新疆维吾尔自治区阿克苏地区柯坪县"
                        }
                    ]
                },
                {
                    "name": "克孜勒苏柯尔克孜自治州",
                    "pId": "65",
                    "id": "6530",
                    "fullname": "新疆维吾尔自治区克孜勒苏柯尔克孜自治州",
                    "items": [
                        {
                            "name": "阿图什市",
                            "pId": "6530",
                            "id": "653001",
                            "fullname": "新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿图什市"
                        },
                        {
                            "name": "阿克陶县",
                            "pId": "6530",
                            "id": "653022",
                            "fullname": "新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿克陶县"
                        },
                        {
                            "name": "阿合奇县",
                            "pId": "6530",
                            "id": "653023",
                            "fullname": "新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿合奇县"
                        },
                        {
                            "name": "乌恰县",
                            "pId": "6530",
                            "id": "653024",
                            "fullname": "新疆维吾尔自治区克孜勒苏柯尔克孜自治州乌恰县"
                        }
                    ]
                },
                {
                    "name": "喀什地区",
                    "pId": "65",
                    "id": "6531",
                    "fullname": "新疆维吾尔自治区喀什地区",
                    "items": [
                        {
                            "name": "喀什市",
                            "pId": "6531",
                            "id": "653101",
                            "fullname": "新疆维吾尔自治区喀什地区喀什市"
                        },
                        {
                            "name": "疏附县",
                            "pId": "6531",
                            "id": "653121",
                            "fullname": "新疆维吾尔自治区喀什地区疏附县"
                        },
                        {
                            "name": "疏勒县",
                            "pId": "6531",
                            "id": "653122",
                            "fullname": "新疆维吾尔自治区喀什地区疏勒县"
                        },
                        {
                            "name": "英吉沙县",
                            "pId": "6531",
                            "id": "653123",
                            "fullname": "新疆维吾尔自治区喀什地区英吉沙县"
                        },
                        {
                            "name": "泽普县",
                            "pId": "6531",
                            "id": "653124",
                            "fullname": "新疆维吾尔自治区喀什地区泽普县"
                        },
                        {
                            "name": "莎车县",
                            "pId": "6531",
                            "id": "653125",
                            "fullname": "新疆维吾尔自治区喀什地区莎车县"
                        },
                        {
                            "name": "叶城县",
                            "pId": "6531",
                            "id": "653126",
                            "fullname": "新疆维吾尔自治区喀什地区叶城县"
                        },
                        {
                            "name": "麦盖提县",
                            "pId": "6531",
                            "id": "653127",
                            "fullname": "新疆维吾尔自治区喀什地区麦盖提县"
                        },
                        {
                            "name": "岳普湖县",
                            "pId": "6531",
                            "id": "653128",
                            "fullname": "新疆维吾尔自治区喀什地区岳普湖县"
                        },
                        {
                            "name": "伽师县",
                            "pId": "6531",
                            "id": "653129",
                            "fullname": "新疆维吾尔自治区喀什地区伽师县"
                        },
                        {
                            "name": "巴楚县",
                            "pId": "6531",
                            "id": "653130",
                            "fullname": "新疆维吾尔自治区喀什地区巴楚县"
                        },
                        {
                            "name": "塔什库尔干塔吉克自治县",
                            "pId": "6531",
                            "id": "653131",
                            "fullname": "新疆维吾尔自治区喀什地区塔什库尔干塔吉克自治县"
                        }
                    ]
                },
                {
                    "name": "和田地区",
                    "pId": "65",
                    "id": "6532",
                    "fullname": "新疆维吾尔自治区和田地区",
                    "items": [
                        {
                            "name": "和田市",
                            "pId": "6532",
                            "id": "653201",
                            "fullname": "新疆维吾尔自治区和田地区和田市"
                        },
                        {
                            "name": "和田县",
                            "pId": "6532",
                            "id": "653221",
                            "fullname": "新疆维吾尔自治区和田地区和田县"
                        },
                        {
                            "name": "墨玉县",
                            "pId": "6532",
                            "id": "653222",
                            "fullname": "新疆维吾尔自治区和田地区墨玉县"
                        },
                        {
                            "name": "皮山县",
                            "pId": "6532",
                            "id": "653223",
                            "fullname": "新疆维吾尔自治区和田地区皮山县"
                        },
                        {
                            "name": "洛浦县",
                            "pId": "6532",
                            "id": "653224",
                            "fullname": "新疆维吾尔自治区和田地区洛浦县"
                        },
                        {
                            "name": "策勒县",
                            "pId": "6532",
                            "id": "653225",
                            "fullname": "新疆维吾尔自治区和田地区策勒县"
                        },
                        {
                            "name": "于田县",
                            "pId": "6532",
                            "id": "653226",
                            "fullname": "新疆维吾尔自治区和田地区于田县"
                        },
                        {
                            "name": "民丰县",
                            "pId": "6532",
                            "id": "653227",
                            "fullname": "新疆维吾尔自治区和田地区民丰县"
                        }
                    ]
                },
                {
                    "name": "伊犁哈萨克自治州",
                    "pId": "65",
                    "id": "6540",
                    "fullname": "新疆维吾尔自治区伊犁哈萨克自治州",
                    "items": [
                        {
                            "name": "伊宁市",
                            "pId": "6540",
                            "id": "654002",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州伊宁市"
                        },
                        {
                            "name": "奎屯市",
                            "pId": "6540",
                            "id": "654003",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州奎屯市"
                        },
                        {
                            "name": "伊宁县",
                            "pId": "6540",
                            "id": "654021",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州伊宁县"
                        },
                        {
                            "name": "察布查尔锡伯自治县",
                            "pId": "6540",
                            "id": "654022",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州察布查尔锡伯自治县"
                        },
                        {
                            "name": "霍城县",
                            "pId": "6540",
                            "id": "654023",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州霍城县"
                        },
                        {
                            "name": "巩留县",
                            "pId": "6540",
                            "id": "654024",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州巩留县"
                        },
                        {
                            "name": "新源县",
                            "pId": "6540",
                            "id": "654025",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州新源县"
                        },
                        {
                            "name": "昭苏县",
                            "pId": "6540",
                            "id": "654026",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州昭苏县"
                        },
                        {
                            "name": "特克斯县",
                            "pId": "6540",
                            "id": "654027",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州特克斯县"
                        },
                        {
                            "name": "尼勒克县",
                            "pId": "6540",
                            "id": "654028",
                            "fullname": "新疆维吾尔自治区伊犁哈萨克自治州尼勒克县"
                        }
                    ]
                },
                {
                    "name": "塔城地区",
                    "pId": "65",
                    "id": "6542",
                    "fullname": "新疆维吾尔自治区塔城地区",
                    "items": [
                        {
                            "name": "塔城市",
                            "pId": "6542",
                            "id": "654201",
                            "fullname": "新疆维吾尔自治区塔城地区塔城市"
                        },
                        {
                            "name": "乌苏市",
                            "pId": "6542",
                            "id": "654202",
                            "fullname": "新疆维吾尔自治区塔城地区乌苏市"
                        },
                        {
                            "name": "额敏县",
                            "pId": "6542",
                            "id": "654221",
                            "fullname": "新疆维吾尔自治区塔城地区额敏县"
                        },
                        {
                            "name": "沙湾县",
                            "pId": "6542",
                            "id": "654223",
                            "fullname": "新疆维吾尔自治区塔城地区沙湾县"
                        },
                        {
                            "name": "托里县",
                            "pId": "6542",
                            "id": "654224",
                            "fullname": "新疆维吾尔自治区塔城地区托里县"
                        },
                        {
                            "name": "裕民县",
                            "pId": "6542",
                            "id": "654225",
                            "fullname": "新疆维吾尔自治区塔城地区裕民县"
                        },
                        {
                            "name": "和布克赛尔蒙古自治县",
                            "pId": "6542",
                            "id": "654226",
                            "fullname": "新疆维吾尔自治区塔城地区和布克赛尔蒙古自治县"
                        }
                    ]
                },
                {
                    "name": "阿勒泰地区",
                    "pId": "65",
                    "id": "6543",
                    "fullname": "新疆维吾尔自治区阿勒泰地区",
                    "items": [
                        {
                            "name": "阿勒泰市",
                            "pId": "6543",
                            "id": "654301",
                            "fullname": "新疆维吾尔自治区阿勒泰地区阿勒泰市"
                        },
                        {
                            "name": "布尔津县",
                            "pId": "6543",
                            "id": "654321",
                            "fullname": "新疆维吾尔自治区阿勒泰地区布尔津县"
                        },
                        {
                            "name": "富蕴县",
                            "pId": "6543",
                            "id": "654322",
                            "fullname": "新疆维吾尔自治区阿勒泰地区富蕴县"
                        },
                        {
                            "name": "福海县",
                            "pId": "6543",
                            "id": "654323",
                            "fullname": "新疆维吾尔自治区阿勒泰地区福海县"
                        },
                        {
                            "name": "哈巴河县",
                            "pId": "6543",
                            "id": "654324",
                            "fullname": "新疆维吾尔自治区阿勒泰地区哈巴河县"
                        },
                        {
                            "name": "青河县",
                            "pId": "6543",
                            "id": "654325",
                            "fullname": "新疆维吾尔自治区阿勒泰地区青河县"
                        },
                        {
                            "name": "吉木乃县",
                            "pId": "6543",
                            "id": "654326",
                            "fullname": "新疆维吾尔自治区阿勒泰地区吉木乃县"
                        }
                    ]
                },
                {
                    "name": "自治区直辖县级行政区划",
                    "pId": "65",
                    "id": "6590",
                    "fullname": "新疆维吾尔自治区自治区直辖县级行政区划",
                    "items": [
                        {
                            "name": "石河子市",
                            "pId": "6590",
                            "id": "659001",
                            "fullname": "新疆维吾尔自治区自治区直辖县级行政区划石河子市"
                        },
                        {
                            "name": "阿拉尔市",
                            "pId": "6590",
                            "id": "659002",
                            "fullname": "新疆维吾尔自治区自治区直辖县级行政区划阿拉尔市"
                        },
                        {
                            "name": "图木舒克市",
                            "pId": "6590",
                            "id": "659003",
                            "fullname": "新疆维吾尔自治区自治区直辖县级行政区划图木舒克市"
                        },
                        {
                            "name": "五家渠市",
                            "pId": "6590",
                            "id": "659004",
                            "fullname": "新疆维吾尔自治区自治区直辖县级行政区划五家渠市"
                        }
                    ]
                }
            ]
        }
    ];